importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(   
		//	Array(4000463,10,1,1),//国庆币
			Array(1122017,2,1,1),//精灵吊坠
			Array(1002357,3,1,1),//扎昆头盔
			//Array(1122000,5,1,1),//黑龙项链
			//Array(1022144,5,1,1),//眼饰
			//Array(1012474,5,1,1),//脸饰
			Array(1092030,20,1,1),//枫叶盾
			Array(1092029,10,1,1),//电磁盾
			Array(1092021,10,1,1),//光子盾
			Array(1092008,20,1,1),//锅盖
			
//飞侠
			Array(2070006,15,1,1),  //齿轮
			Array(2070007,15,1,1),  //月牙
			Array(2070005,25,1,1),  //金钱
			Array(1472033,50,1,1),  //虎纹拳套
			Array(1472031,80,1,1),  //龙之拳
			Array(1332027,80,1,1),  //飞羽刃
			Array(1332052,80,1,1),  //阴风碎魂刃
			Array(1472029,200,1,1),  //黑闪电甲
			Array(1472025,100,1,1),  //黑战神拳套
			Array(1082144,200,1,1),  //幻光手套
			Array(1040118,100,1,1),  //红扣带护甲
			Array(1060107,200,1,1),  //红色霹雳裤
			Array(1050099,200,1,1),  //黑侠盗服
//战士
			Array(1402037,5,1,1),//龙背刃
			Array(1432011,40,1,1),  //寒冰破魔枪
			Array(1432030,20,1,1),  //红莲
			//Array(1402016,5,1,1),  //所罗门
			Array(1302023,40,1,1),  //六脉神剑
			Array(1302056,50,1,1),  //一刀两断
			Array(1422013,100,1,1),  //狮子之魂
			Array(1402035,50,1,1),  //斩天刀
			Array(1402005,100,1,1),  //斩魔刀
			Array(1312015,100,1,1),  //战魂之斧
			Array(1422027,100,1,1),  //泰坦之锤
			Array(1402012,100,1,1),  //霸王剑
			Array(1422009,200,1,1),  //妖精之锤
			Array(1092027,150,1,1),  //银圣十字盾
			Array(1002532,100,1,1),  //黑色格莱西头盔
			Array(1072222,100,1,1),  //龙纹战靴

//法师
		//	Array(1372041,10,1,1),  //寒冰之杖
		//	Array(1372032,10,1,1),  //佘太君龙杖
			Array(1382047,30,1,1),  //冰灵珠长杖
			Array(1372037,100,1,1),  //冰灵珠短杖
		//	Array(1372039,10,1,1),  //爆炎之杖
			Array(1382045,30,1,1),  //火灵珠长杖
			Array(1372035,100,1,1),  //火灵珠短杖
		//	Array(1372040,10,1,1),  //剧毒之杖
			Array(1382046,30,1,1),  //毒灵珠长杖
			Array(1372036,100,1,1),  //毒灵珠短杖
		//	Array(1372042,10,1,1),  //狂雷之杖
			Array(1382048,30,1,1),  //雷灵珠长杖
			Array(1372038,100,1,1),  //雷灵珠短杖
			Array(1372010,50,1,1),  //嗜魂
			Array(1382035,50,1,1),  //冰肌玲珑
			Array(1372009,80,1,1),  //慈悲为怀
			Array(1372016,150,1,1),  //凤凰短杖
			Array(1002253,200,1,1),  //蓝神圣之冠
			Array(1050074,150,1,1),  //黑神仙服
			Array(1051097,150,1,1),  //黑祭司长袍
			Array(1072209,100,1,1),  //杰斯特鞋
			Array(1050105,100,1,1),  //灰幻魔长袍
			
//弓箭手
			Array(1462018,80,1,1),  //红炎机神弩
			Array(1452017,80,1,1),  //魔翼之弓
			Array(1452019,80,1,1),  //天鹰白
			Array(1452021,80,1,1),  //天鹰黑
			Array(1462017,80,1,1),  //黑暗圣瑶弩
			Array(1452011,100,1,1),  //黄神弓
			Array(1072205,150,1,1),  //夜精灵靴
			Array(1050108,150,1,1),  //红飞羽服
			
			Array(1032080, 150, 1, 1),//一代不速之客耳环
			Array(1132036, 150, 1, 1),//一代不速之客腰带
			Array(1122081, 150, 1, 1),//一代不速之客项链
			Array(1032081, 80, 1, 1),//二代不速之客耳环
			Array(1132037, 80, 1, 1),//二代不速之客腰带
			Array(1122082, 80, 1, 1),//二代不速之客项链
			Array(1302143, 150, 1, 1),//一代不速之客单手剑
			Array(1312058, 150, 1, 1),//一代不速之客单手斧
			Array(1322086, 150, 1, 1),//一代不速之客单手钝器
			Array(1332121, 150, 1, 1),//一代不速之客短剑-力
			Array(1332116, 150, 1, 1),//一代不速之客短剑-运
			Array(1372074, 150, 1, 1),//一代不速之客短杖
			Array(1382095, 150, 1, 1),//一代不速之客长杖
			Array(1402086, 150, 1, 1),//一代不速之客双手剑
			Array(1412058, 150, 1, 1),//一代不速之客双手斧
			Array(1422059, 150, 1, 1),//一代不速之客双手钝器
			Array(1442107, 150, 1, 1),//一代不速之客矛
			Array(1452102, 150, 1, 1),//一代不速之客弓
			Array(1462087, 150, 1, 1),//一代不速之客弩
//御守
			Array(2022219, 400, 1, 1),//蝙蝠怪御守
			Array(2022223, 200, 1, 1),//扎昆御守
			Array(2022220, 150, 1, 1),//星光精灵御守
			Array(2022216, 200, 1, 1),//蘑菇王御守
			Array(2022217, 100, 1, 1),//皮亚奴斯御守
			Array(2022218, 200, 1, 1),//帕普拉图斯御守
			Array(2022245, 80, 1, 1),//心跳停止糖
//点装
			Array(1003005,500,1,1),//枫叶赛车头盔
			Array(1072408,200,1,1),//枫叶赛车鞋
			Array(1052214,200,1,1),//枫叶赛车服
			Array(1082255,200,1,1),//枫叶赛车手套
			Array(1050293,200,1,1),//海滩帅锅装
			Array(1004640,200,1,1),//怪物联盟棒球帽
			Array(1052634,200,1,1),//简洁白衬衫
			Array(1051409,200,1,1),//闪亮艾斯女孩
			Array(1042078,200,1,1),//水手服
			Array(1052998,200,1,1),//外星人连身衣
			Array(1052224,200,1,1),//草莓baby装
			Array(1042198,200,1,1),//彩虹t恤
			Array(1042204,200,1,1),//汉堡t恤
			Array(1052056,200,1,1),//韩国足球服
			Array(1702625,200,1,1),//爱情蓝鸟武器
			Array(1702589,200,1,1),//樱花物语
			Array(1702375,200,1,1),//亚特兰蒂斯
			Array(1702457,200,1,1),//冬天里的雪糕
			Array(1042104,200,1,1),//小绿叶T恤
			Array(1042105,200,1,1),//小红叶T恤
			Array(1012131,200,1,1),//好白的牙齿
			Array(1042142,200,1,1),//彩虹条背心
			Array(1062093,200,1,1),//嫩绿休闲短裤
			Array(1702611,200,1,1),//小鸭单肩包
			Array(1004636,200,1,1),//香蕉郊游帽
			Array(1042349,200,1,1),//黑色摇滚连帽衫
			Array(1012049,200,1,1),//怪物面具
			Array(1002555,200,1,1),//葛布灵面具
			Array(1003710,200,1,1),//怪医黑杰克帽
			Array(1702660,200,1,1),//调皮雪人武器
			Array(1702640,200,1,1),//兔儿雪绒绒
			Array(1082592,200,1,1),//焰鬼隐布
			Array(1000003,200,1,1),//鬼面具
			Array(1102066,200,1,1),//邪魔披风
			Array(1052948,200,1,1),//奥尔卡的睡袍
			Array(1004540,200,1,1),//奥尔卡的睡帽
			Array(1052951,200,1,1),//波点连身裙
			Array(1102778,200,1,1),//棒棒糖披风
			Array(1102142,200,1,1),//火焰披风
			Array(1102749,200,1,1),//五彩星星气球
			Array(1102754,200,1,1),//群鸟之星
			Array(1102755,200,1,1),//星光点点气球
			Array(1102756,200,1,1),//微笑玉米斗篷
			Array(1102757,200,1,1),//巴尼兔心形气球
			Array(1102808,200,1,1),//啵啵鼠气球
			Array(1102692,200,1,1),//小小寿司团
			Array(1102688,200,1,1),//双色砰砰炮
			Array(1102682,200,1,1),//未来天使注射器
			Array(1102684,200,1,1),//未来医生听诊器
			Array(1102676,200,1,1),//摇摆猫咪酱
			Array(1102220,200,1,1),//小绵羊披风
			Array(1102665,200,1,1),//狐狸围脖
			Array(1102605,200,1,1),//暗炎赎罪者
			Array(1072484,200,1,1),//黑猫拖鞋
			Array(1072258,200,1,1),//白猫拖鞋
			Array(1072337,200,1,1),//喜羊羊拖
			Array(1082312,200,1,1),//彩虹护腕
			Array(1082493,200,1,1),//海豹白白手套
			Array(1082581,200,1,1),//巧克力发带装饰
			Array(1082549,200,1,1),//咯咯嗒手套
			Array(1082503,200,1,1),//圣洁天使手镯
			Array(1082548,200,1,1),//星星手镯
			
			Array(1112150,200,1,1),//天使降临名片戒指
			Array(1112176,200,1,1),//旋律音符名片戒指
			Array(1112184,200,1,1),//富豪泰格尔名片戒指
			Array(1112191,200,1,1),//蜜蜂名片戒指
			Array(1112192,200,1,1),//菠萝甜心名片戒指
			Array(1112197,200,1,1),//晚安小怪兽名片戒指
			Array(1112808,200,1,1),//钻石聊天戒指
			Array(1112210,200,1,1),//黄金聊天戒指
			Array(1112218,200,1,1),//小熊猫聊天戒指
			Array(1112103,200,1,1),//嫩黄名片戒指
			
			Array(1004530,200,1,1),//蓝色熊猫玩偶帽子
			Array(1004532,200,1,1),//女皇关注
			Array(1004533,200,1,1),//兰儿在游戏！
			Array(1004505,200,1,1),//粉红樱花丝带
			Array(1004488,200,1,1),//治愈之丝带
			Array(1004486,200,1,1),//春之主人
			Array(1004467,200,1,1),//特大爱心宽檐帽
			Array(1004468,200,1,1),//小小训练师帽
			Array(1004454,200,1,1),//狸猫帽子
			Array(1004414,200,1,1),//热腾腾包子帽
			Array(1004328,200,1,1),//粉色棒球帽
			Array(1004156,200,1,1),//来这星星的你
			Array(1004108,200,1,1),//幻夜蝶华礼帽
	
			//Array(4000487,30,1,1),//暗影币
			Array(5150038,50,1,1),//超级明星5000016
			Array(5150040,100,1,1),//皇家1032026
			//Array(5000016,30,1,1),//云豹
			//Array(4031559,100,1,1),//汉斯邮票
			//Array(4031560,100,1,1),//达鲁克邮票
			//Array(4031558,100,1,1),//武术教练邮票
			//Array(4031561,100,1,1),//赫丽娜邮票
			//Array(4251200,10,1,1),//下等五彩水晶
			//Array(4251201,10,1,1),//中等五彩水晶
			//Array(4251202,10,1,1),//高等五彩水晶4004000
			//Array(4004000,1000,1,1),//矿
			//Array(4004001,1000,1,1),//矿
			//Array(4004002,1000,1,1),//矿
			//Array(4004003,1000,1,1),//矿
			//Array(4004004,700,1,1),//矿4031179
			Array(4031179,500,1,1),//D片
			Array(4001017,500,1,1),//火眼
			Array(2340000,200,1,1),//祝福卷轴
			Array(2049000,450,1,1),//白衣卷轴
			Array(2049001,350,1,1),//白衣卷轴
			Array(2049002,250,1,1),//白衣卷轴
			Array(2049100,500,1,1),//浑沌卷轴
			Array(2040914,30,1,1),//盾牌攻击卷轴  
			Array(2040915,30,1,1),//头盔攻击卷轴
			Array(2040025,30,1,1),//头盔智力卷轴  
			Array(2040026,100,1,1),//腰带力量卷轴  
			Array(2041302,10,1,1),
			Array(2041301,100,1,1),//腰带敏捷卷轴
			Array(2041307,10,1,1),  
			Array(2041308,10,1,1),
			Array(2041304,100,1,1),//腰带智力卷轴  
			Array(2041305,10,1,1),
			Array(2041310,100,1,1),//腰带运气卷轴  
			Array(2041311,10,1,1),			
			Array(1002513,100,1,1),//周年纪念帽
			Array(1002930,100,1,1),//周年纪念帽
			Array(1003104,100,1,1),//周年纪念帽
			Array(1032026,10,1,1),//黄水晶
			Array(1032028,200,1,1),//红水晶
			Array(1002419,1000,1,1),//枫叶帽
			Array(1002510,1000,1,1),//枫叶头盔30级
			Array(1002511,500,1,1),//枫叶头盔70级
			Array(1002758,200,1,1),//枫叶头盔90级		
			
			Array(1002677,150,1,1),//玩具匠人帽
			//Array(1002798,1000,1,1),//年糕1002798
			Array(1002743,150,1,1),//海洋之帽
			Array(1002939,50,1,1),//安全帽
			//Array(1002391,1000,1,1),//海盗头巾(绿) 
			//Array(1002392,1000,1,1),//海盗头巾(红) 
			//Array(1002393,1000,1,1),//海盗头巾(粉) 
			//Array(1002394,1000,1,1),//海盗头巾(灰) 
			//Array(1002395,1000,1,1),//海盗头巾(紫)
			//Array(1002585,1000,1,1),//蓝色烤栗贩帽子
			//Array(1002586,1000,1,1),//紫色烤栗贩帽子
			//Array(1002587,1000,1,1),//黑色烤栗贩帽子
			//Array(1082002,1000,1,1),//工地手套
			//Array(1082145,500,1,1),//工地手套(黄) 
			//Array(1082146,500,1,1),//工地手套(红) 
			//Array(1082147,500,1,1),//工地手套(蓝) 
			//Array(1082148,500,1,1),//工地手套(紫) 
			//Array(1082149,500,1,1),//工地手套(褐) 
			//Array(1082150,300,1,1),//工地手套(灰)1472063 
//-------武器-------
			Array(1322054,200,1,1), //枫叶地震锤
			Array(1412027,200,1,1), //枫叶乾坤轮
			Array(1422029,200,1,1), //枫叶轰天镗
			Array(1442051,200,1,1), //枫叶战斧
			Array(1432040,150,1,1),//枫叶钻天枪
			Array(1302064,150,1,1),//枫叶突击剑
			Array(1402039,150,1,1),//枫叶枭首剑
			Array(1382039,150,1,1),//枫叶丹心杖
			Array(1452045,150,1,1),//枫叶happy弓
			Array(1462040,200,1,1),//枫叶击星弩
			Array(1472055,150,1,1),//枫叶定天拳
			Array(1332056,150,1,1),//枫叶追魂刺
			Array(1472063,300,1,1),//魔法手套
			Array(1102040,300,1,1),//浪人披风(黄) 
			Array(1102043,300,1,1),//浪人披风(褐)  
			Array(1102042,100,1,1),//浪人披风(紫) 
			Array(1102041,100,1,1),//浪人披风(粉)
			Array(1102085,1000,1,1),//黄色盖亚披风
			Array(1102086,100,1,1),//蓝色盖亚披风
			Array(1102084,80,1,1),//粉红盖亚披风
			Array(1102163,20,1,1),//贵族披风
			//Array(1102079,1000,1,1),//破旧的红色披风
			//Array(1102081,1000,1,1),//破旧的黄色披风
			//Array(1102082,500,1,1),//破旧的黑色披风
			//Array(1102211,1000,1,1),//战神的披风
			//Array(1072262,500,1,1),//黑色桃乐斯皮鞋
			//Array(1072264,500,1,1),//银色桃乐斯皮鞋
			//Array(1072369,300,1,1),//1072369绿水灵鞋子
			Array(1012070,20,1,1),//雪糕+攻
			Array(1012071,100,1,1),//雪糕全属性
			Array(1012072,500,1,1),//狐猴
			Array(1012073,1000,1,1),//狐猴
			Array(1022060,100,1,1),//狐猴
			Array(1022067,100,1,1),//黑狐猴
			Array(1012056,100,1,1),//狗狗鼻子1012056
			Array(1012161,20,1,1),//发光的鼻子
			Array(1022066,500,1,1),//蓝海星眼镜
			Array(1050100,50,1,1),//浴袍1050100
			Array(1050127,50,1,1),//浴袍1050100
			Array(1051098,50,1,1),//浴袍1050100
			Array(1051140,50,1,1),//浴袍1050100
			Array(1402063,30,1,1),//樱花伞
			Array(1302058,1000,1,1),//枫叶伞
			Array(1302026,1000,1,1),//伞1302026
			Array(1302027,1000,1,1),//伞1302026
			Array(1302028,1000,1,1),//伞1302026
			Array(1302029,1000,1,1),//伞1302026
			Array(1302071,1000,1,1),//粉色游泳圈
			Array(1322021,1000,1,1),//游泳圈
			Array(1322022,500,1,1),//游泳圈
			Array(1322023,1000,1,1),//游泳圈
			Array(1322024,300,1,1),//游泳圈
			Array(1322025,250,1,1),//游泳圈
			Array(1322026,200,1,1),//游泳圈
			Array(1442054,1000,1,1),//滑板
			Array(1442055,300,1,1),//滑板
			Array(1442056,300,1,1),//滑板
			Array(1442057,300,1,1),//滑板
			
			Array(1432016,300,1,1),//滑板1432016
			Array(1432017,300,1,1),//滑板1432016
			Array(1432018,300,1,1),//滑板1432016
			Array(1442012,300,1,1),//雪板0
			Array(1442013,500,1,1),//雪板12
			Array(1442014,500,1,1),//雪板24
			Array(1442015,700,1,1),//雪板36
			Array(1442016,300,1,1),//雪板48
			Array(1442017,300,1,1),//雪板60
			Array(1442046,300,1,1),//超级滑板
			Array(1442021,700,1,1),//黄拖把
			Array(1442022,500,1,1),//白拖把
			Array(1442023,700,1,1),//黑拖把
			//Array(2370008,2000,1,1),//经验书2370008
			//Array(2370009,2000,1,1),//经验书2370008
			//Array(2370010,2000,1,1),//经验书2370008
			//Array(2370011,2000,1,1),//经验书2370008
			//Array(2370012,2000,1,1),//经验书2370008
			Array(2370000,50,1,1),//经验书10W
			Array(2370001,80,1,1),//经验书5W
			Array(2370002,100,1,1),//经验书3W
			Array(2370003,200,1,1),//经验书2W
			Array(2370004,300,1,1),//经验书
			//Array(2370005,2000,1,1),//经验书
			//Array(2370006,2000,1,1),//经验书
			//Array(2370007,2000,1,1),//经验书
			//Array(1302037,100,1,1),//小号
			Array(5390006,300,1,1),//咆哮喇叭5390006
			Array(5390000,300,1,1),//喇叭5390006
			Array(5390001,300,1,1),//喇叭5390006
			Array(5390002,300,1,1),//喇叭5390006
			Array(5390003,300,1,1),//喇叭5390006
			Array(5390004,300,1,1),//喇叭5390006
			Array(5390005,300,1,1),//喇叭5390006
			Array(1092022,30,1,1),//调色板盾牌
			Array(1072238,100,1,1),//紫色钉鞋
			Array(1072239,100,1,1),//黄色钉鞋
			Array(1002663,500,1,1),//可乐帽子
			Array(1302063,50,1,1),//燃烧的火焰刀
			Array(1302106,50,1,1),//燃烧的冰焰刀
			Array(1302080,100,1,1),//冒险岛小灯泡
			Array(1302085,100,1,1),//叉子
			Array(1302087,1000,1,1),//火炬
			Array(1382015,50,1,1),//毒蘑菇
			Array(1382016,50,1,1),//香菇
			Array(1402044,300,1,1),//南瓜灯笼
			Array(1302061,100,1,1),//蔓藤鞭子
			Array(1422030,300,1,1),//粉红海豹抱枕
			Array(1422031,300,1,1),//蓝色海豹抱枕
			Array(1432046,300,1,1),//圣诞树手杖
			Array(1432013,100,1,1),//南瓜枪
        	Array(1302024,500,1,1),//废报纸武器
        	Array(1322051,300,1,1),//七夕
        	Array(1402014,30,1,1),//温度计
        	Array(1402029,100,1,1),//鬼刺狼牙棒
        	Array(1422011,300,1,1),//酒瓶
        	Array(1332053,500,1,1),//野外烧烤
        	Array(1372017,100,1,1),//领路灯
			Array(5570000,100,1,1),//金锤子
        	Array(1422036,100,1,1),//玩具锤子
			Array(1302021,1000,1,1),//玩具锤子1302021
        	Array(1322027,300,1,1),//平底锅
        	Array(1442039,300,1,1),//冻冻鱼
        	Array(1302019,200,1,1),//无名剑
        	Array(1332021,300,1,1),//乌龙茶
        	Array(1302128,1000,1,1),//火柴	
        	Array(1302084,1000,1,1),//火柴
        	Array(1402013,100,1,1),//白日剑
			Array(1302036,300,1,1),//枫叶小旗
			Array(1302049,100,1,1),//光线鞭
			Array(1302001,1000,1,1),//锯子
			Array(1312012,500,1,1),//呼啦圈
			Array(1322006,1000,1,1),//钢管
			Array(1422011,300,1,1),//清酒
			Array(1432039,100,1,1),//钓鱼竿
			//Array(2000005,100,1,1),//超级药水
			//Array(2000004,500,1,1),//特殊药水
			//Array(2210005,500,1,1),//提摩
			//Array(2210010,500,1,1),//女超		
        	Array(3010112,500,1,1),
			Array(1702246,150,1,1),//幽魂武器	
        	Array(1702248,150,1,1),//圣诞鹿武器	
        	Array(1702278,150,1,1),//枫之武器	
        	Array(1702305,150,1,1),//胡萝卜武器
        	Array(1702335,150,1,1),//炼金师的武器	
        	Array(1702392,150,1,1),//黑暗小恶魔武器	
        	Array(1702393,150,1,1),//蛇年武器	
        	Array(1702372,150,1,1),//圣杯武器
        	Array(1702408,150,1,1),//纪念日专用武器	
        	Array(1702401,150,1,1),//兔子胡萝卜武器
        	Array(1702459,150,1,1),//棉花糖武器
        	Array(1702460,150,1,1),//星星武器	
        	Array(1702499,300,1,1),//林之灵武器	
        	Array(1702550,150,1,1),//桃太郎武器	
        	Array(1702538,150,1,1),//露珠武器	
        	Array(1702508,150,1,1),//草莓牛奶武器
        	Array(1702588,150,1,1),//黑猫玩具武器	
        	Array(1702598,150,1,1),//枫叶武器	
        	Array(1702597,150,1,1),//彩虹贝壳武器	
        	Array(1702579,150,1,1),//水晶喵喵武器	
        	Array(1702576,150,1,1),//啪嗒啪嗒打糕武器	
        	Array(1702660,150,1,1),//调皮雪人武器	
        	Array(1702669,150,1,1),//公主日记武器	
        	Array(1702617,150,1,1),//幻想莲花武器	
        	Array(1702637,150,1,1),//音乐律动武器箱
        	Array(1702625,150,1,1),//爱情蓝鸟武器
        	//Array(1472063,100,1,1),//魔法手套
        	Array(1062073,300,1,1),//特别南瓜裤(米)点
        	Array(1062074,300,1,1),//特别南瓜裤(黑褐)点
//-----椅子-----
			Array(3010125,80, 1, 1), //尼贝龙战舰椅子
			Array(3010124,80, 1, 1), //都纳斯喷气椅子
			Array(3010120,100, 1, 1), //彩蛋篮子
			Array(3010093,100, 1, 1), //鲜美的火鸡
			Array(3010075,50, 1, 1), //我为音乐狂
			Array(3010212,100, 1, 1), //藏獒椅子
			Array(3010462,200,1,1), //天文台
			Array(3010412,200,1,1), //双塔
			Array(3010149,200,1,1), //风扇
			Array(3015428,200, 1, 1), //和猴子一起放烟花椅子
			Array(3010795,200, 1, 1), //森林中休息处
			Array(3010206,300, 1, 1), //梦想画家椅子
			Array(3015225,100, 1, 1), //和大象一起自拍椅子
			Array(3010976,80, 1, 1), //为我加油！椅子
			Array(3010999,80, 1, 1), //主人请用餐椅子
			Array(3010804,200, 1, 1), //军人月妙拜年椅子
			Array(3010899,200, 1, 1), //摆钟椅子
			Array(3015120,100,1,1), //枕头大战
		    Array(3010043,100,1,1),//魔女的飞扫把
		    Array(3015051,10,1,1),//巨无霸国际巨星
		    Array(3015183,10,1,1),//绿水灵背景椅子
		    Array(3015096,10,1,1),//羊羊幻想牧场椅子
		    Array(3010180,1000,1,1),//HP椅子
		    Array(3010009,10,1,1),//粉色爱心马桶
		    Array(3010028,100,1,1),//老海盗椅子
		    Array(3012006,50,1,1),//风吹稻香
        	Array(3010013,10,1,1),//悠长假期
			Array(3010034,10,1,1),//悠长假期
			Array(3010035,10,1,1),//悠长假期
        	Array(3010014,500,1,1),//月亮弯
        	Array(3010018,1000,1,1),//椰子树沙滩椅
        	Array(3010025,1000,1,1),//枫叶纪念凳
        	Array(3012001,1000,1,1),//篝火
        	Array(3012002,100,1,1),//浴桶---
        	Array(3010073,50,1,1),//PB克缤
        	Array(3010049,50,1,1),//雪房子
        	Array(3010068,50,1,1),//露水椅子
        	Array(3010070,10,1,1),//巨无霸品克缤
        	Array(3010095,100,1,1),//石头人座椅
//-----后期植入椅子-----
        	Array(3010898,100,1,1),//迷你神兽椅子
        	Array(3010465,100,1,1),//可爱音符椅子
        	Array(3010460,100,1,1),//爆竹椅子
        	Array(3010450,100,1,1),//艾莉珍椅子
        	Array(3010455,100,1,1),//扎昆的帝王椅子
        	Array(3010456,100,1,1),//杜鹃花椅子
        	Array(3010458,100,1,1),//翻滚兔子椅子
        	Array(3010863,50,1,1),//愤怒的美发师椅子
        	Array(3010447,100,1,1),//睡觉小鸟椅子
        	Array(3010446,100,1,1),//皮肤皇后椅子
        	Array(3010448,100,1,1),//泡泡浴椅子
        	Array(3010434,100,1,1),//热带夏日椅子
        	Array(3010428,100,1,1),//水晶椅子
        	Array(3010409,100,1,1),//粽子椅子
      	    Array(3010094,100,1,1),//漂漂猪椅子-----------------------
        	Array(3010411,100,1,1),//鱼尾狮椅子
        	Array(3010085,50,1,1),//鬼娃娃椅子
        	Array(3010077,100,1,1),//猫头鹰椅子
        	Array(3010053,50,1,1),//兔子纪念版椅子
        	Array(3010151,200,1,1),//无人岛椅子
        	Array(3015415,50,1,1),//猴子椅子
        	Array(3010142,50,1,1),//水族馆椅子
        	Array(3010144,100,1,1),//七夕椅子
        	Array(3015430,100,1,1),//年兽椅子
        	Array(3010117,100,1,1),//魔法书椅子
        	Array(3015424,100,1,1),//超级饺子椅子
        	Array(3015428,100,1,1),//和猴子一起放烟花椅子
        	Array(3015427,100,1,1),//和猴子一起玩麻将椅子
        	Array(3010804,100,1,1),//军人月妙拜年椅子
        	Array(3015045,50,1,1),//羊绒咩咩椅子--------------
        	Array(3010375,50,1,1),//奥妙的超级药水椅子
        	Array(3015057,50,1,1),//烟花绽放椅子
        	Array(3010373,50,1,1),//云朵洗手间椅子
        	Array(3010799,100,1,1),//坟墓幽灵椅子
        	Array(3010737,50,1,1),//动物英雄团椅子
        	Array(3010734,100,1,1),//猫箱椅子
        	Array(3010738,50,1,1),//闪电三人组椅子
        	Array(3010740,100,1,1),//圣诞树椅子
        	Array(3010365,100,1,1),//休彼德蔓的古代石掌椅子
        	Array(3010306,100,1,1),//生如夏花椅子
        	Array(3010301,50,1,1),//高级HP药水椅子
        	Array(3010188,100,1,1),//班·雷昂椅子
        	Array(3010186,100,1,1),//兔子椅子
        	Array(3010184,50,1,1),//冰钓椅子
         	Array(3010173,50,1,1),//万圣节塔罗椅子
        	Array(3010175,50,1,1),//名画家椅子
        	Array(3010195,100,1,1),//无价之宝椅子
        	Array(3010210,100,1,1),//草莓冰淇淋月饼椅子--------------
        	Array(3010224,300,1,1),//年糕冰淇淋椅子
        	Array(3010036,50,1,1),//浪漫秋千
        	Array(3010044,50,1,1),//同一红伞下
        	Array(3010111,100,1,1),//虎虎生威
        	Array(3010115,100,1,1),//熊宝宝床
        	Array(3010126,50,1,1),//蝙蝠魔王座
        	Array(3010313,50,1,1),//粉红扎昆椅子
        	Array(3010128,50,1,1),//黑龙王座
        	Array(3010133,100,1,1),//帐篷椅
        	Array(3010152,200,1,1),//黄三角帐篷椅
        	Array(3010291,100,1,1),//早日康复床
        	Array(3010172,100,1,1),//星空椅子
        	Array(3010168,100,1,1),//友谊万岁椅子
        	Array(3010185,100,1,1),//小伙伴品克缤
        	Array(3010622,100,1,1),//我的好友丹珍之椅
        	Array(3010453,100,1,1),//兔子乘风椅
        	Array(3010493,100,1,1),//那就是我--------------------------------
        	Array(3010527,100,1,1),//深海章鱼
        	Array(3010531,100,1,1),//小企鹅合唱团
        	Array(3010565,100,1,1),//我的女皇椅子
        	Array(3010587,100,1,1),//时间胶囊
        	Array(3010609,100,1,1),//不是在做梦
        	Array(3010608,100,1,1),//完美的名画椅子
        	Array(3010661,100,1,1),//欢乐相框椅子
        	Array(3010678,100,1,1),//海加顿之安息
        	Array(3010739,100,1,1),//雪人香波椅子
        	Array(3010744,100,1,1),//冒险岛的砖头朋友们
        	Array(3010752,100,1,1),//玫瑰鸟笼
        	Array(3010756,100,1,1),//新年招财猫椅子
        	Array(3010767,100,1,1),//雪人椅子
        	Array(3010760,100,1,1),//古代浴池椅子
        	Array(3010795,100,1,1),//森林中休息处
        	Array(3010806,100,1,1),//桃樱芳菲椅
        	Array(3010848,100,1,1),//红地毯主人公椅子
        	Array(3012024,100,1,1),//沙滩排球椅子
			Array(1142073, 150, 1, 1), //-----勋章-----
			Array(1142075, 150, 1, 1), //
			Array(1142654, 150, 1, 1), //
			Array(1142650, 150, 1, 1), //
			Array(1142443, 150, 1, 1), //
			Array(1142360, 150, 1, 1), //
			Array(1142119, 150, 1, 1), //
			Array(1142101, 150, 1, 1), //
			Array(1142120, 150, 1, 1), //
			Array(1142081, 150, 1, 1), //
			Array(1142118, 150, 1, 1), //
			Array(1142114, 150, 1, 1), //
			Array(1142076, 150, 1, 1), //
			Array(1142116, 150, 1, 1), //
			Array(1142115, 150, 1, 1), //
			Array(1142082, 150, 1, 1), //
			Array(1142117, 150, 1, 1), //
			Array(1142113, 150, 1, 1), //
			Array(1142112, 150, 1, 1), //
			Array(1142006, 150, 1, 1), //
			Array(1142231, 150, 1, 1), //
			Array(1142233, 150, 1, 1), //
			Array(1142230, 150, 1, 1), //
			Array(1142232, 150, 1, 1) //
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r该玩具箱可以获得以下物品，99%获得\r\n\#b是否随即消耗50W-100W金币来一次？#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
		if (cm.getInventory(1).isFull(0)){//判断第一个也就是装备栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证装备栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(2).isFull(0)){//判断第二个也就是消耗栏的装备栏是否有一个空格	
		cm.sendOk("#b请保证消耗栏位至少有1个空格,否则无法抽奖.");	
		cm.dispose();		
		} else if (cm.getInventory(3).isFull(0)){//判断第三个也就是设置栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证设置栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(4).isFull(0)){//判断第四个也就是其它栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证其它栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(5).isFull(0)){//判断第五个也就是现金栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证特殊栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();
		} else if (cm.getMeso() >= 1000000) {//判断金币
            cm.sendYesNo("本抽奖箱每次随机消耗50W-100W金币，就可以随机获得以下物品，99%获得。\r\n\#b是否随即消耗50W-100W金币来一次？"+selStr);
        } else {
            cm.sendOk("您的金币太少了！");
            cm.safeDispose();
        }
    } else if (status == 1) {
		var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random()*500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
           //var notice = finalitem[finalchance][3];
           // item = cm.gainGachaponItem(itemId, quantity,);//, notice
			var Laba = finalitem[finalchance][3];
			       
				   
				if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
						MapleInventoryManipulator.addFromDrop(cm.getC(),toDrop,false);
				}else{
				 	 var toDrop = new Equip(itemId,0).copy();
					cm.gainItem(itemId,quantity);
				}
				
            if (Laba == 1) {
				var random = java.lang.Math.floor(Math.random() * 500000 + 500000);
                cm.gainMeso(-random); //扣除金币
				cm.itemlaba("[玩具箱-金币(" + random + ")]",toDrop)
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainMeso(-700000); //扣除金币
            cm.safeDispose();
        }
    }
}