importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var itemList =   
Array(   


//------帽子------
//Array(2370010, 1000, 1, 1), 
//Array(2370011, 1000, 1, 1), 
//Array(2370012, 1000, 1, 1), 
//Array(2370000, 800, 1, 1), 
//Array(2370001, 1000, 1, 1), 
//Array(2370002, 1000, 1, 1), 
//Array(2370003, 1000, 1, 1), 
//Array(2370004, 1000, 1, 1), 
//Array(2370005, 1000, 1, 1), 
//Array(2370006, 1000, 1, 1), 
//Array(2370007, 1000, 1, 1), 
//Array(2370008, 1000, 1, 1), 
//Array(2370009, 1000, 1, 1), 
  


Array(1122017, 5, 1, 1),//精灵吊坠
Array(1002939,10,1,1),//安全帽
Array(1132257,10,1,1),//腰带
Array(1002357,30,1,1),//扎昆头盔
Array(1122000,10,1,1),//黑龙项链
Array(2340000,50,1,1),//祝福卷轴
Array(2049000,250,1,1),//白衣卷轴
Array(2049001,150,1,1),//白衣卷轴
Array(2049002,100,1,1),//白衣卷轴
Array(2049100,200,1,1),//浑沌卷轴
Array(2370000, 500, 1, 1),//经验
Array(2370001, 500, 1, 1),//经验
//御守
Array(2022219, 200, 1, 1),//蝙蝠怪御守
Array(2022223, 100, 1, 1),//扎昆御守
Array(2022220, 100, 1, 1),//星光精灵御守
Array(2022216, 120, 1, 1),//蘑菇王御守
Array(2022217, 60, 1, 1),//皮亚奴斯御守
Array(2022218, 120, 1, 1),//帕普拉图斯御守
Array(2022245, 40, 1, 1),//心跳停止糖

Array(1032080, 150, 1, 1),//一代不速之客耳环
Array(1132036, 150, 1, 1),//一代不速之客腰带
Array(1122081, 150, 1, 1),//一代不速之客项链
Array(1032081, 70, 1, 1),//二代不速之客耳环
Array(1132037, 70, 1, 1),//二代不速之客腰带
Array(1122082, 70, 1, 1),//二代不速之客项链
Array(1322054, 70, 1, 1), //枫叶地震锤
Array(1382039, 70, 1, 1), //枫叶丹心杖
Array(1402039, 70, 1, 1), //枫叶枭首剑
Array(1412027, 70, 1, 1), //枫叶乾坤轮
Array(1422029, 70, 1, 1), //枫叶轰天镗
Array(1432040, 70, 1, 1), //枫叶钻天枪
Array(1442051, 70, 1, 1), //枫叶战斧
Array(1452045, 70, 1, 1), //枫叶HAPPY弓
Array(1462040, 70, 1, 1), //枫叶击星弩
Array(1472055, 70, 1, 1), //枫叶定天拳
Array(1332056, 70, 1, 1), //枫叶追魂刺
//Array(1482022, 100, 1, 1), //枫叶金爪
//Array(1492022, 100, 1, 1), //冒险岛加仑手枪
//Array(1492075, 200, 1, 1),//一代不速之客短枪
Array(1302143, 100, 1, 1),//一代不速之客单手剑
Array(1312058, 200, 1, 1),//一代不速之客单手斧
Array(1322086, 200, 1, 1),//一代不速之客单手钝器
Array(1332121, 100, 1, 1),//一代不速之客短剑-力
Array(1332116, 100, 1, 1),//一代不速之客短剑-运
Array(1372074, 100, 1, 1),//一代不速之客短杖
Array(1382095, 100, 1, 1),//一代不速之客长杖
Array(1402086, 100, 1, 1),//一代不速之客双手剑
Array(1412058, 200, 1, 1),//一代不速之客双手斧
Array(1422059, 200, 1, 1),//一代不速之客双手钝器
Array(1432077, 100, 1, 1),//一代不速之客枪
Array(1442107, 200, 1, 1),//一代不速之客矛
Array(1452102, 150, 1, 1),//一代不速之客弓
Array(1462087, 150, 1, 1),//一代不速之客弩
Array(1472113, 100, 1, 1),//一代不速之客 拳套
//Array(1482075, 200, 1, 1),//一代不速之客 指节
//Array(1492075, 200, 1, 1),//一代不速之客短枪
Array(1002418, 800, 1, 1), //废报纸头盔
Array(1002419, 800, 1, 1), //枫叶帽
Array(1002424, 800, 1, 1), //红马术帽
Array(1002425, 800, 1, 1), //蓝马术帽
Array(1002436, 800, 1, 1), //长老斯坦之帽
Array(1002554, 300, 1, 1), //武艺头绳
Array(1002677, 800, 1, 1), //玩具匠人帽
Array(1002699, 200, 1, 1), //南瓜帽子
Array(1002441, 800, 1, 1), //热血头带
Array(1002508, 100, 1, 1), //枫叶头盔
Array(1002509, 100, 1, 1), //枫叶头盔
Array(1002510, 100, 1, 1), //枫叶头盔
Array(1002511, 100, 1, 1), //枫叶头盔
Array(1002391, 800, 1, 1), //海盗头巾(绿)
Array(1002392, 800, 1, 1), //海盗头巾(红)
Array(1002393, 800, 1, 1), //海盗头巾(粉)
Array(1002394, 800, 1, 1), //海盗头巾(灰)
Array(1002395, 800, 1, 1), //海盗头巾(紫)
Array(1002894, 800, 1, 1), //粉色编织发带
Array(1002895, 800, 1, 1), //红色编织发带
Array(1002896, 800, 1, 1), //紫色编织发带
Array(1002897, 800, 1, 1), //橙色编织发带
Array(1002898, 800, 1, 1), //绿色编织发带
Array(1002899, 800, 1, 1), //黄色编织发带
Array(1002900, 800, 1, 1), //蓝色编织发带
//------脸饰------
Array(1012011, 300, 1, 1), //圣诞鹿的鼻子
Array(1012012, 300, 1, 1), //圣诞鹿的鼻子
Array(1012013, 300, 1, 1), //圣诞鹿的鼻子
Array(1012014, 300, 1, 1), //圣诞鹿的鼻子
Array(1012015, 300, 1, 1), //圣诞鹿的鼻子
Array(1012016, 300, 1, 1), //圣诞鹿的鼻子
Array(1012017, 300, 1, 1), //圣诞鹿的鼻子
Array(1012018, 300, 1, 1), //圣诞鹿的鼻子
Array(1012019, 300, 1, 1), //圣诞鹿的鼻子
Array(1012020, 300, 1, 1), //圣诞鹿的鼻子
Array(1012056, 300, 1, 1), //狗狗鼻
Array(1022047, 100, 1, 1), //猫头鹰
Array(1012058, 100, 1, 1), //匹诺曹的鼻子
Array(1012059, 100, 1, 1), //匹诺曹的鼻子
Array(1012060, 100, 1, 1), //匹诺曹的鼻子
Array(1012061, 100, 1, 1), //匹诺曹的鼻子
Array(1122001, 800, 1, 1), //绿色蝶形领结
Array(1122002, 800, 1, 1), //红色蝶形领结
Array(1122003, 800, 1, 1), //黄色蝶形领结
Array(1122004, 800, 1, 1), //粉红蝶形领结
Array(1122005, 800, 1, 1), //黑色蝶形领结
Array(1122006, 800, 1, 1), //蓝色蝶形领结
Array(1012477, 10, 1, 1), //甜瓜味雪糕	
Array(1012420, 10, 1, 1), //水果草莓味雪糕	
Array(1012419, 10, 1, 1), //甜瓜味雪糕	
Array(1012417, 10, 1, 1), //巧克力雪糕	
Array(1012418, 10, 1, 1), //西瓜味雪糕	
Array(1012416, 10, 1, 1), //草莓雪糕	
Array(1012073, 10, 1, 1), //西瓜雪糕	
Array(1012071, 10, 1, 1), //巧克力雪糕	
Array(1012072, 80, 1, 1), //甜瓜雪糕	
Array(1012070, 10, 1, 1), //草莓雪糕
//------吊坠------
Array(1122015, 500, 1, 1), //枫叶围巾
Array(1122074, 300, 1, 1), //枫叶吊坠
Array(1122075, 10, 1, 1), //黄金枫叶魔法吊坠
//------盾牌------
Array(1092022, 300, 1, 1), //调色板盾牌
Array(1092050, 50, 1, 1), //冷艳剑盾
Array(1092049, 50, 1, 1), //热情剑盾
//------披风------
Array(1102053, 800, 1, 1), //破披风
Array(1102046, 100, 1, 1), //侯爵披风
Array(1102047, 100, 1, 1), //伯爵披风
Array(1102048, 100, 1, 1), //公爵披风
Array(1102166, 100, 1,1), //枫叶披风
Array(1102167, 400, 1, 1), //枫叶披风
Array(1102168, 200, 1, 1), //枫叶披风
Array(1102084, 5, 1, 1), //粉红盖亚披风	
Array(1102085, 150, 1, 1), //黄色盖亚披风	
Array(1102086, 100, 1, 1), //紫色盖亚披风
Array(1102041, 10, 1, 1), //浪人披风(粉)	
Array(1102040, 100, 1, 1), //浪人披风(黄)	
Array(1102043, 100, 1, 1), //浪人披风(褐)	
Array(1102042, 10, 1, 1), //浪人披风(紫)
Array(1102163, 5,1,1),//贵族披风
//-------武器------
Array(1051017, 500, 1, 1), //红色桑拿服	
Array(1050018, 500, 1, 1), //蓝色桑拿服
Array(1372017, 300, 1, 1), //领路灯
Array(1302049, 100, 1, 1), //光线鞭子	
Array(1302021, 800, 1, 1), //橡皮榔头
Array(1302022, 800, 1, 1), //竹刀
Array(1302024, 800, 1, 1), //废报纸卷
Array(1302061, 50, 1, 1), //蔓藤鞭子
Array(1302063, 100, 1, 1), //燃烧的火焰刀
Array(1302067, 800, 1, 1), //枫叶庆典旗
Array(1302080, 800, 1, 1), //七彩霓虹灯泡
Array(1302084, 800, 1, 1), //火柴
Array(1302085, 800, 1, 1), //叉子
Array(1302087, 800, 1, 1), //火炬
Array(1312002, 800, 1, 1), //镰刀
Array(1402013, 100, 1, 1), //白日剑
Array(1312012, 800, 1, 1), //乾坤圈
Array(1312013, 800, 1, 1), //判官笔
Array(1312014, 800, 1, 1), //阎王笔
Array(1402029, 300, 1, 1), //鬼刺狼牙棒
Array(1322009, 800, 1, 1), //马桶吸
Array(1322027, 800, 1, 1), //米伽勒的平底锅
Array(1322051, 800, 1, 1), //七夕
Array(1322071, 800, 1, 1), //采矿铁锹
Array(1322053, 800, 1, 1), //棒槌
Array(1332053, 100, 1, 1), //野外烧烤串
Array(1332054, 100, 1, 1), //闪电飞刀
Array(1382015, 500, 1, 1), //毒蘑菇
Array(1382016, 10, 1, 1), //香菇 ——--高级货
Array(1402014, 5, 1, 1), //温度计
Array(1402044, 800, 1, 1), //南瓜灯笼
Array(1422036, 800, 1, 1), //玩具匠人的锤子
Array(1432039, 800, 1, 1), //钓鱼竿
Array(1432046, 800, 1, 1), //圣诞树手杖
Array(1432048, 1, 1, 1), //铲子
Array(1442018, 10, 1, 1), //冻冻鱼
Array(1442021, 800, 1, 1), //黄拖把
Array(1442022, 100, 1, 1), //白拖把
Array(1442023, 800, 1, 1), //黑拖把
Array(1442004, 800, 1, 1), //拖把
Array(1432009, 100, 1, 1), //木精灵枪	
Array(1432132, 100, 1, 1), //木精灵枪
Array(1372031, 10, 1, 1), //圣贤短杖	
Array(1372033, 30, 1, 1), //圣贤短杖
Array(1442121, 10, 1, 1), //敏捷战士的玫瑰
Array(1442122, 10, 1, 1), //恐怖战士的玫瑰
Array(1442123, 100, 1, 1), //愤怒战士的玫瑰
Array(1302017, 800, 1, 1), //蓝色雨伞	
Array(1302016, 800, 1, 1), //黄色雨伞
Array(1302025, 1, 1, 1), //红雨伞
Array(1302026, 1, 1, 1), //黑雨伞
Array(1302027, 300, 1, 1), //绿雨伞
Array(1302028, 300, 1, 1), //紫雨伞
Array(1302029, 300, 1, 1), //褐雨伞
Array(1302035, 50, 1, 1), //枫叶旗
Array(1302036, 50, 1, 1), //枫叶旗
Array(1302058, 300, 1, 1), //冒险岛伞
Array(1302252, 100, 1, 1), //冒险岛雨伞
Array(1432037, 100, 1, 1), //枫叶大将旗
Array(1312033, 500, 1, 1), //枫叶3年旗
Array(1412028, 500, 1, 1), //枫叶3年旗
Array(1302066, 500, 1, 1), //枫叶3年旗
Array(1332057, 500, 1, 1), //枫叶3年旗
Array(1422032, 500, 1, 1), //枫叶3年旗
Array(1432041, 500, 1, 1), //枫叶3年旗
Array(1442052, 500, 1, 1), //枫叶3年旗
Array(1462041, 500, 1, 1), //枫叶3年旗
Array(1472056, 500, 1, 1), //枫叶3年旗
//Array(1492034, 500, 1, 1), //枫叶3年旗（海盗）
Array(1312034, 1, 1, 1), //粉色花边游泳圈
Array(1422033, 1, 1, 1), //粉色花边游泳圈
Array(1432042, 1, 1, 1), //粉色花边游泳圈
Array(1332059, 1, 1, 1), //粉色花边游泳圈
Array(1492026, 1, 1, 1), //粉色花边游泳圈
Array(1452048, 1, 1, 1), //粉色花边游泳圈
Array(1302230, 1, 1, 1), //粉色花边游泳圈
Array(1302075, 100, 1, 1), //新加坡国旗（单手剑）
Array(1302076, 100, 1, 1), //马来西亚国旗（单手剑）
Array(1312035, 100, 1, 1), //新加坡国旗（单手斧）
Array(1312036, 100, 1, 1), //马来西亚国旗（单手斧）
Array(1322057, 100, 1, 1), //新加坡国旗（单手杖）
Array(1322058, 100, 1, 1), //马来西亚国旗（单手杖）
Array(1332060, 100, 1, 1), //新加坡国旗（短剑）
Array(1332061, 100, 1, 1), //马来西亚国旗（短剑）
Array(1382043, 100, 1, 1), //新加坡国旗（长杖）
Array(1382044, 100, 1, 1), //马来西亚国旗（长杖）
Array(1402042, 100, 1, 1), //新加坡国旗（双手剑）
Array(1412030, 100, 1, 1), //新加坡国旗（双手斧）
Array(1412031, 100, 1, 1), //马来西亚国旗（双手斧）
Array(1422034, 100, 1, 1), //新加坡国旗（双手杖）
Array(1432043, 100, 1, 1), //新加坡国旗（枪）
Array(1432044, 100, 1, 1), //马来西亚国旗（枪）
Array(1442058, 100, 1, 1), //新加坡国旗（矛）
Array(1452049, 100, 1, 1), //新加坡国旗（弓）
Array(1452050, 100, 1, 1), //马来西亚国旗（弓）
Array(1302030,250,1,1), //枫叶剑
			Array(1302035,250,1,1), //1302035 枫叶旗
			Array(1422029,250,1,1), //1332025 枫叶刃
			Array(1332025,250,1,1), //1382012 枫叶杖
			Array(1412011,250,1,1),//1412011 枫叶斧
			Array(1422014,250,1,1),//1422014 枫叶锤
			Array(1432012,250,1,1),//1432012 枫叶枪
			Array(1442024,250,1,1),//1442024 枫叶矛
			Array(1452022,250,1,1),//1452022 枫叶弓
			Array(1462019,250,1,1),//1462019 枫叶弩
			Array(1472032,250,1,1),//1472032 枫叶拳
			Array(1472030,250,1,1),//1472030 小枫叶拳
			Array(1482020,250,1,1),//1482020 枫叶指节
			Array(1492020,250,1,1),//1492020 枫叶枪
Array(1442026, 1, 1, 1), //红色冲浪板
Array(1442027, 1, 1, 1), //绿色冲浪板
Array(1442028, 1, 1, 1), //蓝色冲浪板
Array(1442029, 800, 1, 1), //紫色冲浪板
Array(1442065, 800, 1, 1), //蓝色冲浪板
Array(1442066, 1, 1, 1), //红色冲浪板
Array(1442069, 1, 1, 1), //红色冲浪板
Array(1442070, 1, 1, 1), //绿色冲浪板
Array(1442054, 800, 1, 1), //红色滑水板
Array(1442055, 1, 1, 1), //绿色滑水板
Array(1442056, 1, 1, 1), //蓝色滑水板
Array(1442057, 1, 1, 1), //紫色滑水板
Array(1432017, 1, 1, 1), //绿色滑雪板	
Array(1432018, 1, 1, 1), //蓝色滑雪板	
Array(1432015, 800, 1, 1), //红色滑雪板	
Array(1432016, 100, 1, 1), //橙色滑雪板
Array(1442011, 800, 1, 1), //冲浪板
Array(1442030, 1, 1, 1), //枫之雪板
Array(1442046, 1, 1, 1), //超级滑雪板
Array(1442039, 20, 1, 1), //冻冻鱼
//------手套------
Array(1082145, 800, 1, 1), //工地手套(黄)
Array(1082146, 800, 1, 1), //工地手套(红)
Array(1082147, 800, 1, 1), //工地手套(蓝)
Array(1082148, 800, 1, 1), //工地手套(紫)
Array(1082149, 50, 1, 1), //工地手套(褐)
Array(1082150, 800, 1, 1), //工地手套(灰)
Array(1082002, 800, 1, 1), //工地手套(白)
Array(1082175, 800, 1, 1), //马绍尔手套(赤)
Array(1082176, 800, 1, 1), //马绍尔手套(青)
Array(1082177, 800, 1, 1), //马绍尔手套(紫
Array(1082178, 800, 1, 1), //马绍尔手套(桃)
Array(1082179, 100, 1, 1), //马绍尔手套(黄)
//-----耳环-----
Array(1032032, 100, 1, 0), //秋叶耳环
Array(1032035, 400, 1, 0), //枫叶耳环
Array(1032040, 100, 1, 0), //枫叶型耳环
Array(1032041, 100, 1, 0), //枫叶型耳环
Array(1032042, 100, 1, 0), //枫叶型耳环
Array(1032030, 100, 1, 0), //勇气耳环
//-----椅子-----
Array(3010013, 800, 1, 1), //悠长假期
Array(3010014, 800, 1, 1), //月亮弯
Array(3010018, 800, 1, 1), //椰子树沙滩椅
Array(3010019, 800, 1, 1), //寿司椅
Array(3010021, 800, 1, 1), //暖暖桌
Array(3010025, 800, 1, 1), //枫叶纪念凳
Array(3010028, 800, 1, 1), //海盗的俘虏
Array(3010029, 800, 1, 1), //蓝环凳
Array(3010030, 800, 1, 1), //黑环凳
Array(3010031, 800, 1, 1), //红环凳
Array(3010032, 800, 1, 1), //黄环凳
Array(3010033, 800, 1, 1), //绿环凳
Array(3010037, 800, 1, 1), //猪猪凳
Array(3010044, 200, 1, 1), //同一红伞下
Array(3012001, 800, 1, 1), //篝火
Array(3012002, 800, 1, 1), //浴桶
Array(3010073, 100, 1, 1), //BB克缤
Array(3012003, 800, 1, 1), //爱心椅子
Array(3010012, 800, 1, 1), //剑士 宝座
Array(3010025, 800, 1, 1), //枫叶纪念凳
Array(3010037, 800, 1, 1), //猪猪凳
Array(3010038, 800, 1, 1), //爱心椅子
Array(3010040, 800, 1, 1), //蝙蝠椅
Array(3010041, 800, 1, 1), //骷髅王座
Array(3010043, 800, 1, 1), //魔女的飞扫把
//Array(3010044, 800, 1, 1), //同一红伞下
Array(3010045, 800, 1, 1), //寒冰椅子
Array(3010046, 800, 1, 1), //红龙椅
Array(3010047, 800, 1, 1), //蓝龙椅
Array(3010048, 800, 1, 1), //圣诞树椅子
Array(3010049, 800, 1, 1), //雪房子
Array(3010050, 800, 1, 1), //公主凳
Array(3010057, 800, 1, 1), //血色玫瑰
Array(3010058, 800, 1, 1), //世界末日
Array(3010068, 800, 1, 1), //露水椅子
//Array(3010070, 10, 1, 1), //巨无霸品克缤
Array(3015051, 5, 1, 1), //啦啦啦大水车
Array(3015304, 1, 1, 1), //巨无霸国际巨星飞机
Array(3010071, 800, 1, 1), //神兽椅
Array(3010077, 800, 1, 1), //猫头鹰椅子
Array(3010085, 800, 1, 1), //鬼娃娃椅子
Array(3010096, 800, 1, 1), //恐龙化石宝座
Array(3010095, 800, 1, 1), //石头人座椅
Array(3010094, 800, 1, 1), //漂漂猪椅子
Array(3010098, 800, 1, 1), //电视宅人
Array(3010106, 800, 1, 1), //雪狼战椅
Array(3010112, 800, 1, 1), //情书柜子
Array(3015120, 300, 1, 1), //枕头大战
/*

//-----椅子-----
Array(3010013, 800, 1, 1), //悠长假期
Array(3010014, 800, 1, 1), //月亮弯
Array(3010018, 800, 1, 1), //椰子树沙滩椅
Array(3010019, 800, 1, 1), //寿司椅
Array(3010021, 800, 1, 1), //暖暖桌
Array(3010025, 800, 1, 1), //枫叶纪念凳
Array(3010028, 800, 1, 1), //海盗的俘虏
Array(3010044, 800,1,1), //红伞椅子
Array(3010036, 800,1,1), //秋千
Array(3010049, 800,1,1), //学房子
Array(3010110, 800,1,1), //熊
Array(3010131, 800,1,1), //熊猫
Array(3012001, 800,1,1), //篝火 
Array(3012002, 800,1,1), //浴桶
Array(3012003, 800,1,1), //爱心
Array(3010013, 800,1,1), //遮阳椅
Array(3010018, 800,1,1), //椰子树
Array(3010021, 800,1,1), //暖暖桌
Array(3010024, 800,1,1), //玩具熊
Array(3010025, 800,1,1), //5周年枫叶纪念
Array(3010026, 800,1,1), //恶灵附身
Array(3010034, 800,1,1), //假期红
Array(3010035, 800,1,1), //假期蓝
Array(3010043, 800,1,1), //魔女扫把
Array(3010051, 800,1,1), //沙漠兔兔1
Array(3010052, 800,1,1), //沙漠兔兔2
Array(3010054, 800,1,1), //呼噜床
Array(3010057, 800,1,1), //血色玫瑰
Array(3010058, 800,1,1), //世界末日
Array(3010063, 800,1,1), //月亮星星
Array(3010068, 800,1,1), //露水椅子
Array(3010069, 800,1,1), //大黄蜂
Array(3010071, 800,1,1), //神兽椅子
Array(3010075, 800,1,1), //音乐狂
Array(3010075, 800,1,1), //大熊猫
Array(3010079, 800,1,1), //肥猫
Array(3010085, 800,1,1), //鬼娃娃椅子
Array(3010096, 800,1,1), //恐龙化石
Array(3010099, 800,1,1), //北极熊椅子
Array(3010109, 800,1,1), //暖炉椅子
Array(3010110, 800,1,1), //白熊
Array(3010129, 800,1,1), //酋长宝座
Array(3010139, 800,1,1), //私密空间
Array(3010140, 800,1,1), //早日康复
Array(3010147, 800,1,1), //龙蛋椅子
Array(3010149, 800,1,1), //风扇
Array(3010151, 800,1,1), //无人岛
Array(3010151, 800,1,1), //三角张峰
Array(3010169, 800,1,1), //求领养
Array(3010172, 800,1,1), //星空椅子
Array(3010175, 800,1,1), //名画家椅子
Array(3010193, 800,1,1), //炼金瓶
Array(3010195, 800,1,1), //无价之宝
Array(3010195, 800,1,1), //泡泡浴缸
Array(3010289, 800,1,1), //老奶奶读通话
Array(3010293, 800,1,1), //恶灵椅子
Array(3010403, 800,1,1), //音乐会
Array(3010410, 800,1,1), //珍妮
Array(3010411, 800,1,1), //双鱼
Array(3010412, 800,1,1), //双塔
Array(3010428, 800,1,1), //水晶
Array(3010437, 800,1,1), //魔法书
Array(3010438, 800,1,1), //音符
Array(3010453, 800,1,1), //兔子
Array(3010454, 800,1,1), //爱心云朵
Array(3010462, 400,1,1), //天文台
Array(3010494, 800,1,1), //TV椅子
Array(3010505, 800,1,1), //看球赛
Array(3010515, 300,1,1), //奇石椅子
Array(3010609, 300,1,1), //不是在做梦
Array(3010622, 300,1,1), //丹真
Array(3010632, 300,1,1), //印第安
Array(3010633, 300,1,1), //印第安
Array(3010659, 300,1,1), //巴士
Array(3010716, 300,1,1), //超级蘑菇
Array(3010729, 300,1,1), //孤独男子
Array(3010730, 300,1,1), //小企鹅合唱团
Array(3010733, 800,1,1), //电视椅子
Array(3010738, 300,1,1), //闪电三人组
Array(3010739, 300,1,1), //雪人香波
Array(3010767, 300,1,1), //雪人椅子
Array(3010760, 300,1,1), //古代浴池
Array(3010879, 300,1,1), //繁星
Array(3010937, 300,1,1), //异界
Array(3010938, 300,1,1), //异界
Array(3010939, 300,1,1), //异界
Array(3010946, 300,1,1), //森林伙伴
Array(3012007, 300,1,1), //石狮
Array(3012008, 300,1,1), //稻荷神社
Array(3012011, 300,1,1), //火锅
Array(3012022, 300,1,1), //寿司
Array(3015053, 300,1,1), //三重杨
Array(3015264, 300,1,1), //美味厨房
Array(3015158, 300,1,1), //印第安
Array(3015158, 300,1,1), //印第安
Array(3015158, 300,1,1), //印第安

Array(3010899, 600, 1, 1), //摆钟椅子
Array(3010898, 600, 1, 1), //迷你神兽椅子
Array(3010895, 600, 1, 1), //阿卡伊勒童话书椅子
Array(3010896, 600, 1, 1), //我的女皇椅子
Array(3010492, 600, 1, 1), //首脑椅子
Array(3010491, 600, 1, 1), //蓝色毛驴总统椅子
Array(3010494, 600, 1, 1), //TV椅子
Array(3010490, 600, 1, 1), //红色大象总统椅子
Array(3010465, 600, 1, 1), //可爱音符椅子
Array(3010460, 600, 1, 1), //爆竹椅子
Array(3010848, 600, 1, 1), //红地毯主人公椅子
Array(3010849, 600, 1, 1), //最佳新人椅子
Array(3010850, 600, 1, 1), //潮流评论家椅子
Array(3010853, 600, 1, 1), //心花怒放椅子
Array(3010851, 600, 1, 1), //夏日沁饮椅子
Array(3010450, 600, 1, 1), //艾莉珍椅子
Array(3010455, 600, 1, 1), //扎昆的帝王椅子
Array(3010456, 600, 1, 1), //杜鹃花椅子
Array(3010458, 600, 1, 1), //翻滚兔子椅子
Array(3010863, 600, 1, 1), //愤怒的美发师椅子
Array(3010862, 600, 1, 1), //兔子?胡萝卜椅子
Array(3010447, 600, 1, 1), //睡觉小鸟椅子
Array(3010446, 600, 1, 1), //皮肤皇后椅子
Array(3010449, 600, 1, 1), //痊愈10周椅子
Array(3010448, 600, 1, 1), //泡泡浴椅子
Array(3010441, 600, 1, 1), //邪恶之毒椅子
Array(3010440, 600, 1, 1), //寻找故乡的月妙椅子
Array(3010443, 600, 1, 1), //邪恶羊椅子
Array(3010436, 600, 1, 1), //邪恶黑龙椅子
Array(3010435, 600, 1, 1), //千年狐椅子
Array(3010434, 600, 1, 1), //热带夏日椅子
Array(3010439, 600, 1, 1), //羊羔椅子
Array(3010431, 600, 1, 1), //夏日喵喵椅子
Array(3010430, 600, 1, 1), //蓝色龙椅子
Array(3010429, 600, 1, 1), //红色龙椅子
Array(3010428, 600, 1, 1), //水晶椅子
Array(3010423, 600, 1, 1), //蘑菇朋友椅子
Array(3010099, 600, 1, 1), //北极熊椅子
Array(3010408, 600, 1, 1), //龙的传人椅子
Array(3010409, 600, 1, 1), //粽子椅子
Array(3010094, 600, 1, 1), //漂漂猪椅子
Array(3010414, 600, 1, 1), //荆棘椅子
Array(3010411, 600, 1, 1), //鱼尾狮椅子
Array(3010085, 600, 1, 1), //鬼娃娃椅子
Array(3010078, 600, 1, 1), //大熊猫椅子
Array(3010077, 600, 1, 1), //猫头鹰椅子
Array(3010079, 600, 1, 1), //肥猫猫椅子
Array(3010053, 600, 1, 1), //兔子纪念版椅子
Array(3010151, 600, 1, 1), //无人岛椅子
Array(3010168, 600, 1, 1), //友谊万岁椅子
Array(3010162, 600, 1, 1), //果月椅子
Array(3010137, 600, 1, 1), //神龙椅子
Array(3015419, 600, 1, 1), //外滩爆竹椅子
Array(3015415, 600, 1, 1), //猴子椅子
Array(3010135, 600, 1, 1), //节日独角兽椅子
Array(3010141, 600, 1, 1), //蛋糕椅子
Array(3010142, 600, 1, 1), //水族馆椅子
Array(3010144, 600, 1, 1), //七夕椅子
Array(3010145, 600, 1, 1), //周年庆水晶枫叶椅子
Array(3010113, 600, 1, 1), //幽魂发条熊椅子
Array(3015430, 600, 1, 1), //年兽椅子
Array(3010110, 600, 1, 1), //舒适大白熊椅子
Array(3010119, 600, 1, 1), //羊羊椅子
Array(3010117, 600, 1, 1), //魔法书椅子
Array(3010116, 600, 1, 1), //摇滚之魂椅子
Array(3010114, 600, 1, 1), //俘虏我吧！椅子
Array(3010124, 600, 1, 1), //都纳斯喷气椅子
Array(3015426, 600, 1, 1), //和猴子一起面具舞椅子
Array(3015424, 600, 1, 1), //超级饺子椅子
Array(3015428, 600, 1, 1), //和猴子一起放烟花椅子
Array(3015427, 600, 1, 1), //和猴子一起玩麻将椅子
Array(3010100, 600, 1, 1), //财神椅子
Array(3010845, 600, 1, 1), //小金猪椅子
Array(3010836, 600, 1, 1), //度假地奥拉夫椅子
Array(3010814, 600, 1, 1), //粉丝抱枕椅子
Array(3010804, 600, 1, 1), //军人月妙拜年椅子
Array(3010803, 600, 1, 1), //高3月妙拜年椅子
Array(3010802, 600, 1, 1), //中学生月妙拜年椅子
Array(3010801, 600, 1, 1), //学龄前月妙拜年椅子
Array(3010800, 600, 1, 1), //小学生月妙拜年椅子
Array(3015045, 600, 1, 1), //羊绒咩咩椅子
Array(3015043, 600, 1, 1), //宝石枫叶椅子
Array(3010375, 600, 1, 1), //奥妙的超级药水椅子
Array(3015057, 600, 1, 1), //烟花绽放椅子
Array(3010374, 600, 1, 1), //闪耀星星之夜椅子
Array(3010377, 600, 1, 1), //新鲜的蓝色药水椅子
Array(3015059, 600, 1, 1), //浪漫甜心巧克力椅子
Array(3010376, 600, 1, 1), //热情的红色药水椅子
Array(3010373, 600, 1, 1), //云朵洗手间椅子
Array(3010794, 600, 1, 1), //抖动的舌头椅子
Array(3010795, 600, 1, 1), //森林中休息处(椅子)
Array(3010798, 600, 1, 1), //焰火椅子
Array(3010799, 600, 1, 1), //坟墓幽灵椅子
Array(3010797, 600, 1, 1), //新春快乐椅子
Array(3015009, 600, 1, 1), //小苹果椅子
Array(3010737, 600, 1, 1), //动物英雄团椅子
Array(3010734, 600, 1, 1), //猫箱椅子
Array(3010738, 600, 1, 1), //闪电三人组椅子
Array(3010739, 600, 1, 1), //雪人香波椅子
Array(3010741, 600, 1, 1), //福袋椅子
Array(3010361, 600, 1, 1), //购物小推车椅子
Array(3010360, 600, 1, 1), //光之骑士椅子
Array(3010740, 600, 1, 1), //圣诞树椅子
Array(3010365, 600, 1, 1), //休彼德蔓的古代石掌椅子
Array(3010755, 600, 1, 1), //小丫丫坐便器椅子
Array(3010753, 600, 1, 1), //暖暖的被炉椅子
Array(3010758, 600, 1, 1), //林之灵椅子2
Array(3010756, 600, 1, 1), //新年招财猫椅子
Array(3010767, 600, 1, 1), //雪人椅子
Array(3010760, 600, 1, 1), //古代浴池椅子
Array(3010300, 600, 1, 1), //橙色HP药水椅子
Array(3010306, 600, 1, 1), //生如夏花椅子
Array(3010301, 600, 1, 1), //高级HP药水椅子
Array(3010320, 600, 1, 1), //老奶奶读童话椅
Array(3010322, 600, 1, 1), //情人节爱情椅子
Array(3010321, 600, 1, 1), //阿卡伊勒读童话椅子
Array(3010311, 600, 1, 1), //黑龙椅子
Array(3010313, 600, 1, 1), //粉色扎昆椅子
Array(3010189, 600, 1, 1), //克里塞椅子
Array(3010188, 600, 1, 1), //班·雷昂椅子
Array(3010186, 600, 1, 1), //兔子椅子
Array(3010184, 600, 1, 1), //冰钓椅子
Array(3010181, 600, 1, 1), //MP椅子
Array(3010180, 600, 1, 1), //HP椅子
Array(3010173, 600, 1, 1), //万圣节塔罗椅子
Array(3010172, 600, 1, 1), //星空椅子
Array(3010175, 600, 1, 1), //名画家椅子
Array(3010170, 600, 1, 1), //雪夜椅子
Array(3010195, 600, 1, 1), //无价之宝椅子
Array(3010194, 600, 1, 1), //野营篝火椅子
Array(3010197, 600, 1, 1), //英雄的椅子-战神
Array(3010191, 600, 1, 1), //爱情椅子
Array(3010288, 600, 1, 1), //珍珠蚌椅子
Array(3010218, 600, 1, 1), //乔克恶灵椅子
Array(3010219, 600, 1, 1), //绵羊酋长椅子
Array(3010212, 600, 1, 1), //藏獒椅子
Array(3010210, 600, 1, 1), //草莓冰淇淋月饼椅子
Array(3010224, 600, 1, 1), //年糕冰淇淋椅子
*/
//-----卷轴-----
Array(2040001, 850, 1, 1), //头盔防御卷轴60%
Array(2040002, 850, 1, 1), //头盔防御卷轴10%
Array(2040004, 850, 1, 1), //头盔体力卷轴60%
Array(2040005, 850, 1, 1), //头盔体力卷轴10%
Array(2040016, 850, 1, 1), //头盔命中率卷轴10%
Array(2040017, 850, 1, 1), //头盔命中率卷轴60%
Array(2040025, 800, 1, 1), //头盔智力卷轴60%
Array(2040026, 800, 1, 1), //头盔智力卷轴10%
Array(2040029, 800, 1, 1), //头盔敏捷卷轴60%
Array(2040031, 800, 1, 1), //头盔敏捷卷轴10%
Array(2040919,400,1,1),//盾牌moli卷轴  2040919
			Array(2040920,400,1,1),//盾牌moli卷轴  2040919
Array(2040100, 850, 1, 1), //脸部装饰生命卷轴10%
//Array(2040101, 850, 1, 1), //脸部装饰生命卷轴60%
Array(2040105, 850, 1, 1), //脸部装饰回避率卷轴10%
Array(2040106, 850, 1, 1), //脸部装饰回避率卷轴60%
Array(2040200, 850, 1, 1), //眼部装饰命中率卷轴10%
Array(2040201, 850, 1, 1), //眼部装饰命中率卷轴60%
Array(2040205, 800, 1, 1), //眼部装饰智力卷轴10%
Array(2040206, 800, 1, 1), //眼部装饰智力卷轴60%
Array(2040301, 800, 1, 1), //耳环智力卷轴60%
Array(2040302, 800, 1, 1), //耳环智力卷轴10%
Array(2040310, 850, 1, 1), //耳环防御力卷轴10%
Array(2040317, 850, 1, 1), //耳环敏捷卷轴60%
Array(2040318, 850, 1, 1), //耳环敏捷卷轴10%
Array(2040321, 850, 1, 1), //耳环装饰运气卷轴60%
Array(2040323, 850, 1, 1), //耳环运气卷轴10%
Array(2040326, 850, 1, 1), //耳环装饰体力卷轴60%
Array(2040328, 850, 1, 1), //耳环装饰体力卷轴10%
Array(2040401, 850, 1, 1), //上衣防御卷轴60%
Array(2040402, 850, 1, 1), //上衣防御卷轴10%
Array(2040412, 850, 1, 1), //上衣运气卷轴10%
Array(2040413, 850, 1, 1), //上衣运气卷轴60%
Array(2040418, 850, 1, 1), //上衣力量卷轴60%
Array(2040419, 850, 1, 1), //上衣力量卷轴10%
Array(2040421, 850, 1, 1), //上衣体力卷轴60%
Array(2040422, 850, 1, 1), //上衣体力卷轴10%
Array(2040425, 850, 1, 1), //上衣运气卷轴60%
Array(2040427, 850, 1, 1), //上衣运气卷轴10%
Array(2040501, 100, 1, 1), //全身铠甲敏捷卷轴60%
Array(2040502, 100, 1, 1), //全身铠甲敏捷卷轴10%
Array(2040504, 850, 1, 1), //全身铠甲防御卷轴60%
Array(2040505, 850, 1, 1), //全身铠甲防御卷轴10%
Array(2040513, 850, 1, 1), //全身铠甲智力卷轴60%
Array(2040514, 850, 1, 1), //全身铠甲智力卷轴10%
Array(2040516, 850, 1, 1), //全身铠甲运气卷轴60%
Array(2040517, 850, 1, 1), //全身铠甲运气卷轴10%
Array(2040532, 850, 1, 1), //全身盔甲力量卷轴60%
Array(2040534, 850, 1, 1), //全身盔甲力量卷轴10%
Array(2040601, 850, 1, 1), //裤/裙防御卷轴60%
Array(2040602, 850, 1, 1), //裤/裙防御卷轴10%
Array(2040612, 850, 1, 1), //裤裙敏捷卷轴10%
Array(2040613, 850, 1, 1), //裤裙敏捷卷轴60%
Array(2040618, 850, 1, 1), //裤裙跳跃卷轴60%
Array(2040619, 850, 1, 1), //裤裙跳跃卷轴10%
Array(2040621, 850, 1, 1), //裤裙体力卷轴60%
Array(2040622, 850, 1, 1), //裤裙体力卷轴10%
Array(2040625, 850, 1, 1), //裤裙敏捷卷轴60%
Array(2040627, 850, 1, 1), //裤裙敏捷卷轴10%
Array(2040701, 850, 1, 1), //鞋子敏捷度卷轴60%
Array(2040702, 850, 1, 1), //鞋子敏捷度卷轴10%
Array(2040704, 850, 1, 1), //鞋子跳跃卷轴60%
Array(2040705, 850, 1, 1), //鞋子跳跃卷轴10%
Array(2040707, 850, 1, 1), //鞋子速度卷轴60%
Array(2040708, 850, 1, 1), //鞋子速度卷轴10%
//Array(2040727, 850, 1, 1), //鞋子防滑卷轴10%
Array(2040801, 850, 1, 1), //手套敏捷卷轴60%
Array(2040802, 850, 1, 1), //手套敏捷卷轴10%
Array(2040804, 10, 1, 1), //手套攻击卷轴60%
Array(2040805, 10, 1, 1), //手套攻击卷轴10%
Array(2040816, 850, 1, 1), //手套魔力卷轴10%
Array(2040817, 850, 1, 1), //手套魔力卷轴60%
Array(2040824, 850, 1, 1), //手套体力卷轴60%
Array(2040825, 850, 1, 1), //手套体力卷轴10%
Array(2040901, 850, 1, 1), //盾牌防御卷轴60%
Array(2040902, 850, 1, 1), //盾牌防御卷轴10%
Array(2040914, 30, 1, 1), //盾牌攻击卷轴60%
Array(2040915, 30, 1, 1), //盾牌攻击卷轴10%
Array(2040919, 300, 1, 1), //盾牌魔力卷轴60%
Array(2040920, 300, 1, 1), //盾牌魔力卷轴10%
Array(2040924, 300, 1, 1), //盾牌运气卷轴60%
Array(2040925, 300, 1, 1), //盾牌运气卷轴10%
Array(2040927, 850, 1, 1), //盾牌体力卷轴60%
Array(2040928, 850, 1, 1), //盾牌体力卷轴10%
Array(2040931, 300, 1, 1), //盾牌力量卷轴60%
Array(2040933, 300, 1, 1), //盾牌力量卷轴10%
Array(2041001, 850, 1, 1), //披风魔防卷轴60%
Array(2041002, 850, 1, 1), //披风魔防卷轴10%
Array(2041004, 850, 1, 1), //披风防御卷轴60%
Array(2041005, 850, 1, 1), //披风防御卷轴10%
Array(2041007, 850, 1, 1), //披风体力卷轴60%
Array(2041008, 850, 1, 1), //披风体力卷轴10%
Array(2041010, 850, 1, 1), //披风魔力卷轴60%
Array(2041011, 850, 1, 1), //披风魔力卷轴10%
Array(2041013, 850, 1, 1), //披风力量卷轴60%
Array(2041014, 850, 1, 1), //披风力量卷轴10%
Array(2041016, 850, 1, 1), //披风智力卷轴60%
Array(2041017, 850, 1, 1), //披风智力卷轴10%
Array(2041019, 850, 1, 1), //披风敏捷卷轴60%
Array(2041020, 850, 1, 1), //披风敏捷卷轴10%
Array(2041022, 850, 1, 1), //披风运气卷轴60%
Array(2041023, 850, 1, 1), //披风运气卷轴10%
//Array(2041058, 10, 1, 1), //披风防寒卷轴10%
Array(2041201, 100, 1, 1), //项链运气卷轴10%
Array(2041202, 100, 1, 1), //项链运气卷轴60%
Array(2041206, 100, 1, 1), //项链力量卷轴10%
Array(2041207, 100, 1, 1), //项链力量卷轴60%
Array(2041301, 100, 1, 1), //腰带力量卷轴60%
Array(2041304, 100, 1, 1), //腰带智力卷轴60%
Array(2041307, 100, 1, 1), //腰带敏捷卷轴60%
Array(2041310, 100, 1, 1), //腰带运气卷轴60%
Array(2043001, 850, 1, 1), //单手剑攻击卷轴60%
Array(2043002, 850, 1, 1), //单手剑攻击卷轴10%
Array(2043008, 850, 1, 1), //单手剑魔力卷轴10%
Array(2043009, 850, 1, 1), //单手剑魔力卷轴60%
Array(2043017, 850, 1, 1), //单手剑命中率卷轴60%
Array(2043019, 850, 1, 1), //单手剑命中率卷轴10%
Array(2043101, 850, 1, 1), //单手斧攻击卷轴60%
Array(2043102, 850, 1, 1), //单手斧攻击卷轴10%
Array(2043112, 850, 1, 1), //单手斧命中率卷轴60%
Array(2043114, 850, 1, 1), //单手斧命中率卷轴10%
Array(2043201, 850, 1, 1), //单手钝器攻击卷轴60%
Array(2043202, 850, 1, 1), //单手钝器攻击卷轴10%
Array(2043212, 850, 1, 1), //单手钝器命中率卷轴60%
Array(2043214, 850, 1, 1), //单手钝器命中率卷轴10%
Array(2043301, 850, 1, 1), //短剑攻击卷轴60%
Array(2043302, 850, 1, 1), //短剑攻击卷轴10%
Array(2043701, 850, 1, 1), //短杖魔力卷轴60%
Array(2043702, 850, 1, 1), //短杖魔力卷轴10%
Array(2043801, 850, 1, 1), //长杖魔力卷轴60%
Array(2043802, 850, 1, 1), //长杖魔力卷轴10%
Array(2044001, 850, 1, 1), //双手剑攻击卷轴60%
Array(2044002, 850, 1, 1), //双手剑攻击卷轴10%
Array(2044012, 850, 1, 1), //双手剑命中率卷轴60%
Array(2044014, 850, 1, 1), //双手剑命中率卷轴10%
Array(2044101, 850, 1, 1), //双手斧攻击卷轴60%
Array(2044102, 850, 1, 1), //双手斧攻击卷轴10%
Array(2044112, 850, 1, 1), //双手斧命中率卷轴60%
Array(2044114, 850, 1, 1), //双手斧命中率卷轴10%
Array(2044201, 850, 1, 1), //双手钝器攻击卷轴60%
Array(2044202, 850, 1, 1), //双手钝器攻击卷轴10%
Array(2044212, 850, 1, 1), //双手钝器命中率卷轴60%
Array(2044214, 850, 1, 1), //双手钝器命中率卷轴10%
Array(2044301, 850, 1, 1), //枪攻击卷轴60%
Array(2044302, 850, 1, 1), //枪攻击卷轴10%
Array(2044312, 850, 1, 1), //枪命中率卷轴60%
Array(2044314, 850, 1, 1), //枪命中率卷轴10%
Array(2044401, 850, 1, 1), //矛攻击卷轴60%
Array(2044402, 850, 1, 1), //矛攻击卷轴10%
Array(2044412, 850, 1, 1), //矛命中率卷轴60%
Array(2044414, 850, 1, 1), //矛命中率卷轴10%
Array(2044501, 850, 1, 1), //弓攻击卷轴60%
Array(2044502, 850, 1, 1), //弓攻击卷轴10%
Array(2044601, 850, 1, 1), //弩攻击卷轴60%
Array(2044602, 850, 1, 1), //弩攻击卷轴10%
Array(2044701, 850, 1, 1), //拳套攻击卷轴60%
Array(2044702, 850, 1, 1), //拳套攻击卷轴10%
Array(2044801, 850, 1, 1), //拳甲攻击卷轴60%
Array(2044802, 850, 1, 1), //拳甲攻击卷轴10%
Array(2044807, 850, 1, 1), //拳甲命中率卷轴60%
Array(2044809, 850, 1, 1), //拳甲命中率卷轴10%
Array(2044901, 850, 1, 1), //短枪攻击卷轴60%
Array(2044902, 850, 1, 1), //短枪攻击卷轴10%
//诅咒卷
Array(2044004, 850, 1, 1), //双手剑攻击诅咒卷轴
Array(2044005, 850, 1, 1), //双手剑攻击诅咒卷轴
Array(2044105, 850, 1, 1), //双手斧攻击诅咒卷轴
Array(2044104, 850, 1, 1), //双手斧攻击诅咒卷轴
Array(2044305, 850, 1, 1), //枪攻击诅咒卷轴
Array(2044304, 850, 1, 1), //枪攻击诅咒卷轴
Array(2043004, 850, 1, 1), //单手剑攻击诅咒卷轴
Array(2043005, 850, 1, 1), //单手剑攻击诅咒卷轴
Array(2043006, 850, 1, 1), //单手剑魔力诅咒卷轴70%
Array(2043007, 850, 1, 1), //单手剑魔力诅咒卷轴30%
Array(2040921, 300, 1, 1), //盾牌魔力诅咒卷轴70%。
Array(2040922, 300, 1, 1), //盾牌魔力诅咒卷轴30%
Array(2040917, 300, 1, 1), //盾牌攻击诅咒卷轴30%
Array(2040916, 300, 1, 1), //盾牌攻击诅咒卷轴70%
Array(2040904, 850, 1, 1), //盾牌防御诅咒卷轴
Array(2040905, 850, 1, 1), //盾牌防御诅咒卷轴
Array(2040814, 850, 1, 1), //手套魔力诅咒卷轴
Array(2040815, 850, 1, 1), //手套魔力诅咒卷轴
Array(2040811, 850, 1, 1), //手套攻击诅咒卷轴
Array(2040810, 850, 1, 1), //手套攻击诅咒卷轴
Array(2040808, 850, 1, 1), //手套敏捷诅咒卷轴
//Array(2040807, 850, 1, 1), //手套攻击诅咒卷轴
Array(2040508, 500, 1, 1), //全身铠甲敏捷诅咒卷轴
Array(2040509, 500, 1, 1), //全身铠甲敏捷诅咒卷轴
Array(2040511, 850, 1, 1), //全身铠甲防御诅咒卷轴
Array(2040510, 850, 1, 1), //全身铠甲防御诅咒卷轴
Array(2040411, 850, 1, 1), //上衣运气诅咒卷轴30%
Array(2040410, 850, 1, 1), //上衣运气诅咒卷轴70%
Array(2040405, 850, 1, 1), //上衣防御诅咒卷轴
Array(2040404, 850, 1, 1), //上衣防御诅咒卷轴
Array(2043304, 850, 1, 1), //短剑攻击诅咒卷轴
Array(2043305, 850, 1, 1), //短剑攻击诅咒卷轴
Array(2040712, 850, 1, 1), //鞋子敏捷诅咒卷轴
Array(2040713, 850, 1, 1), //鞋子敏捷诅咒卷轴
Array(2040715, 850, 1, 1), //鞋子跳跃诅咒卷轴
Array(2040714, 850, 1, 1), //鞋子跳跃诅咒卷轴
Array(2040717, 850, 1, 1), //鞋子速度诅咒卷轴
Array(2040716, 850, 1, 1), //鞋子速度诅咒卷轴
Array(2043205, 850, 1, 1), //单手钝器攻击诅咒卷轴
Array(2043204, 850, 1, 1), //单手钝器攻击诅咒卷轴
Array(2040611, 850, 1, 1), //裤裙敏捷诅咒卷轴30%
Array(2040610, 850, 1, 1), //裤裙敏捷诅咒卷轴70%
Array(2040609, 850, 1, 1), //裤裙体力诅咒卷轴
Array(2040608, 850, 1, 1), //裤裙体力诅咒卷轴
Array(2040607, 850, 1, 1), //裤裙跳跃诅咒卷轴
Array(2040606, 850, 1, 1), //裤裙跳跃诅咒卷轴
Array(2040605, 850, 1, 1), //裤/裙防御诅咒卷轴
Array(2040604, 850, 1, 1), //裤/裙防御诅咒卷轴
Array(2043105, 850, 1, 1), //单手斧攻击诅咒卷轴
Array(2043104, 850, 1, 1), //单手斧攻击诅咒卷轴
Array(2043805, 850, 1, 1), //长杖魔力诅咒卷轴
Array(2043804, 850, 1, 1), //长杖魔力诅咒卷轴
Array(2044504, 850, 1, 1), //弓攻击诅咒卷轴
Array(2044505, 850, 1, 1), //弓攻击诅咒卷轴
Array(2040109, 850, 1, 1), //脸部装饰回避诅咒卷轴70%
Array(2040104, 850, 1, 1), //脸部装饰生命诅咒卷轴70%
Array(2040103, 850, 1, 1), //脸部装饰生命诅咒卷轴30%
Array(2040108, 850, 1, 1), //脸部装饰回避诅咒卷轴30%
Array(2044405, 850, 1, 1), //矛攻击诅咒卷轴
Array(2044404, 850, 1, 1), //矛攻击诅咒卷轴
Array(2040014, 850, 1, 1), //头盔命中诅咒卷轴70%
Array(2040015, 850, 1, 1), //头盔命中诅咒卷轴30%
Array(2040010, 850, 1, 1), //头盔体力诅咒卷轴
Array(2040011, 850, 1, 1), //头盔体力诅咒卷轴
Array(2040008, 850, 1, 1), //头盔防御诅咒卷轴
Array(2040009, 850, 1, 1), //头盔防御诅咒卷轴
Array(2043705, 850, 1, 1), //短杖魔力诅咒卷轴
Array(2043704, 850, 1, 1), //短杖魔力诅咒卷轴
Array(2040304, 850, 1, 1), //耳环智力诅咒卷轴
Array(2040305, 850, 1, 1), //耳环智力诅咒卷轴
Array(2044705, 850, 1, 1), //拳套攻击诅咒卷轴
Array(2044704, 850, 1, 1), //拳套攻击诅咒卷轴
Array(2040308, 850, 1, 1), //耳环防御力诅咒卷轴70%
Array(2040309, 850, 1, 1), //耳环防御力诅咒卷轴30%
Array(2044604, 850, 1, 1), //弩攻击诅咒卷轴
Array(2044605, 850, 1, 1), //弩攻击诅咒卷轴
Array(2040208, 850, 1, 1), //眼部装饰智力诅咒卷轴30%
Array(2040209, 850, 1, 1), //眼部装饰智力诅咒卷轴70%
Array(2040204, 850, 1, 1), //眼部装饰命中诅咒卷轴70%
Array(2040203, 850, 1, 1), //眼部装饰命中诅咒卷轴30%
Array(2041038, 850, 1, 1), //披风敏捷诅咒卷轴
Array(2041039, 850, 1, 1), //披风敏捷诅咒卷轴
Array(2041036, 850, 1, 1), //披风智力诅咒卷轴
Array(2041037, 850, 1, 1), //披风智力诅咒卷轴
Array(2041034, 850, 1, 1), //披风力量诅咒卷轴
Array(2041035, 850, 1, 1), //披风力量诅咒卷轴
Array(2041032, 850, 1, 1), //披风魔力诅咒卷轴
Array(2041033, 850, 1, 1), //披风魔力诅咒卷轴
Array(2041030, 850, 1, 1), //披风体力诅咒卷轴
Array(2041031, 850, 1, 1), //披风体力诅咒卷轴
Array(2041029, 850, 1, 1), //披风防御诅咒卷轴
Array(2041026, 850, 1, 1), //披风魔防诅咒卷轴
Array(2041027, 850, 1, 1), //披风魔防诅咒卷轴
Array(2041028, 850, 1, 1), //披风防御诅咒卷轴
Array(2041040, 850, 1, 1), //披风运气诅咒卷轴
Array(2041041, 850, 1, 1), //披风运气诅咒卷轴
Array(2041209, 850, 1, 1), //项链力量诅咒卷轴30%
Array(2041210, 850, 1, 1), //项链力量诅咒卷轴70%
Array(2041204, 850, 1, 1), //项链运气诅咒卷轴30%
Array(2041205, 850, 1, 1), //项链运气诅咒卷轴70%
Array(1142073, 200, 1, 1), //-----勋章-----
Array(1142075, 200, 1, 1), //
Array(1142654, 200, 1, 1), //
Array(1142650, 200, 1, 1), //
Array(1142443, 100, 1, 1), //
Array(1142360, 200, 1, 1), //
Array(1142119, 200, 1, 1), //
Array(1142101, 200, 1, 1), //
Array(1142120, 200, 1, 1), //
Array(1142081, 200, 1, 1), //
Array(1142118, 200, 1, 1), //
Array(1142114, 200, 1, 1), //
Array(1142076, 200, 1, 1), //
Array(1142116, 200, 1, 1), //
Array(1142115, 200, 1, 1), //
Array(1142082, 200, 1, 1), //
Array(1142117, 200, 1, 1), //
Array(1142113, 200, 1, 1), //
Array(1142112, 200, 1, 1), //
Array(1142006, 100, 1, 1), //
Array(1142231, 200, 1, 1), //
Array(1142233, 200, 1, 1), //
Array(1142230, 200, 1, 1), //
Array(1142232, 200, 1, 1) //
//Array(1142234, 1000, 1, 1), //披风运气诅咒卷轴
);

function start() {
	status = -1;
	action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
           selStr = "#e#r副本抽奖里拥有精品物品，99%获得\r\n\#b是否消耗2个#v4310030# + 10,0000金币 抽取？\r\n#n#k\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
			
			cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
		selStr = "\r\n";
		   for (i = 0; i < itemList.length; i++) {
                selStr += "#d#v" + itemList[i][0] + "#";
            }
		if (cm.getInventory(1).isFull(0)){//判断第一个也就是装备栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证装备栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(2).isFull(0)){//判断第二个也就是消耗栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证消耗栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(3).isFull(0)){//判断第三个也就是设置栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证设置栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(4).isFull(0)){//判断第四个也就是其它栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证其它栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();		
		} else if (cm.getInventory(5).isFull(0)){//判断第五个也就是现金栏的装备栏是否有一个空格		
		cm.sendOk("#b请保证现金栏位至少有1个空格,否则无法抽奖.");		
		cm.dispose();
        } else if (cm.haveItem(4310030,2) && cm.getMeso() >= 100000){
            cm.sendYesNo("你确定消耗2个#v4310030# + 10万金币，随机获得物品？\r\n可获得：各类椅子、玩具、装备等！"+selStr);
        } else {
           cm.sendOk("很抱歉物品数量不够.每次需消耗2个#v4310030# + 10万金币");
					cm.safeDispose();
        }
    } else if (status == 1) {
		var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random()*500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {
            
            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
           //var notice = finalitem[finalchance][3];
           // item = cm.gainGachaponItem(itemId, quantity,);//, notice
			var Laba = finalitem[finalchance][3];
			       
				   
				   if(ii.getInventoryType(itemId).getType() == 1){
			        	var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
						MapleInventoryManipulator.addFromDrop(cm.getC(),toDrop,false);
				}else{
				 	 var toDrop = new Equip(itemId,0).copy();
				cm.gainItem(itemId,quantity);
				}
				
             if (Laba == 1) {
			
			 cm.itemlaba("[副本抽奖]",toDrop)
             cm.gainItem(4310030,-2);//扣除
			 cm.gainMeso(-100000); //扣除金币
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            }
            cm.safeDispose();
        } else {
            cm.sendOk("今天的运气可真差，什么都没有拿到。");
            cm.gainItem(4310030,-2);//扣除
			cm.gainMeso(-100000); //扣除金币
            cm.safeDispose();
        }
    }
}