importPackage(java.lang);
importPackage(Packages.client);
importPackage(Packages.client.inventory);
importPackage(Packages.server);
importPackage(Packages.constants);
importPackage(Packages.net.channel);
importPackage(Packages.tools);
importPackage(Packages.scripting);
importPackage(Packages.tools.packet);
importPackage(Packages.tools.data);
importPackage(Packages.tools);
var status = 0;
var 高级数组 =
    Array(
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1),//蘑菇
        //Array(4031997,1000,1,1)//贵族披风1002939
    );

//用于显示
var showList = Array(
    /*Array(1102042,1000,1,1),//浪人披风(紫)
     Array(1102041,1000,1,1),//浪人披风(粉)
     Array(1102084,1000,1,1),//粉红盖亚披风
     Array(1102084, 1000, 1, 1), //粉红盖亚披风
     Array(2070006, 1000, 1, 1), //齿轮镖
     Array(2070007, 1000, 1, 1), //月牙镖

     Array(1092049, 1000, 1, 1), //热情剑盾
     Array(1122130,1000,1,1),//冒险之心
     Array(1012070,1000,1,1),//雪糕+攻
     Array(1002939,1000,1,1),  //安全帽
     Array(1402037,500,1,1),//龙背刃
     Array(1382047,800,1,1),  //冰灵珠长杖
     Array(1382045,800,1,1),  //火灵珠长杖
     Array(1382046,800,1,1),  //毒灵珠长杖4031997
     Array(1382048,800,1,1),  //雷灵珠长杖
     Array(1132257,1000,1,1),//腰带
     Array(1012015, 1000, 1, 1), //圣诞鹿的鼻子G
     Array(1102163,1000,1,1),//贵族披风1002939*/
    Array(4031997, 1, 1, 1),//蘑菇
    Array(1102042, 60, 1, 1),//浪人披风(紫)
    Array(1102041, 60, 1, 1),//浪人披风(粉)
    Array(1102084, 60, 1, 1),//粉红盖亚披风
    Array(1102163, 20, 1, 1),//贵族披风
    Array(1002939, 50, 1, 1),//安全帽
    Array(1122130, 50, 1, 1),//冒险之心
    Array(1122017, 5, 1, 1),//精灵吊坠
    //Array(1002357,60,1,1),//扎昆头盔
    //Array(1122000,10,1,1),//黑龙项链
    //Array(1022144,5,1,1),//眼饰
    //Array(1012474,5,1,1),//脸饰
    Array(1092030, 160, 1, 1),//枫叶盾
    Array(1092029, 160, 1, 1),//电磁盾
    Array(1092021, 160, 1, 1),//光子盾
    Array(1092008, 160, 1, 1),//锅盖
    Array(1132257, 20, 1, 1),//腰带
    //Array(1482012,100,1,1),  //拳甲1492012
    //Array(1492012,100,1,1),  //手枪
    Array(1092022, 160, 1, 1),//调色板盾牌
//Array(1092050, 30, 1, 1), //冷艳剑盾
//Array(1092049, 25, 1, 1), //热情剑盾
    Array(1012070, 20, 1, 1),//雪糕+攻
    Array(1012071, 100, 1, 1),//雪糕全属性
    Array(1012058, 200, 1, 1), //匹诺曹的鼻子
    Array(1012059, 200, 1, 1), //匹诺曹的鼻子
    Array(1012060, 100, 1, 1), //匹诺曹的鼻子
    Array(1012061, 200, 1, 1), //匹诺曹的鼻子
    Array(1012011, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012012, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012013, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012014, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012015, 150, 1, 1), //圣诞鹿的鼻子
    Array(1012016, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012017, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012018, 200, 1, 1), //圣诞鹿的鼻子
    Array(1012019, 200, 1, 1), //圣诞鹿的鼻子


//飞侠
    Array(2070006, 60, 1, 1),  //齿轮
    Array(2070007, 60, 1, 1),  //月牙
    Array(2070005, 130, 1, 1),  //金钱
    Array(2070004, 380, 1, 1),//黑色刺
    Array(2070010, 380, 1, 1),//冰凌
    //Array(1472033,80,1,1),  //虎纹拳套
    //Array(1472031,100,1,1),  //龙之拳
    //Array(1332027,100,1,1),  //飞羽刃
    //Array(1332052,100,1,1),  //阴风碎魂刃
    //Array(1472029,180,1,1),  //黑闪电甲
    //Array(1472025,100,1,1),  //黑战神拳套
    //Array(1082144,180,1,1),  //幻光手套
    //Array(1040118,100,1,1),  //红扣带护甲
    //Array(1060107,180,1,1),  //红色霹雳裤
    //Array(1050099,180,1,1),  //黑侠盗服
//战士
    //Array(1402037,1,1,1),//龙背刃
    //Array(1402063,80,1,1),//樱花伞
    //Array(1432011,100,1,1),  //寒冰破魔枪
    //Array(1432030,80,1,1),  //红莲
    //Array(1402016,100,1,1),  //所罗门
    //Array(1302023,100,1,1),  //六脉神剑
    //Array(1302056,100,1,1),  //一刀两断
    //Array(1422013,100,1,1),  //狮子之魂
    //Array(1402035,80,1,1),  //斩天刀
    //Array(1402005,100,1,1),  //斩魔刀
    //Array(1312015,100,1,1),  //战魂之斧
    //Array(1422027,100,1,1),  //泰坦之锤
    //Array(1402012,100,1,1),  //霸王剑
    //Array(1422009,200,1,1),  //妖精之锤
    //Array(1092027,150,1,1),  //银圣十字盾
    //Array(1002532,100,1,1),  //黑色格莱西头盔
    //Array(1072222,100,1,1),  //龙纹战靴

//法师
    //	Array(1372041,10,1,1),  //寒冰之杖
    //	Array(1372032,10,1,1),  //佘太君龙杖
    //	Array(1382047,30,1,1),  //冰灵珠长杖
    //	Array(1372037,100,1,1),  //冰灵珠短杖
    //	Array(1372039,10,1,1),  //爆炎之杖
    //	Array(1382045,30,1,1),  //火灵珠长杖
    //	Array(1372035,100,1,1),  //火灵珠短杖
    //	Array(1372040,10,1,1),  //剧毒之杖
    //	Array(1382046,30,1,1),  //毒灵珠长杖
    //	Array(1372036,100,1,1),  //毒灵珠短杖
    //	Array(1372042,10,1,1),  //狂雷之杖
    //	Array(1382048,30,1,1),  //雷灵珠长杖
    //	Array(1372038,100,1,1),  //雷灵珠短杖
    //	Array(1372010,80,1,1),  //嗜魂
    //	Array(1382035,80,1,1),  //冰肌玲珑
    //	Array(1372009,100,1,1),  //慈悲为怀
    Array(1372016, 150, 1, 1),  //凤凰短杖
    Array(1002253, 200, 1, 1),  //蓝神圣之冠
    Array(1050074, 150, 1, 1),  //黑神仙服
    //Array(1051097,150,1,1),  //黑祭司长袍
    //Array(1072209,100,1,1),  //杰斯特鞋
    //Array(1050105,100,1,1),  //灰幻魔长袍

//弓箭手
    Array(1462018, 100, 1, 1),  //红炎机神弩
    Array(1452017, 100, 1, 1),  //魔翼之弓
    //Array(1452019,100,1,1),  //天鹰白
    //	Array(1452021,100,1,1),  //天鹰黑
    //Array(1462017,100,1,1),  //黑暗圣瑶弩
    //Array(1452011,100,1,1),  //黄神弓
    //Array(1072205,150,1,1),  //夜精灵靴
    //Array(1050108,150,1,1),  //红飞羽服

    Array(1032080, 250, 1, 1),//一代不速之客耳环
    Array(1132036, 250, 1, 1),//一代不速之客腰带
    Array(1122081, 250, 1, 1),//一代不速之客项链
    Array(1032081, 110, 1, 1),//二代不速之客耳环
    Array(1132037, 110, 1, 1),//二代不速之客腰带
    Array(1122082, 100, 1, 1),//二代不速之客项链
    Array(1302143, 250, 1, 1),//一代不速之客单手剑
    Array(1312058, 250, 1, 1),//一代不速之客单手斧
    Array(1322086, 250, 1, 1),//一代不速之客单手钝器
    Array(1332121, 250, 1, 1),//一代不速之客短剑-力
    Array(1332116, 250, 1, 1),//一代不速之客短剑-运
    Array(1372074, 250, 1, 1),//一代不速之客短杖
    Array(1382095, 250, 1, 1),//一代不速之客长杖
    Array(1402086, 250, 1, 1),//一代不速之客双手剑
    Array(1412058, 250, 1, 1),//一代不速之客双手斧
    Array(1422059, 250, 1, 1),//一代不速之客双手钝器
    Array(1442107, 250, 1, 1),//一代不速之客矛
    Array(1452102, 250, 1, 1),//一代不速之客弓
    Array(1462087, 250, 1, 1),//一代不速之客弩
    Array(1472113, 250, 1, 1),//一代不速之客拳套


    //Array(5000016,30,1,1),//云豹
    //Array(4031559,100,1,1),//汉斯邮票
    //Array(4031560,100,1,1),//达鲁克邮票
    //Array(4031558,100,1,1),//武术教练邮票
    //Array(4031561,100,1,1),//赫丽娜邮票
    //Array(4251200,10,1,1),//下等五彩水晶
    //Array(4251201,10,1,1),//中等五彩水晶
    //Array(4251202,10,1,1),//高等五彩水晶4004000
    //Array(4004000,1000,1,1),//矿
    //Array(4004001,1000,1,1),//矿
    //Array(4004002,1000,1,1),//矿
    //Array(4004003,1000,1,1),//矿
    //Array(4004004,700,1,1),//矿4031179
    Array(4031179, 380, 1, 1),//D片
    Array(4001017, 380, 1, 1),//火眼
    Array(2340000, 300, 1, 1),//祝福卷轴
    Array(2049000, 380, 1, 1),//白衣卷轴
    Array(2049001, 350, 1, 1),//白衣卷轴
    Array(2049002, 250, 1, 1),//白衣卷轴
    Array(2049100, 380, 1, 1),//浑沌卷轴
    Array(2040914, 50, 1, 1),//盾牌攻击卷轴
    Array(2040915, 50, 1, 1),//头盔攻击卷轴
    Array(2040025, 50, 1, 1),//盾牌攻击卷轴  2040919
    Array(2040919, 100, 1, 1),//盾牌moli卷轴  2040919
    Array(2040920, 100, 1, 1),//盾牌moli卷轴  2040919
    Array(2040804, 50, 1, 1),//手攻10
    Array(2040805, 80, 1, 1),//手攻60
    Array(2040816, 50, 1, 1),//手攻10
    Array(2040817, 80, 1, 1),//手攻60
    Array(2040026, 100, 1, 1),//腰带力量卷轴
    Array(2041302, 10, 1, 1),
    Array(2041301, 100, 1, 1),//腰带敏捷卷轴
    Array(2041307, 10, 1, 1),
    Array(2041308, 10, 1, 1),
    Array(2041304, 100, 1, 1),//腰带智力卷轴
    Array(2041305, 10, 1, 1),
    Array(2041310, 100, 1, 1),//腰带运气卷轴
    Array(2041311, 10, 1, 1),
    Array(1002513, 100, 1, 1),//周年纪念帽
    Array(1002930, 100, 1, 1),//周年纪念帽
    Array(1003104, 100, 1, 1),//周年纪念帽
    Array(1032026, 10, 1, 1),//黄水晶
    Array(1032028, 200, 1, 1),//红水晶
    Array(1002419, 400, 1, 1),//枫叶帽
    Array(1002510, 400, 1, 1),//枫叶头盔30级
    Array(1002511, 400, 1, 1),//枫叶头盔70级
    Array(1002758, 200, 1, 1),//枫叶头盔90级

    Array(1002677, 200, 1, 1),//玩具匠人帽
    //Array(1002798,1000,1,1),//年糕1002798
    Array(1002743, 150, 1, 1),//海洋之帽

    //Array(1002391,1000,1,1),//海盗头巾(绿)
    //Array(1002392,1000,1,1),//海盗头巾(红)
    //Array(1002393,1000,1,1),//海盗头巾(粉)
    //Array(1002394,1000,1,1),//海盗头巾(灰)
    //Array(1002395,1000,1,1),//海盗头巾(紫)
    //Array(1002585,1000,1,1),//蓝色烤栗贩帽子
    //Array(1002586,1000,1,1),//紫色烤栗贩帽子
    //Array(1002587,1000,1,1),//黑色烤栗贩帽子
    //Array(1082002,1000,1,1),//工地手套
    //Array(1082145,500,1,1),//工地手套(黄)
    //Array(1082146,500,1,1),//工地手套(红)
    //Array(1082147,500,1,1),//工地手套(蓝)
    //Array(1082148,500,1,1),//工地手套(紫)
    //Array(1082149,500,1,1),//工地手套(褐)
    //Array(1082150,300,1,1),//工地手套(灰)1472063
//-------武器-------

    Array(1302030, 350, 1, 1), //枫叶剑
    Array(1302035, 350, 1, 1), //1302035 枫叶旗
    Array(1422029, 350, 1, 1), //1332025 枫叶刃
    Array(1332025, 350, 1, 1), //1382012 枫叶杖
    Array(1412011, 350, 1, 1),//1412011 枫叶斧
    Array(1422014, 350, 1, 1),//1422014 枫叶锤
    Array(1432012, 350, 1, 1),//1432012 枫叶枪
    Array(1442024, 350, 1, 1),//1442024 枫叶矛
    Array(1452022, 350, 1, 1),//1452022 枫叶弓
    Array(1462019, 350, 1, 1),//1462019 枫叶弩
    Array(1472032, 350, 1, 1),//1472032 枫叶拳
    Array(1472030, 350, 1, 1),//1472030 小枫叶拳
    Array(1482020, 350, 1, 1),//1482020 枫叶指节
    Array(1492020, 350, 1, 1),//1492020 枫叶枪

    Array(1432182, 350, 1, 1), //红色之矛(枪)
    Array(1492194, 350, 1, 1), //红色短枪
    Array(1482183, 350, 1, 1), //红色拳甲(海盗)
    Array(1382226, 350, 1, 1), //红色长杖
    Array(1402214, 350, 1, 1), //红色双手剑
    Array(1452220, 350, 1, 1), //红色弓
    Array(1462208, 350, 1, 1), //红色之弩
    Array(1472230, 350, 1, 1), //红色拳甲(标)
    Array(1332242, 350, 1, 1), //红色切割者
    Array(1422156, 350, 1, 1), //红色巨锤
    Array(1322054, 250, 1, 1), //枫叶地震锤
    Array(1412027, 250, 1, 1), //枫叶乾坤轮
    Array(1422029, 250, 1, 1), //枫叶轰天镗
    Array(1442051, 250, 1, 1), //枫叶战斧
    Array(1432040, 220, 1, 1),//枫叶钻天枪
    Array(1302064, 220, 1, 1),//枫叶突击剑
    Array(1402039, 220, 1, 1),//枫叶枭首剑
    Array(1382039, 220, 1, 1),//枫叶丹心杖
    Array(1452045, 220, 1, 1),//枫叶happy弓
    Array(1462040, 250, 1, 1),//枫叶击星弩
    Array(1472055, 220, 1, 1),//枫叶定天拳
    Array(1332056, 220, 1, 1),//枫叶追魂刺
    Array(1472063, 300, 1, 1),//魔法手套
    Array(1102040, 300, 1, 1),//浪人披风(黄)
    Array(1102043, 300, 1, 1),//浪人披风(褐)
    Array(1102085, 380, 1, 1),//黄色盖亚披风
    Array(1102086, 100, 1, 1),//紫色色盖亚披风

    //Array(1102079,1000,1,1),//破旧的红色披风
    //Array(1102081,1000,1,1),//破旧的黄色披风
    //Array(1102082,500,1,1),//破旧的黑色披风
    //Array(1102211,1000,1,1),//战神的披风
    //Array(1072262,500,1,1),//黑色桃乐斯皮鞋
    //Array(1072264,500,1,1),//银色桃乐斯皮鞋
    //Array(1072369,300,1,1),//1072369绿水灵鞋子

    Array(1012072, 385, 1, 1),//雪糕垃圾
    Array(1012073, 385, 1, 1),//雪糕垃圾
    Array(1022060, 100, 1, 1),//狐猴
    Array(1022067, 100, 1, 1),//黑狐猴
    Array(1012056, 100, 1, 1),//狗狗鼻子1012056
    Array(1012161, 166, 1, 1),//发光的鼻子
    Array(1022066, 385, 1, 1),//蓝海星眼镜
    Array(1050100, 50, 1, 1),//浴袍1050100
    Array(1050127, 50, 1, 1),//浴袍1050100
    Array(1051098, 50, 1, 1),//浴袍1050100
    Array(1051140, 50, 1, 1),//浴袍1050100

    Array(1322021, 385, 1, 1),//游泳圈
    Array(1322022, 385, 1, 1),//游泳圈
    Array(1322023, 385, 1, 1),//游泳圈
    Array(1322024, 300, 1, 1),//游泳圈
    Array(1322025, 300, 1, 1),//游泳圈
    Array(1322026, 280, 1, 1),//游泳圈
    //Array(1442054,600,1,1),//滑板
    Array(1442055, 300, 1, 1),//滑板
    Array(1442056, 300, 1, 1),//滑板
    Array(1442057, 300, 1, 1),//滑板

    Array(1432016, 300, 1, 1),//滑板1432016
    Array(1432017, 300, 1, 1),//滑板1432016
    Array(1432018, 300, 1, 1),//滑板1432016
    Array(1442012, 300, 1, 1),//雪板0
    Array(1442013, 385, 1, 1),//雪板12
    Array(1442014, 385, 1, 1),//雪板24
    Array(1442015, 385, 1, 1),//雪板36
    Array(1442016, 300, 1, 1),//雪板48
    Array(1442017, 300, 1, 1),//雪板60
    Array(1442046, 300, 1, 1),//超级滑板
    Array(1442021, 385, 1, 1),//黄拖把
    Array(1442022, 385, 1, 1),//白拖把
    Array(1442023, 385, 1, 1),//黑拖把
    //Array(2070004,2000,1,1),//经验书2370008
    //Array(2370009,2000,1,1),//经验书2370008
    //Array(2370010,2000,1,1),//经验书2370008
    //Array(2370011,2000,1,1),//经验书2370008
    //Array(2370012,2000,1,1),//经验书2370008
    Array(2370000, 100, 1, 1),//经验书10W
    Array(2370001, 110, 1, 1),//经验书5W
    Array(2370002, 150, 1, 1),//经验书3W
    Array(2370003, 200, 1, 1),//经验书2W
    Array(2370004, 300, 1, 1),//经验书
    //Array(2370005,2000,1,1),//经验书
    //Array(2370006,2000,1,1),//经验书
    //Array(2370007,2000,1,1),//经验书
    //Array(1302037,100,1,1),//小号
    Array(5390006, 300, 1, 1),//咆哮喇叭5390006
    Array(5390000, 300, 1, 1),//喇叭5390006
    Array(5390001, 300, 1, 1),//喇叭5390006
    Array(5390002, 300, 1, 1),//喇叭5390006
    Array(5390003, 300, 1, 1),//喇叭5390006
    Array(5390004, 300, 1, 1),//喇叭5390006
    Array(5390005, 300, 1, 1),//喇叭5390006

    Array(1072238, 100, 1, 1),//紫色钉鞋
    Array(1072239, 100, 1, 1),//黄色钉鞋
    Array(1002663, 385, 1, 1),//可乐帽子
    Array(1302063, 50, 1, 1),//燃烧的火焰刀
    Array(1302106, 50, 1, 1),//燃烧的冰焰刀
    Array(1302080, 100, 1, 1),//冒险岛小灯泡
    Array(1302085, 100, 1, 1),//叉子
    Array(1302087, 200, 1, 1),//火炬
    Array(1382015, 150, 1, 1),//毒蘑菇
    Array(1382016, 150, 1, 1),//香菇
    Array(1402044, 300, 1, 1),//南瓜灯笼
    Array(1302061, 100, 1, 1),//蔓藤鞭子
    Array(1422030, 300, 1, 1),//粉红海豹抱枕
    Array(1422031, 300, 1, 1),//蓝色海豹抱枕
    Array(1432046, 300, 1, 1),//圣诞树手杖
    Array(1432013, 100, 1, 1),//南瓜枪
    Array(1302024, 385, 1, 1),//废报纸武器
    Array(1322051, 300, 1, 1),//七夕
    Array(1402014, 30, 1, 1),//温度计
    Array(1402029, 100, 1, 1),//鬼刺狼牙棒
    Array(1422011, 300, 1, 1),//酒瓶
    Array(1332053, 385, 1, 1),//野外烧烤
    Array(1372017, 100, 1, 1),//领路灯
    Array(5570000, 100, 1, 1),//金锤子
    Array(1422036, 100, 1, 1),//玩具锤子
    Array(1302021, 385, 1, 1),//玩具锤子1302021
    Array(1322027, 300, 1, 1),//平底锅
    Array(1442039, 300, 1, 1),//冻冻鱼
    Array(1302019, 200, 1, 1),//无名剑
    Array(1332021, 300, 1, 1),//乌龙茶
    //Array(1302128,1000,1,1),//火柴
    //Array(1302084,1000,1,1),//火柴
    Array(1402013, 100, 1, 1),//白日剑
    Array(1302036, 300, 1, 1),//枫叶小旗
    Array(1302049, 100, 1, 1),//光线鞭
    Array(1302001, 385, 1, 1),//锯子
    Array(1312012, 385, 1, 1),//呼啦圈
    Array(1322006, 385, 1, 1),//钢管
    Array(1422011, 300, 1, 1),//清酒
    Array(1432039, 100, 1, 1),//钓鱼竿
    //御守
    Array(2022219, 300, 1, 1),//蝙蝠怪御守
    Array(2022223, 200, 1, 1),//扎昆御守
    Array(2022220, 150, 1, 1),//星光精灵御守
    Array(2022216, 200, 1, 1),//蘑菇王御守
    Array(2022217, 100, 1, 1),//皮亚奴斯御守
    Array(2022218, 200, 1, 1),//帕普拉图斯御守
    Array(2022245, 80, 1, 1),//心跳停止糖
//点装
    Array(1050293, 170, 1, 1),//海滩帅锅装
    Array(1004640, 170, 1, 1),//怪物联盟棒球帽
    Array(1052634, 170, 1, 1),//简洁白衬衫
    Array(1051409, 170, 1, 1),//闪亮艾斯女孩
    Array(1042078, 170, 1, 1),//水手服
    Array(1052998, 170, 1, 1),//外星人连身衣
    Array(1052224, 170, 1, 1),//草莓baby装
    Array(1042198, 170, 1, 1),//彩虹t恤
    Array(1042204, 170, 1, 1),//汉堡t恤
    Array(1052056, 170, 1, 1),//韩国足球服
    Array(1702625, 170, 1, 1),//爱情蓝鸟武器
    Array(1702589, 170, 1, 1),//樱花物语
    Array(1702375, 170, 1, 1),//亚特兰蒂斯
    Array(1702457, 170, 1, 1),//冬天里的雪糕
    Array(1042104, 170, 1, 1),//小绿叶T恤
    Array(1042105, 170, 1, 1),//小红叶T恤
    Array(1012131, 170, 1, 1),//好白的牙齿
    Array(1042142, 170, 1, 1),//彩虹条背心
    Array(1062093, 170, 1, 1),//嫩绿休闲短裤
    Array(1702611, 170, 1, 1),//小鸭单肩包
    Array(1004636, 170, 1, 1),//香蕉郊游帽
    Array(1042349, 170, 1, 1),//黑色摇滚连帽衫
    //Array(1012049,170,1,1),//怪物面具
    Array(1702660, 170, 1, 1),//调皮雪人武器
    Array(1702640, 170, 1, 1),//兔儿雪绒绒
    Array(1082592, 170, 1, 1),//焰鬼隐布
    Array(1102066, 170, 1, 1),//邪魔披风
    Array(1052948, 170, 1, 1),//奥尔卡的睡袍
    //Array(1004540,170,1,1),//奥尔卡的睡帽
    Array(1052951, 170, 1, 1),//波点连身裙
    Array(1102778, 170, 1, 1),//棒棒糖披风
    Array(1102142, 170, 1, 1),//火焰披风
    Array(1102749, 170, 1, 1),//五彩星星气球
    Array(1102754, 170, 1, 1),//群鸟之星
    Array(1102755, 170, 1, 1),//星光点点气球
    //Array(1102756,170,1,1),//微笑玉米斗篷
    Array(1102757, 170, 1, 1),//巴尼兔心形气球
    Array(1102808, 170, 1, 1),//啵啵鼠气球
    Array(1102692, 170, 1, 1),//小小寿司团
    Array(1102688, 170, 1, 1),//双色砰砰炮
    Array(1102682, 170, 1, 1),//未来天使注射器
    Array(1102684, 170, 1, 1),//未来医生听诊器
    Array(1102676, 170, 1, 1),//摇摆猫咪酱
    Array(1102220, 170, 1, 1),//小绵羊披风
    Array(1102665, 170, 1, 1),//狐狸围脖
    Array(1102605, 170, 1, 1),//暗炎赎罪者
    Array(1072484, 170, 1, 1),//黑猫拖鞋
    Array(1072258, 170, 1, 1),//白猫拖鞋
    Array(1072337, 170, 1, 1),//喜羊羊拖
    Array(1082312, 170, 1, 1),//彩虹护腕
    Array(1082493, 170, 1, 1),//海豹白白手套
    Array(1082581, 170, 1, 1),//巧克力发带装饰
    Array(1082549, 170, 1, 1),//咯咯嗒手套
    Array(1082503, 170, 1, 1),//圣洁天使手镯
    Array(1082548, 170, 1, 1),//星星手镯

    Array(1112907, 170, 1, 1),//小鱼戒指
    Array(1112273, 170, 1, 1),//小黄鸭聊天戒指
    Array(1112161, 170, 1, 1),//小黄鸭名片
    Array(1112271, 170, 1, 1),//非洲之星聊天
    Array(1112159, 170, 1, 1),//非洲之星名片
    Array(1112120, 170, 1, 1),//可乐名片
    Array(1112230, 170, 1, 1),//可乐聊天
    Array(1112253, 170, 1, 1),//木乃伊聊天
    Array(1112142, 170, 1, 1),//木乃伊名片
    Array(1112257, 170, 1, 1),//浪漫花边聊天
    Array(1112145, 170, 1, 1),//浪漫花边名片
    Array(1112258, 170, 1, 1),//青苹果之恋聊天
    Array(1112146, 170, 1, 1),//青苹果之恋名片
    Array(1112237, 170, 1, 1),//小竹林聊天
    Array(1112134, 170, 1, 1),//小竹林名片
    Array(1112174, 170, 1, 1),//足球名片
    Array(1112286, 170, 1, 1),//足球聊天
    Array(1112288, 170, 1, 1),//旋律音符聊天
    Array(1112178, 170, 1, 1),//梦幻雪景名片
    Array(1112290, 170, 1, 1),//梦幻雪景聊天
    Array(1112179, 170, 1, 1),//雪花圣诞名片
    Array(1112291, 170, 1, 1),//雪花圣诞聊天
    Array(1112165, 170, 1, 1),//绿光森林名片
    Array(1112277, 170, 1, 1),//绿光森林聊天
    Array(1112262, 170, 1, 1),//天使降临聊天
    Array(1112150, 170, 1, 1),//天使降临名片戒指
    Array(1112176, 170, 1, 1),//旋律音符名片戒指
    Array(1112184, 170, 1, 1),//富豪泰格尔名片戒指
    Array(1112191, 170, 1, 1),//蜜蜂名片戒指
    Array(1112192, 170, 1, 1),//菠萝甜心名片戒指
    Array(1112197, 170, 1, 1),//晚安小怪兽名片戒指
    //Array(1112808,170,1,1),//钻石聊天戒指
    Array(1112210, 170, 1, 1),//黄金聊天戒指
    Array(1112218, 170, 1, 1),//小熊猫聊天戒指
    Array(1112103, 170, 1, 1),//嫩黄名片戒指

    Array(1004530, 170, 1, 1),//蓝色熊猫玩偶帽子
    Array(1004532, 170, 1, 1),//女皇关注
    Array(1004533, 170, 1, 1),//兰儿在游戏！
    Array(1004505, 170, 1, 1),//粉红樱花丝带
    Array(1004488, 170, 1, 1),//治愈之丝带
    Array(1004486, 170, 1, 1),//春之主人
    Array(1004467, 170, 1, 1),//特大爱心宽檐帽
    Array(1004468, 170, 1, 1),//小小训练师帽
    Array(1004454, 170, 1, 1),//狸猫帽子
    Array(1004414, 170, 1, 1),//热腾腾包子帽
    Array(1004328, 170, 1, 1),//粉色棒球帽
    Array(1004156, 170, 1, 1),//来这星星的你
    Array(1004108, 170, 1, 1),//幻夜蝶华礼帽

    //Array(4000487,30,1,1),//暗影币
    Array(5150038, 50, 1, 1),//超级明星5000016
    Array(5150040, 100, 1, 1),//皇家1032026

    Array(1702246, 150, 1, 1),//幽魂武器
    Array(1702248, 150, 1, 1),//圣诞鹿武器
    Array(1702278, 150, 1, 1),//枫之武器
    Array(1702305, 150, 1, 1),//胡萝卜武器
    Array(1702335, 150, 1, 1),//炼金师的武器
    Array(1702392, 150, 1, 1),//黑暗小恶魔武器
    Array(1702393, 150, 1, 1),//蛇年武器
    Array(1702372, 150, 1, 1),//圣杯武器
    Array(1702408, 150, 1, 1),//纪念日专用武器
    Array(1702401, 150, 1, 1),//兔子胡萝卜武器
    Array(1702459, 150, 1, 1),//棉花糖武器
    Array(1702460, 150, 1, 1),//星星武器
    Array(1702499, 150, 1, 1),//林之灵武器
    Array(1702550, 150, 1, 1),//桃太郎武器
    Array(1702538, 150, 1, 1),//露珠武器
    Array(1702508, 150, 1, 1),//草莓牛奶武器
    Array(1702588, 150, 1, 1),//黑猫玩具武器
    Array(1702598, 150, 1, 1),//枫叶武器
    Array(1702597, 150, 1, 1),//彩虹贝壳武器
    Array(1702579, 150, 1, 1),//水晶喵喵武器
    Array(1702576, 150, 1, 1),//啪嗒啪嗒打糕武器
    Array(1702660, 150, 1, 1),//调皮雪人武器
    Array(1702669, 150, 1, 1),//公主日记武器
    Array(1702617, 150, 1, 1),//幻想莲花武器
    Array(1702637, 150, 1, 1),//音乐律动武器箱
    Array(1702625, 150, 1, 1),//爱情蓝鸟武器
    //Array(1472063,100,1,1),//魔法手套
    //Array(1062073,300,1,1),//特别南瓜裤(米)点
    //Array(1062074,300,1,1),//特别南瓜裤(黑褐)点
//-----椅子-----
    Array(3010838, 30, 1, 1),//冰城堡
    Array(3010835, 100, 1, 1),//爱情水晶球记忆椅子
    Array(3010832, 10, 1, 1),//太阳
    Array(3010831, 50, 1, 1),//海王星
    Array(3010830, 60, 1, 1),//天王星
    Array(3010829, 30, 1, 1),//土星
    Array(3010828, 40, 1, 1),//木星
    Array(3010827, 70, 1, 1),//火星
    Array(3010826, 80, 1, 1),//地球
    Array(3010825, 90, 1, 1),//金星
    Array(3010824, 80, 1, 1),//水星
    Array(3010823, 100, 1, 1), //蘑菇智能手表
    Array(3010822, 100, 1, 1), //贪吃鳄鱼
    Array(3010821, 100, 1, 1), //童年玩具箱
    Array(3010109, 200, 1, 1), //暖炉椅
    Array(3010080, 200, 1, 1), //柿子树
    Array(3010112, 385, 1, 1),
    Array(3010125, 80, 1, 1), //尼贝龙战舰椅子
    Array(3010124, 80, 1, 1), //都纳斯喷气椅子
    Array(3010120, 100, 1, 1), //彩蛋篮子
    Array(3010093, 100, 1, 1), //鲜美的火鸡
    Array(3010075, 50, 1, 1), //我为音乐狂
    Array(3010212, 100, 1, 1), //藏獒椅子
    Array(3010462, 200, 1, 1), //天文台
    Array(3010412, 200, 1, 1), //双塔
    Array(3010149, 200, 1, 1), //风扇
    Array(3015428, 200, 1, 1), //和猴子一起放烟花椅子
    Array(3010795, 200, 1, 1), //森林中休息处
    Array(3010206, 300, 1, 1), //梦想画家椅子
    Array(3015225, 20, 1, 1), //和大象一起自拍椅子
    Array(3010976, 80, 1, 1), //为我加油！椅子
    Array(3010999, 80, 1, 1), //主人请用餐椅子
    Array(3010804, 200, 1, 1), //军人月妙拜年椅子
    Array(3010899, 200, 1, 1), //摆钟椅子
    Array(3015120, 100, 1, 1), //枕头大战
    Array(3010043, 100, 1, 1),//魔女的飞扫把
    Array(3015051, 10, 1, 1),//巨无霸国际巨星
    Array(3015183, 10, 1, 1),//绿水灵背景椅子
    Array(3015096, 10, 1, 1),//羊羊幻想牧场椅子
    Array(3010180, 385, 1, 1),//HP椅子
    Array(3010009, 10, 1, 1),//粉色爱心马桶
    Array(3010028, 100, 1, 1),//老海盗椅子
    Array(3012006, 50, 1, 1),//风吹稻香
    Array(3010013, 10, 1, 1),//悠长假期
    Array(3010034, 10, 1, 1),//悠长假期
    Array(3010035, 10, 1, 1),//悠长假期
    Array(3010029, 180, 1, 1), //蓝环凳
    Array(3010030, 180, 1, 1), //黑环凳
    Array(3010031, 180, 1, 1), //红环凳
    Array(3010032, 180, 1, 1), //黄环凳
    Array(3010033, 180, 1, 1), //绿环凳
    Array(3010037, 180, 1, 1), //猪猪凳
    Array(3010014, 380, 1, 1),//月亮弯
    Array(3010018, 380, 1, 1),//椰子树沙滩椅
    Array(3010025, 380, 1, 1),//枫叶纪念凳
    Array(3012001, 380, 1, 1),//篝火
    Array(3012002, 100, 1, 1),//浴桶---
    Array(3010073, 50, 1, 1),//PB克缤
    Array(3010049, 50, 1, 1),//雪房子
    Array(3010068, 50, 1, 1),//露水椅子
    Array(3010070, 10, 1, 1),//巨无霸品克缤
    Array(3010095, 100, 1, 1),//石头人座椅
//-----后期植入椅子-----
    Array(3010898, 100, 1, 1),//迷你神兽椅子
    Array(3015304, 10, 1, 1), //哗啦啦大水车
    Array(3010465, 100, 1, 1),//可爱音符椅子
    Array(3010460, 100, 1, 1),//爆竹椅子
    Array(3010450, 100, 1, 1),//艾莉珍椅子
    Array(3010455, 100, 1, 1),//扎昆的帝王椅子
    Array(3010456, 100, 1, 1),//杜鹃花椅子
    Array(3010458, 100, 1, 1),//翻滚兔子椅子
    Array(3010863, 50, 1, 1),//愤怒的美发师椅子
    Array(3010447, 100, 1, 1),//睡觉小鸟椅子
    Array(3010446, 100, 1, 1),//皮肤皇后椅子
    Array(3010448, 100, 1, 1),//泡泡浴椅子
    Array(3010434, 100, 1, 1),//热带夏日椅子
    Array(3010428, 100, 1, 1),//水晶椅子
    Array(3010409, 100, 1, 1),//粽子椅子
    Array(3010094, 100, 1, 1),//漂漂猪椅子-----------------------
    Array(3010411, 100, 1, 1),//鱼尾狮椅子
    Array(3010085, 50, 1, 1),//鬼娃娃椅子
    Array(3010077, 100, 1, 1),//猫头鹰椅子
    Array(3010053, 50, 1, 1),//兔子纪念版椅子
    Array(3010151, 200, 1, 1),//无人岛椅子
    Array(3015415, 50, 1, 1),//猴子椅子
    Array(3010142, 50, 1, 1),//水族馆椅子
    Array(3010144, 100, 1, 1),//七夕椅子
    Array(3015430, 100, 1, 1),//年兽椅子
    Array(3010117, 100, 1, 1),//魔法书椅子
    Array(3015424, 100, 1, 1),//超级饺子椅子
    Array(3015428, 100, 1, 1),//和猴子一起放烟花椅子
    Array(3015427, 100, 1, 1),//和猴子一起玩麻将椅子
    Array(3010804, 100, 1, 1),//军人月妙拜年椅子
    Array(3015045, 50, 1, 1),//羊绒咩咩椅子--------------
    Array(3010375, 50, 1, 1),//奥妙的超级药水椅子
    Array(3015057, 50, 1, 1),//烟花绽放椅子
    Array(3010373, 50, 1, 1),//云朵洗手间椅子
    Array(3010799, 100, 1, 1),//坟墓幽灵椅子
    Array(3010737, 50, 1, 1),//动物英雄团椅子
    Array(3010734, 100, 1, 1),//猫箱椅子
    Array(3010738, 50, 1, 1),//闪电三人组椅子
    Array(3010740, 100, 1, 1),//圣诞树椅子
    Array(3010365, 100, 1, 1),//休彼德蔓的古代石掌椅子
    Array(3010306, 100, 1, 1),//生如夏花椅子
    Array(3010301, 50, 1, 1),//高级HP药水椅子
    Array(3010188, 100, 1, 1),//班·雷昂椅子
    Array(3010186, 100, 1, 1),//兔子椅子
    Array(3010184, 50, 1, 1),//冰钓椅子
    Array(3010173, 50, 1, 1),//万圣节塔罗椅子
    Array(3010175, 50, 1, 1),//名画家椅子
    Array(3010195, 100, 1, 1),//无价之宝椅子
    Array(3010210, 100, 1, 1),//草莓冰淇淋月饼椅子--------------
    Array(3010224, 250, 1, 1),//年糕冰淇淋椅子
    Array(3010036, 50, 1, 1),//浪漫秋千
    Array(3010044, 50, 1, 1),//同一红伞下
    Array(3010111, 100, 1, 1),//虎虎生威
    Array(3010115, 100, 1, 1),//熊宝宝床
    Array(3010126, 50, 1, 1),//蝙蝠魔王座
    Array(3010313, 50, 1, 1),//粉红扎昆椅子
    Array(3010128, 50, 1, 1),//黑龙王座
    Array(3010133, 100, 1, 1),//帐篷椅
    Array(3010152, 200, 1, 1),//黄三角帐篷椅
    Array(3010291, 100, 1, 1),//早日康复床
    Array(3010172, 100, 1, 1),//星空椅子
    Array(3010168, 100, 1, 1),//友谊万岁椅子
    Array(3010185, 100, 1, 1),//小伙伴品克缤
    Array(3010622, 100, 1, 1),//我的好友丹珍之椅
    Array(3010453, 100, 1, 1),//兔子乘风椅
    Array(3010493, 100, 1, 1),//那就是我--------------------------------
    Array(3010527, 100, 1, 1),//深海章鱼
    Array(3010531, 100, 1, 1),//小企鹅合唱团
    Array(3010565, 100, 1, 1),//我的女皇椅子
    Array(3010587, 100, 1, 1),//时间胶囊
    Array(3010609, 100, 1, 1),//不是在做梦
    Array(3010608, 100, 1, 1),//完美的名画椅子
    Array(3010661, 100, 1, 1),//欢乐相框椅子
    Array(3010678, 100, 1, 1),//海加顿之安息
    Array(3010739, 100, 1, 1),//雪人香波椅子
    Array(3010744, 100, 1, 1),//冒险岛的砖头朋友们
    Array(3010752, 100, 1, 1),//玫瑰鸟笼
    Array(3010756, 100, 1, 1),//新年招财猫椅子
    Array(3010767, 100, 1, 1),//雪人椅子
    Array(3010760, 100, 1, 1),//古代浴池椅子
    Array(3010795, 100, 1, 1),//森林中休息处
    Array(3010806, 100, 1, 1),//桃樱芳菲椅
    Array(3010848, 100, 1, 1),//红地毯主人公椅子
    Array(3012024, 100, 1, 1),//沙滩排球椅子
    Array(1142073, 150, 1, 1), //-----勋章-----
    Array(1142075, 150, 1, 1), //
    Array(1142654, 150, 1, 1), //
    Array(1142650, 150, 1, 1), //
    Array(1142443, 150, 1, 1), //
    Array(1142360, 150, 1, 1), //
    Array(1142119, 150, 1, 1), //
    Array(1142101, 150, 1, 1), //
    Array(1142120, 150, 1, 1), //
    Array(1142081, 150, 1, 1), //
    Array(1142118, 150, 1, 1), //
    Array(1142114, 150, 1, 1), //
    Array(1142076, 150, 1, 1), //
    Array(1142116, 150, 1, 1), //
    Array(1142115, 150, 1, 1), //
    Array(1142082, 150, 1, 1), //
    Array(1142117, 150, 1, 1), //
    Array(1142113, 150, 1, 1), //
    Array(1142112, 150, 1, 1), //
    Array(1142006, 150, 1, 1), //
    Array(1142231, 150, 1, 1), //
    Array(1142233, 150, 1, 1), //
    Array(1142230, 150, 1, 1), //
    Array(1142232, 150, 1, 1) //
    /*Array(
     Array(1002418, 1000, 1, 1), //废报纸头盔
     Array(1002419, 1000, 1, 1), //枫叶帽
     Array(1002424, 1000, 1, 1), //红马术帽
     Array(1002425, 1000, 1, 1), //蓝马术帽
     Array(1002554, 1000, 1, 1), //武艺头绳
     Array(1002677, 1000, 1, 1), //玩具匠人帽
     Array(1002699, 1000, 1, 1), //南瓜帽子
     Array(1002441, 1000, 1, 1), //热血头带
     Array(1002508, 1000, 1, 1), //枫叶头盔
     Array(1002509, 1000, 1, 1), //枫叶头盔
     Array(1002510, 1000, 1, 1), //枫叶头盔
     Array(1002511, 1000, 1, 1), //枫叶头盔
     Array(1002391, 1000, 1, 1), //海盗头巾(绿)
     Array(1002392, 1000, 1, 1), //海盗头巾(红)
     Array(1002393, 1000, 1, 1), //海盗头巾(粉)
     Array(1002394, 1000, 1, 1), //海盗头巾(灰)
     Array(1002395, 1000, 1, 1), //海盗头巾(紫)
     Array(1002894, 1000, 1, 1), //粉色编织发带
     Array(1002895, 1000, 1, 1), //红色编织发带
     Array(1002896, 1000, 1, 1), //紫色编织发带
     Array(1002897, 1000, 1, 1), //橙色编织发带
     Array(1002898, 1000, 1, 1), //绿色编织发带
     Array(1002899, 1000, 1, 1), //黄色编织发带
     Array(1002900, 1000, 1, 1), //蓝色编织发带
     //------脸饰------
     Array(1012056, 1000, 1, 1), //狗狗鼻
     Array(1022047, 1000, 1, 1), //猫头鹰
     Array(1012058, 1000, 1, 1), //匹诺曹的鼻子
     Array(1012059, 1000, 1, 1), //匹诺曹的鼻子
     Array(1012060, 1000, 1, 1), //匹诺曹的鼻子
     Array(1012061, 1000, 1, 1), //匹诺曹的鼻子
     Array(1122001, 1000, 1, 1), //绿色蝶形领结
     Array(1122002, 1000, 1, 1), //红色蝶形领结
     Array(1122003, 1000, 1, 1), //黄色蝶形领结
     Array(1122004, 1000, 1, 1), //粉红蝶形领结
     Array(1122005, 1000, 1, 1), //黑色蝶形领结
     Array(1122006, 1000, 1, 1), //蓝色蝶形领结
     Array(1012477, 1, 1, 1), //甜瓜味雪糕
     Array(1012420, 1, 1, 1), //水果草莓味雪糕
     Array(1012419, 1000, 1, 1), //甜瓜味雪糕
     Array(1012417, 1, 1, 1), //巧克力雪糕
     Array(1012418, 1000, 1, 1), //西瓜味雪糕
     Array(1012416, 1, 1, 1), //草莓雪糕
     Array(1012073, 1000, 1, 1), //西瓜雪糕
     Array(1012071, 1000, 1, 1), //巧克力雪糕
     Array(1012072, 1000, 1, 1), //甜瓜雪糕
     Array(1012070, 1, 1, 1), //草莓雪糕
     //------吊坠------
     Array(1122015, 1000, 1, 1), //枫叶围巾
     Array(1122074, 1000, 1, 1), //枫叶吊坠
     //------盾牌------
     Array(1092022, 1000, 1, 1), //调色板盾牌
     Array(1092050, 1, 1, 1), //冷艳剑盾
     Array(1092049, 1, 1, 1), //热情剑盾
     //------椅子------
     Array(3015304, 1, 1, 1), //哗啦啦大水车
     Array(3015051, 1000, 1, 1), //巨无霸国际巨星
     Array(3010070, 1000, 1, 1), //巨无霸品克缤
     Array(3015172, 1, 1, 1), //幻想牧场椅子
     Array(3015173, 1, 1, 1), //夏日美梦椅子
     Array(3010999, 1, 1, 1), //主人请用餐椅子
     Array(3010976, 1, 1, 1), //为我加油！椅子
     Array(3015225, 1, 1, 1), //和大象一起自拍椅子
     Array(3010206, 1, 1, 1), //梦想画家椅子
     Array(3010151, 1, 1, 1), //无人岛椅子
     Array(3010848, 1, 1, 1), //红地毯主人公椅子
     Array(3010044, 1000, 1, 1), //同一红伞下
     Array(3010036, 1000, 1, 1), //浪漫秋千
     Array(3010879, 1000, 1, 1), //繁星椅子
     Array(3010199, 1000, 1, 1), //雪房子
     Array(3010795, 1000, 1, 1), //森林中休息处
     Array(3010494, 1000, 1, 1), //TV椅子
     Array(3010490, 1000, 1, 1), //红色大象
     Array(3010465, 1000, 1, 1), //可爱音符椅子
     Array(3010460, 1000, 1, 1), //红色爆竹
     Array(3010450, 1000, 1, 1), //艾莉珍椅子
     Array(3010447, 1000, 1, 1), //睡觉小鸟
     Array(3010448, 1000, 1, 1), //泡泡浴椅子
     Array(3010440, 1000, 1, 1), //寻找故乡的月妙椅子
     Array(3010431, 1000, 1, 1), //夏日喵喵椅子
     Array(3015041, 1000, 1, 1), //舒适大白熊椅子
     Array(3010374, 1000, 1, 1), //闪耀星星之夜椅子
     Array(3010373, 1000, 1, 1), //云朵洗手间椅子
     Array(3015096, 1000, 1, 1), //羊羊幻想牧场椅子
     Array(3010296, 1000, 1, 1), //甜蜜的圣诞椅子
     Array(3012025, 1000, 1, 1), //小鸡弹簧床椅子
     Array(3012024, 1000, 1, 1), //沙滩排球椅子
     Array(3010570, 1000, 1, 1), //迷你神兽椅子
     Array(3010525, 1000, 1, 1), //猫头鹰椅子
     Array(3010544, 1000, 1, 1), //热带夏日椅子
     Array(3010849, 1000, 1, 1), //最佳新人椅子
     Array(3010850, 1000, 1, 1), //潮流评论家椅子
     Array(3010168, 1000, 1, 1), //友谊万岁椅子
     Array(3010142, 1000, 1, 1), //水族馆椅子
     Array(3015428, 1000, 1, 1), //和猴子一起放烟花椅子
     //------披风------
     Array(1102053, 1000, 1, 1), //破披风
     Array(1102166, 1000, 1,1), //枫叶披风
     Array(1102167, 1000, 1, 1), //枫叶披风
     Array(1102168, 1000, 1, 1), //枫叶披风
     Array(1102084, 1000, 1, 1), //粉红盖亚披风
     Array(1092050, 1, 1, 1), //冷艳剑盾
     Array(1092049, 1, 1, 1), //热情剑盾
     Array(1102085, 1000, 1, 1), //黄色盖亚披风
     Array(1102086, 1000, 1, 1), //紫色盖亚披风
     Array(1102041, 1000, 1, 1), //浪人披风(粉)
     Array(1102040, 1000, 1, 1), //浪人披风(黄)
     Array(1102043, 1000, 1, 1), //浪人披风(褐)
     Array(1102042, 1000, 1, 1), //浪人披风(紫)
     Array(2070005, 1000, 1, 1), //金钱镖
     Array(2070006, 1000, 1, 1), //齿轮镖
     Array(2070007, 1000, 1, 1), //月牙镖
     Array(1102084, 1000, 1, 1), //粉红盖亚披风
     Array(1092050, 1, 1, 1), //冷艳剑盾
     Array(1092049, 1, 1, 1), //热情剑盾
     //-------武器------
     Array(1051017, 1000, 1, 1), //红色桑拿服
     Array(1050018, 1000, 1, 1), //蓝色桑拿服
     Array(1372017, 1000, 1, 1), //领路灯
     Array(1302049, 1000, 1, 1), //光线鞭子
     Array(1302021, 1000, 1, 1), //橡皮榔头
     Array(1302022, 1000, 1, 1), //竹刀
     Array(1302024, 1000, 1, 1), //废报纸卷
     Array(1302061, 1000, 1, 1), //蔓藤鞭子
     Array(1302067, 1000, 1, 1), //枫叶庆典旗
     Array(1302080, 1000, 1, 1), //七彩霓虹灯泡
     Array(1302084, 1000, 1, 1), //火柴
     Array(1302085, 1000, 1, 1), //叉子
     Array(1302087, 1000, 1, 1), //火炬
     Array(1312002, 1000, 1, 1), //镰刀
     Array(1312012, 1000, 1, 1), //乾坤圈
     Array(1312013, 1000, 1, 1), //判官笔
     Array(1312014, 1000, 1, 1), //阎王笔
     Array(1402014, 1000, 1, 1), //温度计
     Array(1402029, 1000, 1, 1), //鬼刺狼牙棒
     Array(1322009, 1000, 1, 1), //马桶吸
     Array(1322027, 1000, 1, 1), //米伽勒的平底锅
     Array(1322051, 1000, 1, 1), //七夕
     Array(1322071, 1000, 1, 1), //采矿铁锹
     //Array(1322053, 1, 1, 1), //棒槌
     Array(1332053, 10, 1, 1), //野外烧烤串
     Array(1332054, 22, 1, 1), //闪电飞刀
     Array(1382015, 1000, 1, 1), //毒蘑菇
     Array(1382016, 1, 1, 1), //香菇 ——--高级货
     Array(1402044, 1000, 1, 1), //南瓜灯笼
     Array(1422036, 1000, 1, 1), //玩具匠人的锤子
     Array(1432039, 1000, 1, 1), //钓鱼竿
     Array(1432046, 1000, 1, 1), //圣诞树手杖
     Array(1432048, 10, 1, 1), //铲子
     Array(1442018, 1000, 1, 1), //冻冻鱼
     Array(1442021, 1000, 1, 1), //黄拖把
     Array(1442022, 1000, 1, 1), //白拖把
     Array(1442023, 1000, 1, 1), //黑拖把
     Array(1442004, 1000, 1, 1), //拖把
     Array(1432009, 1000, 1, 1), //木精灵枪
     Array(1432132, 1000, 1, 1), //木精灵枪
     Array(1372031, 1000, 1, 1), //圣贤短杖
     Array(1372033, 1000, 1, 1), //圣贤短杖
     Array(1442121, 1000, 1, 1), //敏捷战士的玫瑰
     Array(1442122, 1000, 1, 1), //恐怖战士的玫瑰
     Array(1442123, 1000, 1, 1), //愤怒战士的玫瑰
     Array(1302017, 1000, 1, 1), //蓝色雨伞
     Array(1302016, 1000, 1, 1), //黄色雨伞
     Array(1302025, 1, 1, 1), //红雨伞
     Array(1302026, 1, 1, 1), //黑雨伞
     Array(1302027, 1000, 1, 1), //绿雨伞
     Array(1302028, 1000, 1, 1), //紫雨伞
     Array(1302029, 1000, 1, 1), //褐雨伞
     Array(1302035, 50, 1, 1), //枫叶旗
     Array(1302036, 50, 1, 1), //枫叶旗
     Array(1302058, 1000, 1, 1), //冒险岛伞
     Array(1302252, 1000, 1, 1), //冒险岛雨伞
     Array(1312033, 50, 1, 1), //枫叶3年旗
     Array(1412028, 50, 1, 1), //枫叶3年旗
     Array(1302066, 50, 1, 1), //枫叶3年旗
     Array(1332057, 50, 1, 1), //枫叶3年旗
     Array(1422032, 50, 1, 1), //枫叶3年旗
     Array(1432041, 50, 1, 1), //枫叶3年旗
     Array(1442052, 50, 1, 1), //枫叶3年旗
     Array(1462041, 50, 1, 1), //枫叶3年旗
     Array(1472056, 50, 1, 1), //枫叶3年旗
     Array(1492034, 50, 1, 1), //枫叶3年旗
     Array(1312034, 1000, 1, 1), //粉色花边游泳圈
     Array(1422033, 1, 1, 1), //粉色花边游泳圈
     Array(1432042, 1, 1, 1), //粉色花边游泳圈
     Array(1332059, 1, 1, 1), //粉色花边游泳圈
     Array(1492026, 1, 1, 1), //粉色花边游泳圈
     Array(1452048, 1, 1, 1), //粉色花边游泳圈
     Array(1302230, 1, 1, 1), //粉色花边游泳圈
     Array(1302075, 22, 1, 1), //新加坡国旗（单手剑）
     Array(1302076, 22, 1, 1), //马来西亚国旗（单手剑）
     Array(1312035, 22, 1, 1), //新加坡国旗（单手斧）
     Array(1312036, 22, 1, 1), //马来西亚国旗（单手斧）
     Array(1322057, 22, 1, 1), //新加坡国旗（单手杖）
     Array(1322058, 22, 1, 1), //马来西亚国旗（单手杖）
     Array(1332060, 22, 1, 1), //新加坡国旗（短剑）
     Array(1332061, 22, 1, 1), //马来西亚国旗（短剑）
     Array(1382043, 22, 1, 1), //新加坡国旗（长杖）
     Array(1382044, 22, 1, 1), //马来西亚国旗（长杖）
     Array(1402042, 22, 1, 1), //新加坡国旗（双手剑）
     Array(1412030, 22, 1, 1), //新加坡国旗（双手斧）
     Array(1412031, 22, 1, 1), //马来西亚国旗（双手斧）
     Array(1422034, 22, 1, 1), //新加坡国旗（双手杖）
     Array(1432043, 22, 1, 1), //新加坡国旗（枪）
     Array(1432044, 22, 1, 1), //马来西亚国旗（枪）
     Array(1442058, 22, 1, 1), //新加坡国旗（矛）
     Array(1452049, 22, 1, 1), //新加坡国旗（弓）
     Array(1452050, 22, 1, 1), //马来西亚国旗（弓）
     Array(1442026, 1, 1, 1), //红色冲浪板
     Array(1442027, 1, 1, 1), //绿色冲浪板
     Array(1442028, 1, 1, 1), //蓝色冲浪板
     Array(1442029, 1000, 1, 1), //紫色冲浪板
     Array(1442065, 1000, 1, 1), //蓝色冲浪板
     Array(1442066, 1, 1, 1), //红色冲浪板
     Array(1442069, 1, 1, 1), //红色冲浪板
     Array(1442070, 1, 1, 1), //绿色冲浪板
     Array(1442054, 1000, 1, 1), //红色滑水板
     Array(1442055, 1000, 1, 1), //绿色滑水板
     Array(1442056, 1000, 1, 1), //蓝色滑水板
     Array(1442057, 1, 1, 1), //紫色滑水板
     Array(1432017, 1000, 1, 1), //绿色滑雪板
     Array(1432018, 1000, 1, 1), //蓝色滑雪板
     Array(1432015, 1000, 1, 1), //红色滑雪板
     Array(1432016, 22, 1, 1), //橙色滑雪板
     Array(1442011, 1000, 1, 1), //冲浪板
     Array(1402063, 1000, 1, 1), //樱花伞
     Array(1402037, 1, 1, 1), //龙背
     Array(1402013, 1000, 1, 1), //白日剑
     Array(1442030, 1, 1, 1), //枫之雪板
     Array(1442046, 1, 1, 1), //超级滑雪板
     Array(1442017, 1000, 1, 1), //赤血雪板
     Array(1442039, 1000, 1, 1), //冻冻鱼
     Array(1432182, 1000, 1, 1), //红色之矛(枪)
     Array(1492194, 1000, 1, 1), //红色短枪
     Array(1482183, 1000, 1, 1), //红色拳甲(海盗)
     Array(1382226, 1000, 1, 1), //红色长杖
     Array(1402214, 1000, 1, 1), //红色双手剑
     Array(1452220, 1000, 1, 1), //红色弓
     Array(1462208, 1000, 1, 1), //红色之弩
     Array(1472230, 1000, 1, 1), //红色拳甲(标)
     Array(1332242, 1000, 1, 1), //红色切割者
     Array(1422156, 1000, 1, 1), //红色巨锤
     Array(1353102, 1000, 1, 1), //红色狐狸珠(海盗盾牌)
     //------手套------
     Array(1082145, 1000, 1, 1), //工地手套(黄)
     Array(1082146, 1000, 1, 1), //工地手套(红)
     Array(1082147, 1000, 1, 1), //工地手套(蓝)
     Array(1082148, 1000, 1, 1), //工地手套(紫)
     Array(1082149, 1000, 1, 1), //工地手套(褐)
     Array(1082150, 1000, 1, 1), //工地手套(灰)
     Array(1082002, 1000, 1, 1), //工地手套(白)
     Array(1082175, 1000, 1, 1), //马绍尔手套(赤)
     Array(1082176, 1000, 1, 1), //马绍尔手套(青)
     Array(1082177, 1000, 1, 1), //马绍尔手套(紫
     Array(1082178, 1000, 1, 1), //马绍尔手套(桃)
     Array(1082179, 10, 1, 1), //马绍尔手套(黄)
     //-----耳环-----
     Array(1032032, 1000, 1, 1), //秋叶耳环
     Array(1032035, 1000, 1, 1), //枫叶耳环
     Array(1032040, 1000, 1, 1), //枫叶型耳环
     Array(1032041, 1000, 1, 1), //枫叶型耳环
     Array(1032042, 1000, 1, 1), //枫叶型耳环
     Array(1032030, 1000, 1, 1), //勇气耳环
     //-----卷轴-----
     Array(2040001, 1000, 1, 1), //头盔防御卷轴60%
     Array(2040002, 1000, 1, 1), //头盔防御卷轴10%
     Array(2040004, 1000, 1, 1), //头盔体力卷轴60%
     Array(2040005, 1000, 1, 1), //头盔体力卷轴10%
     Array(2040016, 1000, 1, 1), //头盔命中率卷轴10%
     Array(2040017, 1000, 1, 1), //头盔命中率卷轴60%
     Array(2040025, 1000, 1, 1), //头盔智力卷轴60%
     Array(2040026, 1000, 1, 1), //头盔智力卷轴10%
     Array(2040029, 1000, 1, 1), //头盔敏捷卷轴60%
     Array(2040031, 1000, 1, 1), //头盔敏捷卷轴10%
     Array(2040100, 1000, 1, 1), //脸部装饰生命卷轴10%
     Array(2040101, 1000, 1, 1), //脸部装饰生命卷轴60%
     Array(2040105, 1000, 1, 1), //脸部装饰回避率卷轴10%
     Array(2040106, 1000, 1, 1), //脸部装饰回避率卷轴60%
     Array(2040200, 1000, 1, 1), //眼部装饰命中率卷轴10%
     Array(2040201, 1000, 1, 1), //眼部装饰命中率卷轴60%
     Array(2040205, 1000, 1, 1), //眼部装饰智力卷轴10%
     Array(2040206, 1000, 1, 1), //眼部装饰智力卷轴60%
     Array(2040301, 1000, 1, 1), //耳环智力卷轴60%
     Array(2040302, 1000, 1, 1), //耳环智力卷轴10%
     Array(2040310, 1000, 1, 1), //耳环防御力卷轴10%
     Array(2040317, 1000, 1, 1), //耳环敏捷卷轴60%
     Array(2040318, 1000, 1, 1), //耳环敏捷卷轴10%
     Array(2040321, 1000, 1, 1), //耳环装饰运气卷轴60%
     Array(2040323, 1000, 1, 1), //耳环运气卷轴10%
     Array(2040326, 1000, 1, 1), //耳环装饰体力卷轴60%
     Array(2040328, 1000, 1, 1), //耳环装饰体力卷轴10%
     Array(2040401, 1000, 1, 1), //上衣防御卷轴60%
     Array(2040402, 1000, 1, 1), //上衣防御卷轴10%
     Array(2040412, 1000, 1, 1), //上衣运气卷轴10%
     Array(2040413, 1000, 1, 1), //上衣运气卷轴60%
     Array(2040418, 1000, 1, 1), //上衣力量卷轴60%
     Array(2040419, 1000, 1, 1), //上衣力量卷轴10%
     Array(2040421, 1000, 1, 1), //上衣体力卷轴60%
     Array(2040422, 1000, 1, 1), //上衣体力卷轴10%
     Array(2040425, 1000, 1, 1), //上衣运气卷轴60%
     Array(2040427, 1000, 1, 1), //上衣运气卷轴10%
     Array(2040501, 1000, 1, 1), //全身铠甲敏捷卷轴60%
     Array(2040502, 1000, 1, 1), //全身铠甲敏捷卷轴10%
     Array(2040504, 1000, 1, 1), //全身铠甲防御卷轴60%
     Array(2040505, 1000, 1, 1), //全身铠甲防御卷轴10%
     Array(2040513, 1000, 1, 1), //全身铠甲智力卷轴60%
     Array(2040514, 1000, 1, 1), //全身铠甲智力卷轴10%
     Array(2040516, 1000, 1, 1), //全身铠甲运气卷轴60%
     Array(2040517, 1000, 1, 1), //全身铠甲运气卷轴10%
     Array(2040532, 1000, 1, 1), //全身盔甲力量卷轴60%
     Array(2040534, 1000, 1, 1), //全身盔甲力量卷轴10%
     Array(2040601, 1000, 1, 1), //裤/裙防御卷轴60%
     Array(2040602, 1000, 1, 1), //裤/裙防御卷轴10%
     Array(2040612, 1000, 1, 1), //裤裙敏捷卷轴10%
     Array(2040613, 1000, 1, 1), //裤裙敏捷卷轴60%
     Array(2040618, 1000, 1, 1), //裤裙跳跃卷轴60%
     Array(2040619, 1000, 1, 1), //裤裙跳跃卷轴10%
     Array(2040621, 1000, 1, 1), //裤裙体力卷轴60%
     Array(2040622, 1000, 1, 1), //裤裙体力卷轴10%
     Array(2040625, 1000, 1, 1), //裤裙敏捷卷轴60%
     Array(2040627, 1000, 1, 1), //裤裙敏捷卷轴10%
     Array(2040701, 1000, 1, 1), //鞋子敏捷度卷轴60%
     Array(2040702, 1000, 1, 1), //鞋子敏捷度卷轴10%
     Array(2040704, 1000, 1, 1), //鞋子跳跃卷轴60%
     Array(2040705, 1000, 1, 1), //鞋子跳跃卷轴10%
     Array(2040707, 1000, 1, 1), //鞋子速度卷轴60%
     Array(2040708, 1000, 1, 1), //鞋子速度卷轴10%
     Array(2040727, 1000, 1, 1), //鞋子防滑卷轴10%
     Array(2040801, 1000, 1, 1), //手套敏捷卷轴60%
     Array(2040802, 1000, 1, 1), //手套敏捷卷轴10%
     Array(2040804, 1000, 1, 1), //手套攻击卷轴60%
     Array(2040805, 1000, 1, 1), //手套攻击卷轴10%
     Array(2040816, 1000, 1, 1), //手套魔力卷轴10%
     Array(2040817, 1000, 1, 1), //手套魔力卷轴60%
     Array(2040824, 1000, 1, 1), //手套体力卷轴60%
     Array(2040825, 1000, 1, 1), //手套体力卷轴10%
     Array(2040901, 1000, 1, 1), //盾牌防御卷轴60%
     Array(2040902, 1000, 1, 1), //盾牌防御卷轴10%
     Array(2040914, 1000, 1, 1), //盾牌攻击卷轴60%
     Array(2040915, 1000, 1, 1), //盾牌攻击卷轴10%
     Array(2040919, 1000, 1, 1), //盾牌魔力卷轴60%
     Array(2040920, 1000, 1, 1), //盾牌魔力卷轴10%
     Array(2040924, 1000, 1, 1), //盾牌运气卷轴60%
     Array(2040925, 1000, 1, 1), //盾牌运气卷轴10%
     Array(2040927, 1000, 1, 1), //盾牌体力卷轴60%
     Array(2040928, 1000, 1, 1), //盾牌体力卷轴10%
     Array(2040931, 1000, 1, 1), //盾牌力量卷轴60%
     Array(2040933, 1000, 1, 1), //盾牌力量卷轴10%
     Array(2041001, 1000, 1, 1), //披风魔防卷轴60%
     Array(2041002, 1000, 1, 1), //披风魔防卷轴10%
     Array(2041004, 1000, 1, 1), //披风防御卷轴60%
     Array(2041005, 1000, 1, 1), //披风防御卷轴10%
     Array(2041007, 1000, 1, 1), //披风体力卷轴60%
     Array(2041008, 1000, 1, 1), //披风体力卷轴10%
     Array(2041010, 1000, 1, 1), //披风魔力卷轴60%
     Array(2041011, 1000, 1, 1), //披风魔力卷轴10%
     Array(2041013, 1000, 1, 1), //披风力量卷轴60%
     Array(2041014, 1000, 1, 1), //披风力量卷轴10%
     Array(2041016, 1000, 1, 1), //披风智力卷轴60%
     Array(2041017, 1000, 1, 1), //披风智力卷轴10%
     Array(2041019, 1000, 1, 1), //披风敏捷卷轴60%
     Array(2041020, 1000, 1, 1), //披风敏捷卷轴10%
     Array(2041022, 1000, 1, 1), //披风运气卷轴60%
     Array(2041023, 1000, 1, 1), //披风运气卷轴10%
     Array(2041058, 1000, 1, 1), //披风防寒卷轴10%
     Array(2041201, 1000, 1, 1), //项链运气卷轴10%
     Array(2041202, 1000, 1, 1), //项链运气卷轴60%
     Array(2041206, 1000, 1, 1), //项链力量卷轴10%
     Array(2041207, 1000, 1, 1), //项链力量卷轴60%
     /*
     Array(2041301, 1000, 1, 1), //腰带力量卷轴60%
     Array(2041304, 1000, 1, 1), //腰带智力卷轴60%
     Array(2041307, 1000, 1, 1), //腰带敏捷卷轴60%
     Array(2041310, 1000, 1, 1), //腰带运气卷轴60%
     */
    /*Array(2043001, 1000, 1, 1), //单手剑攻击卷轴60%
     Array(2043002, 1000, 1, 1), //单手剑攻击卷轴10%
     Array(2043008, 1000, 1, 1), //单手剑魔力卷轴10%
     Array(2043009, 1000, 1, 1), //单手剑魔力卷轴60%
     Array(2043017, 1000, 1, 1), //单手剑命中率卷轴60%
     Array(2043019, 1000, 1, 1), //单手剑命中率卷轴10%
     Array(2043101, 1000, 1, 1), //单手斧攻击卷轴60%
     Array(2043102, 1000, 1, 1), //单手斧攻击卷轴10%
     Array(2043112, 1000, 1, 1), //单手斧命中率卷轴60%
     Array(2043114, 1000, 1, 1), //单手斧命中率卷轴10%
     Array(2043201, 1000, 1, 1), //单手钝器攻击卷轴60%
     Array(2043202, 1000, 1, 1), //单手钝器攻击卷轴10%
     Array(2043212, 1000, 1, 1), //单手钝器命中率卷轴60%
     Array(2043214, 1000, 1, 1), //单手钝器命中率卷轴10%
     Array(2043301, 1000, 1, 1), //短剑攻击卷轴60%
     Array(2043302, 1000, 1, 1), //短剑攻击卷轴10%
     Array(2043701, 1000, 1, 1), //短杖魔力卷轴60%
     Array(2043702, 1000, 1, 1), //短杖魔力卷轴10%
     Array(2043801, 1000, 1, 1), //长杖魔力卷轴60%
     Array(2043802, 1000, 1, 1), //长杖魔力卷轴10%
     Array(2044001, 1000, 1, 1), //双手剑攻击卷轴60%
     Array(2044002, 1000, 1, 1), //双手剑攻击卷轴10%
     Array(2044012, 1000, 1, 1), //双手剑命中率卷轴60%
     Array(2044014, 1000, 1, 1), //双手剑命中率卷轴10%
     Array(2044101, 1000, 1, 1), //双手斧攻击卷轴60%
     Array(2044102, 1000, 1, 1), //双手斧攻击卷轴10%
     Array(2044112, 1000, 1, 1), //双手斧命中率卷轴60%
     Array(2044114, 1000, 1, 1), //双手斧命中率卷轴10%
     Array(2044201, 1000, 1, 1), //双手钝器攻击卷轴60%
     Array(2044202, 1000, 1, 1), //双手钝器攻击卷轴10%
     Array(2044212, 1000, 1, 1), //双手钝器命中率卷轴60%
     Array(2044214, 1000, 1, 1), //双手钝器命中率卷轴10%
     Array(2044301, 1000, 1, 1), //枪攻击卷轴60%
     Array(2044302, 1000, 1, 1), //枪攻击卷轴10%
     Array(2044312, 1000, 1, 1), //枪命中率卷轴60%
     Array(2044314, 1000, 1, 1), //枪命中率卷轴10%
     Array(2044401, 1000, 1, 1), //矛攻击卷轴60%
     Array(2044402, 1000, 1, 1), //矛攻击卷轴10%
     Array(2044412, 1000, 1, 1), //矛命中率卷轴60%
     Array(2044414, 1000, 1, 1), //矛命中率卷轴10%
     Array(2044501, 1000, 1, 1), //弓攻击卷轴60%
     Array(2044502, 1000, 1, 1), //弓攻击卷轴10%
     Array(2044601, 1000, 1, 1), //弩攻击卷轴60%
     Array(2044602, 1000, 1, 1), //弩攻击卷轴10%
     Array(2044701, 1000, 1, 1), //拳套攻击卷轴60%
     Array(2044702, 1000, 1, 1), //拳套攻击卷轴10%
     Array(2044801, 1000, 1, 1), //拳甲攻击卷轴60%
     Array(2044802, 1000, 1, 1), //拳甲攻击卷轴10%
     Array(2044807, 1000, 1, 1), //拳甲命中率卷轴60%
     Array(2044809, 1000, 1, 1), //拳甲命中率卷轴10%
     Array(2044901, 1000, 1, 1), //短枪攻击卷轴60%
     Array(2044902, 1000, 1, 1), //短枪攻击卷轴10%
     //诅咒卷
     Array(2044004, 1000, 1, 1), //双手剑攻击诅咒卷轴
     Array(2044005, 1000, 1, 1), //双手剑攻击诅咒卷轴
     Array(2044105, 1000, 1, 1), //双手斧攻击诅咒卷轴
     Array(2044104, 1000, 1, 1), //双手斧攻击诅咒卷轴
     Array(2044305, 1000, 1, 1), //枪攻击诅咒卷轴
     Array(2044304, 1000, 1, 1), //枪攻击诅咒卷轴
     Array(2043004, 1000, 1, 1), //单手剑攻击诅咒卷轴
     Array(2043005, 1000, 1, 1), //单手剑攻击诅咒卷轴
     Array(2043006, 1000, 1, 1), //单手剑魔力诅咒卷轴70%
     Array(2043007, 1000, 1, 1), //单手剑魔力诅咒卷轴30%
     Array(2040921, 1000, 1, 1), //盾牌魔力诅咒卷轴70%。
     Array(2040922, 1000, 1, 1), //盾牌魔力诅咒卷轴30%
     Array(2040917, 1000, 1, 1), //盾牌攻击诅咒卷轴30%
     Array(2040916, 1000, 1, 1), //盾牌攻击诅咒卷轴70%
     Array(2040904, 1000, 1, 1), //盾牌防御诅咒卷轴
     Array(2040905, 1000, 1, 1), //盾牌防御诅咒卷轴
     Array(2040814, 1000, 1, 1), //手套魔力诅咒卷轴
     Array(2040815, 1000, 1, 1), //手套魔力诅咒卷轴
     Array(2040811, 1000, 1, 1), //手套攻击诅咒卷轴
     Array(2040810, 1000, 1, 1), //手套攻击诅咒卷轴
     Array(2040808, 1000, 1, 1), //手套敏捷诅咒卷轴
     Array(2040508, 1000, 1, 1), //全身铠甲敏捷诅咒卷轴
     Array(2040509, 1000, 1, 1), //全身铠甲敏捷诅咒卷轴
     Array(2040511, 1000, 1, 1), //全身铠甲防御诅咒卷轴
     Array(2040510, 1000, 1, 1), //全身铠甲防御诅咒卷轴
     Array(2040411, 1000, 1, 1), //上衣运气诅咒卷轴30%
     Array(2040410, 1000, 1, 1), //上衣运气诅咒卷轴70%
     Array(2040405, 1000, 1, 1), //上衣防御诅咒卷轴
     Array(2040404, 1000, 1, 1), //上衣防御诅咒卷轴
     Array(2043304, 1000, 1, 1), //短剑攻击诅咒卷轴
     Array(2043305, 1000, 1, 1), //短剑攻击诅咒卷轴
     Array(2040712, 1000, 1, 1), //鞋子敏捷诅咒卷轴
     Array(2040713, 1000, 1, 1), //鞋子敏捷诅咒卷轴
     Array(2040715, 1000, 1, 1), //鞋子跳跃诅咒卷轴
     Array(2040714, 1000, 1, 1), //鞋子跳跃诅咒卷轴
     Array(2040717, 1000, 1, 1), //鞋子速度诅咒卷轴
     Array(2040716, 1000, 1, 1), //鞋子速度诅咒卷轴
     Array(2043205, 1000, 1, 1), //单手钝器攻击诅咒卷轴
     Array(2043204, 1000, 1, 1), //单手钝器攻击诅咒卷轴
     Array(2040611, 1000, 1, 1), //裤裙敏捷诅咒卷轴30%
     Array(2040610, 1000, 1, 1), //裤裙敏捷诅咒卷轴70%
     Array(2040609, 1000, 1, 1), //裤裙体力诅咒卷轴
     Array(2040608, 1000, 1, 1), //裤裙体力诅咒卷轴
     Array(2040607, 1000, 1, 1), //裤裙跳跃诅咒卷轴
     Array(2040606, 1000, 1, 1), //裤裙跳跃诅咒卷轴
     Array(2040605, 1000, 1, 1), //裤/裙防御诅咒卷轴
     Array(2040604, 1000, 1, 1), //裤/裙防御诅咒卷轴
     Array(2043105, 1000, 1, 1), //单手斧攻击诅咒卷轴
     Array(2043104, 1000, 1, 1), //单手斧攻击诅咒卷轴
     Array(2043805, 1000, 1, 1), //长杖魔力诅咒卷轴
     Array(2043804, 1000, 1, 1), //长杖魔力诅咒卷轴
     Array(2044504, 1000, 1, 1), //弓攻击诅咒卷轴
     Array(2044505, 1000, 1, 1), //弓攻击诅咒卷轴
     Array(2040109, 1000, 1, 1), //脸部装饰回避诅咒卷轴70%
     Array(2040104, 1000, 1, 1), //脸部装饰生命诅咒卷轴70%
     Array(2040103, 1000, 1, 1), //脸部装饰生命诅咒卷轴30%
     Array(2040108, 1000, 1, 1), //脸部装饰回避诅咒卷轴30%
     Array(2044405, 1000, 1, 1), //矛攻击诅咒卷轴
     Array(2044404, 1000, 1, 1), //矛攻击诅咒卷轴
     Array(2040014, 1000, 1, 1), //头盔命中诅咒卷轴70%
     Array(2040015, 1000, 1, 1), //头盔命中诅咒卷轴30%
     Array(2040010, 1000, 1, 1), //头盔体力诅咒卷轴
     Array(2040011, 1000, 1, 1), //头盔体力诅咒卷轴
     Array(2040008, 1000, 1, 1), //头盔防御诅咒卷轴
     Array(2040009, 1000, 1, 1), //头盔防御诅咒卷轴
     Array(2043705, 1000, 1, 1), //短杖魔力诅咒卷轴
     Array(2043704, 1000, 1, 1), //短杖魔力诅咒卷轴
     Array(2040304, 1000, 1, 1), //耳环智力诅咒卷轴
     Array(2040305, 1000, 1, 1), //耳环智力诅咒卷轴
     Array(2044705, 1000, 1, 1), //拳套攻击诅咒卷轴
     Array(2044704, 1000, 1, 1), //拳套攻击诅咒卷轴
     Array(2040308, 1000, 1, 1), //耳环防御力诅咒卷轴70%
     Array(2040309, 1000, 1, 1), //耳环防御力诅咒卷轴30%
     Array(2044604, 1000, 1, 1), //弩攻击诅咒卷轴
     Array(2044605, 1000, 1, 1), //弩攻击诅咒卷轴
     Array(2040208, 1000, 1, 1), //眼部装饰智力诅咒卷轴30%
     Array(2040209, 1000, 1, 1), //眼部装饰智力诅咒卷轴70%
     Array(2040204, 1000, 1, 1), //眼部装饰命中诅咒卷轴70%
     Array(2040203, 1000, 1, 1), //眼部装饰命中诅咒卷轴30%
     Array(2041038, 1000, 1, 1), //披风敏捷诅咒卷轴
     Array(2041039, 1000, 1, 1), //披风敏捷诅咒卷轴
     Array(2041036, 1000, 1, 1), //披风智力诅咒卷轴
     Array(2041037, 1000, 1, 1), //披风智力诅咒卷轴
     Array(2041034, 1000, 1, 1), //披风力量诅咒卷轴
     Array(2041035, 1000, 1, 1), //披风力量诅咒卷轴
     Array(2041032, 1000, 1, 1), //披风魔力诅咒卷轴
     Array(2041033, 1000, 1, 1), //披风魔力诅咒卷轴
     Array(2041030, 1000, 1, 1), //披风体力诅咒卷轴
     Array(2041031, 1000, 1, 1), //披风体力诅咒卷轴
     Array(2041029, 1000, 1, 1), //披风防御诅咒卷轴
     Array(2041026, 1000, 1, 1), //披风魔防诅咒卷轴
     Array(2041027, 1000, 1, 1), //披风魔防诅咒卷轴
     Array(2041028, 1000, 1, 1), //披风防御诅咒卷轴
     Array(2041040, 1000, 1, 1), //披风运气诅咒卷轴
     Array(2041041, 1000, 1, 1), //披风运气诅咒卷轴
     Array(2041209, 1000, 1, 1), //项链力量诅咒卷轴30%
     Array(2041210, 1000, 1, 1), //项链力量诅咒卷轴70%
     Array(2041204, 1000, 1, 1), //项链运气诅咒卷轴30%
     Array(2041205, 1000, 1, 1) //项链运气诅咒卷轴70%*/
);


var itemList =
    Array(
        /*Array(1102042,1000,1,1),//浪人披风(紫)
         Array(1102041,1000,1,1),//浪人披风(粉)
         Array(1102084,1000,1,1),//粉红盖亚披风
         Array(1102084, 1000, 1, 1), //粉红盖亚披风
         Array(2070006, 1000, 1, 1), //齿轮镖
         Array(2070007, 1000, 1, 1), //月牙镖

         Array(1092049, 1000, 1, 1), //热情剑盾
         Array(1122130,1000,1,1),//冒险之心
         Array(1012070,1000,1,1),//雪糕+攻
         Array(1002939,1000,1,1),  //安全帽
         Array(1402037,500,1,1),//龙背刃
         Array(1382047,800,1,1),  //冰灵珠长杖
         Array(1382045,800,1,1),  //火灵珠长杖
         Array(1382046,800,1,1),  //毒灵珠长杖4031997
         Array(1382048,800,1,1),  //雷灵珠长杖
         Array(1132257,1000,1,1),//腰带
         Array(1012015, 1000, 1, 1), //圣诞鹿的鼻子G
         Array(1102163,1000,1,1),//贵族披风1002939*/
        Array(4031997, 1, 1, 1),//蘑菇
        Array(1102042, 60, 1, 1),//浪人披风(紫)
        Array(1102041, 60, 1, 1),//浪人披风(粉)
        Array(1102084, 60, 1, 1),//粉红盖亚披风
        Array(1102163, 20, 1, 1),//贵族披风
        Array(1002939, 50, 1, 1),//安全帽
        Array(1122130, 50, 1, 1),//冒险之心
        Array(1122017, 5, 1, 1),//精灵吊坠
        //Array(1002357,60,1,1),//扎昆头盔
        //Array(1122000,10,1,1),//黑龙项链
        //Array(1022144,5,1,1),//眼饰
        //Array(1012474,5,1,1),//脸饰
        Array(1092030, 160, 1, 1),//枫叶盾
        Array(1092029, 160, 1, 1),//电磁盾
        Array(1092021, 160, 1, 1),//光子盾
        Array(1092008, 160, 1, 1),//锅盖
        Array(1132257, 20, 1, 1),//腰带
        //Array(1482012,100,1,1),  //拳甲1492012
        //Array(1492012,100,1,1),  //手枪
        Array(1092022, 160, 1, 1),//调色板盾牌
//Array(1092050, 30, 1, 1), //冷艳剑盾
//Array(1092049, 25, 1, 1), //热情剑盾
        Array(1012070, 20, 1, 1),//雪糕+攻
        Array(1012071, 100, 1, 1),//雪糕全属性
        Array(1012058, 200, 1, 1), //匹诺曹的鼻子
        Array(1012059, 200, 1, 1), //匹诺曹的鼻子
        Array(1012060, 100, 1, 1), //匹诺曹的鼻子
        Array(1012061, 200, 1, 1), //匹诺曹的鼻子
        Array(1012011, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012012, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012013, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012014, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012015, 150, 1, 1), //圣诞鹿的鼻子
        Array(1012016, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012017, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012018, 200, 1, 1), //圣诞鹿的鼻子
        Array(1012019, 200, 1, 1), //圣诞鹿的鼻子


//飞侠
        Array(2070006, 60, 1, 1),  //齿轮
        Array(2070007, 60, 1, 1),  //月牙
        Array(2070005, 130, 1, 1),  //金钱
        Array(2070004, 380, 1, 1),//黑色刺
        Array(2070010, 380, 1, 1),//冰凌
        //Array(1472033,80,1,1),  //虎纹拳套
        //Array(1472031,100,1,1),  //龙之拳
        //Array(1332027,100,1,1),  //飞羽刃
        //Array(1332052,100,1,1),  //阴风碎魂刃
        //Array(1472029,180,1,1),  //黑闪电甲
        //Array(1472025,100,1,1),  //黑战神拳套
        //Array(1082144,180,1,1),  //幻光手套
        //Array(1040118,100,1,1),  //红扣带护甲
        //Array(1060107,180,1,1),  //红色霹雳裤
        //Array(1050099,180,1,1),  //黑侠盗服
//战士
        //Array(1402037,1,1,1),//龙背刃
        //Array(1402063,80,1,1),//樱花伞
        //Array(1432011,100,1,1),  //寒冰破魔枪
        //Array(1432030,80,1,1),  //红莲
        //Array(1402016,100,1,1),  //所罗门
        //Array(1302023,100,1,1),  //六脉神剑
        //Array(1302056,100,1,1),  //一刀两断
        //Array(1422013,100,1,1),  //狮子之魂
        //Array(1402035,80,1,1),  //斩天刀
        //Array(1402005,100,1,1),  //斩魔刀
        //Array(1312015,100,1,1),  //战魂之斧
        //Array(1422027,100,1,1),  //泰坦之锤
        //Array(1402012,100,1,1),  //霸王剑
        //Array(1422009,200,1,1),  //妖精之锤
        //Array(1092027,150,1,1),  //银圣十字盾
        //Array(1002532,100,1,1),  //黑色格莱西头盔
        //Array(1072222,100,1,1),  //龙纹战靴

//法师
        //	Array(1372041,10,1,1),  //寒冰之杖
        //	Array(1372032,10,1,1),  //佘太君龙杖
        //	Array(1382047,30,1,1),  //冰灵珠长杖
        //	Array(1372037,100,1,1),  //冰灵珠短杖
        //	Array(1372039,10,1,1),  //爆炎之杖
        //	Array(1382045,30,1,1),  //火灵珠长杖
        //	Array(1372035,100,1,1),  //火灵珠短杖
        //	Array(1372040,10,1,1),  //剧毒之杖
        //	Array(1382046,30,1,1),  //毒灵珠长杖
        //	Array(1372036,100,1,1),  //毒灵珠短杖
        //	Array(1372042,10,1,1),  //狂雷之杖
        //	Array(1382048,30,1,1),  //雷灵珠长杖
        //	Array(1372038,100,1,1),  //雷灵珠短杖
        //	Array(1372010,80,1,1),  //嗜魂
        //	Array(1382035,80,1,1),  //冰肌玲珑
        //	Array(1372009,100,1,1),  //慈悲为怀
        Array(1372016, 150, 1, 1),  //凤凰短杖
        Array(1002253, 200, 1, 1),  //蓝神圣之冠
        Array(1050074, 150, 1, 1),  //黑神仙服
        //Array(1051097,150,1,1),  //黑祭司长袍
        //Array(1072209,100,1,1),  //杰斯特鞋
        //Array(1050105,100,1,1),  //灰幻魔长袍

//弓箭手
        Array(1462018, 100, 1, 1),  //红炎机神弩
        Array(1452017, 100, 1, 1),  //魔翼之弓
        //Array(1452019,100,1,1),  //天鹰白
        //	Array(1452021,100,1,1),  //天鹰黑
        //Array(1462017,100,1,1),  //黑暗圣瑶弩
        //Array(1452011,100,1,1),  //黄神弓
        //Array(1072205,150,1,1),  //夜精灵靴
        //Array(1050108,150,1,1),  //红飞羽服

        Array(1032080, 250, 1, 1),//一代不速之客耳环
        Array(1132036, 250, 1, 1),//一代不速之客腰带
        Array(1122081, 250, 1, 1),//一代不速之客项链
        Array(1032081, 110, 1, 1),//二代不速之客耳环
        Array(1132037, 110, 1, 1),//二代不速之客腰带
        Array(1122082, 100, 1, 1),//二代不速之客项链
        Array(1302143, 250, 1, 1),//一代不速之客单手剑
        Array(1312058, 250, 1, 1),//一代不速之客单手斧
        Array(1322086, 250, 1, 1),//一代不速之客单手钝器
        Array(1332121, 250, 1, 1),//一代不速之客短剑-力
        Array(1332116, 250, 1, 1),//一代不速之客短剑-运
        Array(1372074, 250, 1, 1),//一代不速之客短杖
        Array(1382095, 250, 1, 1),//一代不速之客长杖
        Array(1402086, 250, 1, 1),//一代不速之客双手剑
        Array(1412058, 250, 1, 1),//一代不速之客双手斧
        Array(1422059, 250, 1, 1),//一代不速之客双手钝器
        Array(1442107, 250, 1, 1),//一代不速之客矛
        Array(1452102, 250, 1, 1),//一代不速之客弓
        Array(1462087, 250, 1, 1),//一代不速之客弩
        Array(1472113, 250, 1, 1),//一代不速之客拳套


        //Array(5000016,30,1,1),//云豹
        //Array(4031559,100,1,1),//汉斯邮票
        //Array(4031560,100,1,1),//达鲁克邮票
        //Array(4031558,100,1,1),//武术教练邮票
        //Array(4031561,100,1,1),//赫丽娜邮票
        //Array(4251200,10,1,1),//下等五彩水晶
        //Array(4251201,10,1,1),//中等五彩水晶
        //Array(4251202,10,1,1),//高等五彩水晶4004000
        //Array(4004000,1000,1,1),//矿
        //Array(4004001,1000,1,1),//矿
        //Array(4004002,1000,1,1),//矿
        //Array(4004003,1000,1,1),//矿
        //Array(4004004,700,1,1),//矿4031179
        Array(4031179, 380, 1, 1),//D片
        Array(4001017, 380, 1, 1),//火眼
        Array(2340000, 300, 1, 1),//祝福卷轴
        Array(2049000, 380, 1, 1),//白衣卷轴
        Array(2049001, 350, 1, 1),//白衣卷轴
        Array(2049002, 250, 1, 1),//白衣卷轴
        Array(2049100, 380, 1, 1),//浑沌卷轴
        Array(2040914, 50, 1, 1),//盾牌攻击卷轴
        Array(2040915, 50, 1, 1),//头盔攻击卷轴
        Array(2040025, 50, 1, 1),//盾牌攻击卷轴  2040919
        Array(2040919, 100, 1, 1),//盾牌moli卷轴  2040919
        Array(2040920, 100, 1, 1),//盾牌moli卷轴  2040919
        Array(2040804, 50, 1, 1),//手攻10
        Array(2040805, 80, 1, 1),//手攻60
        Array(2040816, 50, 1, 1),//手攻10
        Array(2040817, 80, 1, 1),//手攻60
        Array(2040026, 100, 1, 1),//腰带力量卷轴
        Array(2041302, 10, 1, 1),
        Array(2041301, 100, 1, 1),//腰带敏捷卷轴
        Array(2041307, 10, 1, 1),
        Array(2041308, 10, 1, 1),
        Array(2041304, 100, 1, 1),//腰带智力卷轴
        Array(2041305, 10, 1, 1),
        Array(2041310, 100, 1, 1),//腰带运气卷轴
        Array(2041311, 10, 1, 1),
        Array(1002513, 100, 1, 1),//周年纪念帽
        Array(1002930, 100, 1, 1),//周年纪念帽
        Array(1003104, 100, 1, 1),//周年纪念帽
        Array(1032026, 10, 1, 1),//黄水晶
        Array(1032028, 200, 1, 1),//红水晶
        Array(1002419, 400, 1, 1),//枫叶帽
        Array(1002510, 400, 1, 1),//枫叶头盔30级
        Array(1002511, 400, 1, 1),//枫叶头盔70级
        Array(1002758, 200, 1, 1),//枫叶头盔90级

        Array(1002677, 200, 1, 1),//玩具匠人帽
        //Array(1002798,1000,1,1),//年糕1002798
        Array(1002743, 150, 1, 1),//海洋之帽

        //Array(1002391,1000,1,1),//海盗头巾(绿)
        //Array(1002392,1000,1,1),//海盗头巾(红)
        //Array(1002393,1000,1,1),//海盗头巾(粉)
        //Array(1002394,1000,1,1),//海盗头巾(灰)
        //Array(1002395,1000,1,1),//海盗头巾(紫)
        //Array(1002585,1000,1,1),//蓝色烤栗贩帽子
        //Array(1002586,1000,1,1),//紫色烤栗贩帽子
        //Array(1002587,1000,1,1),//黑色烤栗贩帽子
        //Array(1082002,1000,1,1),//工地手套
        //Array(1082145,500,1,1),//工地手套(黄)
        //Array(1082146,500,1,1),//工地手套(红)
        //Array(1082147,500,1,1),//工地手套(蓝)
        //Array(1082148,500,1,1),//工地手套(紫)
        //Array(1082149,500,1,1),//工地手套(褐)
        //Array(1082150,300,1,1),//工地手套(灰)1472063
//-------武器-------

        Array(1302030, 350, 1, 1), //枫叶剑
        Array(1302035, 350, 1, 1), //1302035 枫叶旗
        Array(1422029, 350, 1, 1), //1332025 枫叶刃
        Array(1332025, 350, 1, 1), //1382012 枫叶杖
        Array(1412011, 350, 1, 1),//1412011 枫叶斧
        Array(1422014, 350, 1, 1),//1422014 枫叶锤
        Array(1432012, 350, 1, 1),//1432012 枫叶枪
        Array(1442024, 350, 1, 1),//1442024 枫叶矛
        Array(1452022, 350, 1, 1),//1452022 枫叶弓
        Array(1462019, 350, 1, 1),//1462019 枫叶弩
        Array(1472032, 350, 1, 1),//1472032 枫叶拳
        Array(1472030, 350, 1, 1),//1472030 小枫叶拳
        Array(1482020, 350, 1, 1),//1482020 枫叶指节
        Array(1492020, 350, 1, 1),//1492020 枫叶枪

        Array(1432182, 350, 1, 1), //红色之矛(枪)
        Array(1492194, 350, 1, 1), //红色短枪
        Array(1482183, 350, 1, 1), //红色拳甲(海盗)
        Array(1382226, 350, 1, 1), //红色长杖
        Array(1402214, 350, 1, 1), //红色双手剑
        Array(1452220, 350, 1, 1), //红色弓
        Array(1462208, 350, 1, 1), //红色之弩
        Array(1472230, 350, 1, 1), //红色拳甲(标)
        Array(1332242, 350, 1, 1), //红色切割者
        Array(1422156, 350, 1, 1), //红色巨锤
        Array(1322054, 250, 1, 1), //枫叶地震锤
        Array(1412027, 250, 1, 1), //枫叶乾坤轮
        Array(1422029, 250, 1, 1), //枫叶轰天镗
        Array(1442051, 250, 1, 1), //枫叶战斧
        Array(1432040, 220, 1, 1),//枫叶钻天枪
        Array(1302064, 220, 1, 1),//枫叶突击剑
        Array(1402039, 220, 1, 1),//枫叶枭首剑
        Array(1382039, 220, 1, 1),//枫叶丹心杖
        Array(1452045, 220, 1, 1),//枫叶happy弓
        Array(1462040, 250, 1, 1),//枫叶击星弩
        Array(1472055, 220, 1, 1),//枫叶定天拳
        Array(1332056, 220, 1, 1),//枫叶追魂刺
        Array(1472063, 300, 1, 1),//魔法手套
        Array(1102040, 300, 1, 1),//浪人披风(黄)
        Array(1102043, 300, 1, 1),//浪人披风(褐)
        Array(1102085, 380, 1, 1),//黄色盖亚披风
        Array(1102086, 100, 1, 1),//紫色色盖亚披风

        //Array(1102079,1000,1,1),//破旧的红色披风
        //Array(1102081,1000,1,1),//破旧的黄色披风
        //Array(1102082,500,1,1),//破旧的黑色披风
        //Array(1102211,1000,1,1),//战神的披风
        //Array(1072262,500,1,1),//黑色桃乐斯皮鞋
        //Array(1072264,500,1,1),//银色桃乐斯皮鞋
        //Array(1072369,300,1,1),//1072369绿水灵鞋子

        Array(1012072, 385, 1, 1),//雪糕垃圾
        Array(1012073, 385, 1, 1),//雪糕垃圾
        Array(1022060, 100, 1, 1),//狐猴
        Array(1022067, 100, 1, 1),//黑狐猴
        Array(1012056, 100, 1, 1),//狗狗鼻子1012056
        Array(1012161, 166, 1, 1),//发光的鼻子
        Array(1022066, 385, 1, 1),//蓝海星眼镜
        Array(1050100, 50, 1, 1),//浴袍1050100
        Array(1050127, 50, 1, 1),//浴袍1050100
        Array(1051098, 50, 1, 1),//浴袍1050100
        Array(1051140, 50, 1, 1),//浴袍1050100

        Array(1322021, 385, 1, 1),//游泳圈
        Array(1322022, 385, 1, 1),//游泳圈
        Array(1322023, 385, 1, 1),//游泳圈
        Array(1322024, 300, 1, 1),//游泳圈
        Array(1322025, 300, 1, 1),//游泳圈
        Array(1322026, 280, 1, 1),//游泳圈
        //Array(1442054,600,1,1),//滑板
        Array(1442055, 300, 1, 1),//滑板
        Array(1442056, 300, 1, 1),//滑板
        Array(1442057, 300, 1, 1),//滑板

        Array(1432016, 300, 1, 1),//滑板1432016
        Array(1432017, 300, 1, 1),//滑板1432016
        Array(1432018, 300, 1, 1),//滑板1432016
        Array(1442012, 300, 1, 1),//雪板0
        Array(1442013, 385, 1, 1),//雪板12
        Array(1442014, 385, 1, 1),//雪板24
        Array(1442015, 385, 1, 1),//雪板36
        Array(1442016, 300, 1, 1),//雪板48
        Array(1442017, 300, 1, 1),//雪板60
        Array(1442046, 300, 1, 1),//超级滑板
        Array(1442021, 385, 1, 1),//黄拖把
        Array(1442022, 385, 1, 1),//白拖把
        Array(1442023, 385, 1, 1),//黑拖把
        //Array(2070004,2000,1,1),//经验书2370008
        //Array(2370009,2000,1,1),//经验书2370008
        //Array(2370010,2000,1,1),//经验书2370008
        //Array(2370011,2000,1,1),//经验书2370008
        //Array(2370012,2000,1,1),//经验书2370008
        Array(2370000, 100, 1, 1),//经验书10W
        Array(2370001, 110, 1, 1),//经验书5W
        Array(2370002, 150, 1, 1),//经验书3W
        Array(2370003, 200, 1, 1),//经验书2W
        Array(2370004, 300, 1, 1),//经验书
        //Array(2370005,2000,1,1),//经验书
        //Array(2370006,2000,1,1),//经验书
        //Array(2370007,2000,1,1),//经验书
        //Array(1302037,100,1,1),//小号
        Array(5390006, 300, 1, 1),//咆哮喇叭5390006
        Array(5390000, 300, 1, 1),//喇叭5390006
        Array(5390001, 300, 1, 1),//喇叭5390006
        Array(5390002, 300, 1, 1),//喇叭5390006
        Array(5390003, 300, 1, 1),//喇叭5390006
        Array(5390004, 300, 1, 1),//喇叭5390006
        Array(5390005, 300, 1, 1),//喇叭5390006

        Array(1072238, 100, 1, 1),//紫色钉鞋
        Array(1072239, 100, 1, 1),//黄色钉鞋
        Array(1002663, 385, 1, 1),//可乐帽子
        Array(1302063, 50, 1, 1),//燃烧的火焰刀
        Array(1302106, 50, 1, 1),//燃烧的冰焰刀
        Array(1302080, 100, 1, 1),//冒险岛小灯泡
        Array(1302085, 100, 1, 1),//叉子
        Array(1302087, 200, 1, 1),//火炬
        Array(1382015, 150, 1, 1),//毒蘑菇
        Array(1382016, 150, 1, 1),//香菇
        Array(1402044, 300, 1, 1),//南瓜灯笼
        Array(1302061, 100, 1, 1),//蔓藤鞭子
        Array(1422030, 300, 1, 1),//粉红海豹抱枕
        Array(1422031, 300, 1, 1),//蓝色海豹抱枕
        Array(1432046, 300, 1, 1),//圣诞树手杖
        Array(1432013, 100, 1, 1),//南瓜枪
        Array(1302024, 385, 1, 1),//废报纸武器
        Array(1322051, 300, 1, 1),//七夕
        Array(1402014, 30, 1, 1),//温度计
        Array(1402029, 100, 1, 1),//鬼刺狼牙棒
        Array(1422011, 300, 1, 1),//酒瓶
        Array(1332053, 385, 1, 1),//野外烧烤
        Array(1372017, 100, 1, 1),//领路灯
        Array(5570000, 100, 1, 1),//金锤子
        Array(1422036, 100, 1, 1),//玩具锤子
        Array(1302021, 385, 1, 1),//玩具锤子1302021
        Array(1322027, 300, 1, 1),//平底锅
        Array(1442039, 300, 1, 1),//冻冻鱼
        Array(1302019, 200, 1, 1),//无名剑
        Array(1332021, 300, 1, 1),//乌龙茶
        //Array(1302128,1000,1,1),//火柴
        //Array(1302084,1000,1,1),//火柴
        Array(1402013, 100, 1, 1),//白日剑
        Array(1302036, 300, 1, 1),//枫叶小旗
        Array(1302049, 100, 1, 1),//光线鞭
        Array(1302001, 385, 1, 1),//锯子
        Array(1312012, 385, 1, 1),//呼啦圈
        Array(1322006, 385, 1, 1),//钢管
        Array(1422011, 300, 1, 1),//清酒
        Array(1432039, 100, 1, 1),//钓鱼竿
        //御守
        Array(2022219, 300, 1, 1),//蝙蝠怪御守
        Array(2022223, 200, 1, 1),//扎昆御守
        Array(2022220, 150, 1, 1),//星光精灵御守
        Array(2022216, 200, 1, 1),//蘑菇王御守
        Array(2022217, 100, 1, 1),//皮亚奴斯御守
        Array(2022218, 200, 1, 1),//帕普拉图斯御守
        Array(2022245, 80, 1, 1),//心跳停止糖
//点装
        Array(1050293, 170, 1, 1),//海滩帅锅装
        Array(1004640, 170, 1, 1),//怪物联盟棒球帽
        Array(1052634, 170, 1, 1),//简洁白衬衫
        Array(1051409, 170, 1, 1),//闪亮艾斯女孩
        Array(1042078, 170, 1, 1),//水手服
        Array(1052998, 170, 1, 1),//外星人连身衣
        Array(1052224, 170, 1, 1),//草莓baby装
        Array(1042198, 170, 1, 1),//彩虹t恤
        Array(1042204, 170, 1, 1),//汉堡t恤
        Array(1052056, 170, 1, 1),//韩国足球服
        Array(1702625, 170, 1, 1),//爱情蓝鸟武器
        Array(1702589, 170, 1, 1),//樱花物语
        Array(1702375, 170, 1, 1),//亚特兰蒂斯
        Array(1702457, 170, 1, 1),//冬天里的雪糕
        Array(1042104, 170, 1, 1),//小绿叶T恤
        Array(1042105, 170, 1, 1),//小红叶T恤
        Array(1012131, 170, 1, 1),//好白的牙齿
        Array(1042142, 170, 1, 1),//彩虹条背心
        Array(1062093, 170, 1, 1),//嫩绿休闲短裤
        Array(1702611, 170, 1, 1),//小鸭单肩包
        Array(1004636, 170, 1, 1),//香蕉郊游帽
        Array(1042349, 170, 1, 1),//黑色摇滚连帽衫
        //Array(1012049,170,1,1),//怪物面具
        Array(1702660, 170, 1, 1),//调皮雪人武器
        Array(1702640, 170, 1, 1),//兔儿雪绒绒
        Array(1082592, 170, 1, 1),//焰鬼隐布
        Array(1102066, 170, 1, 1),//邪魔披风
        Array(1052948, 170, 1, 1),//奥尔卡的睡袍
        //Array(1004540,170,1,1),//奥尔卡的睡帽
        Array(1052951, 170, 1, 1),//波点连身裙
        Array(1102778, 170, 1, 1),//棒棒糖披风
        Array(1102142, 170, 1, 1),//火焰披风
        Array(1102749, 170, 1, 1),//五彩星星气球
        Array(1102754, 170, 1, 1),//群鸟之星
        Array(1102755, 170, 1, 1),//星光点点气球
        //Array(1102756,170,1,1),//微笑玉米斗篷
        Array(1102757, 170, 1, 1),//巴尼兔心形气球
        Array(1102808, 170, 1, 1),//啵啵鼠气球
        Array(1102692, 170, 1, 1),//小小寿司团
        Array(1102688, 170, 1, 1),//双色砰砰炮
        Array(1102682, 170, 1, 1),//未来天使注射器
        Array(1102684, 170, 1, 1),//未来医生听诊器
        Array(1102676, 170, 1, 1),//摇摆猫咪酱
        Array(1102220, 170, 1, 1),//小绵羊披风
        Array(1102665, 170, 1, 1),//狐狸围脖
        Array(1102605, 170, 1, 1),//暗炎赎罪者
        Array(1072484, 170, 1, 1),//黑猫拖鞋
        Array(1072258, 170, 1, 1),//白猫拖鞋
        Array(1072337, 170, 1, 1),//喜羊羊拖
        Array(1082312, 170, 1, 1),//彩虹护腕
        Array(1082493, 170, 1, 1),//海豹白白手套
        Array(1082581, 170, 1, 1),//巧克力发带装饰
        Array(1082549, 170, 1, 1),//咯咯嗒手套
        Array(1082503, 170, 1, 1),//圣洁天使手镯
        Array(1082548, 170, 1, 1),//星星手镯

        Array(1112907, 170, 1, 1),//小鱼戒指
        Array(1112273, 170, 1, 1),//小黄鸭聊天戒指
        Array(1112161, 170, 1, 1),//小黄鸭名片
        Array(1112271, 170, 1, 1),//非洲之星聊天
        Array(1112159, 170, 1, 1),//非洲之星名片
        Array(1112120, 170, 1, 1),//可乐名片
        Array(1112230, 170, 1, 1),//可乐聊天
        Array(1112253, 170, 1, 1),//木乃伊聊天
        Array(1112142, 170, 1, 1),//木乃伊名片
        Array(1112257, 170, 1, 1),//浪漫花边聊天
        Array(1112145, 170, 1, 1),//浪漫花边名片
        Array(1112258, 170, 1, 1),//青苹果之恋聊天
        Array(1112146, 170, 1, 1),//青苹果之恋名片
        Array(1112237, 170, 1, 1),//小竹林聊天
        Array(1112134, 170, 1, 1),//小竹林名片
        Array(1112174, 170, 1, 1),//足球名片
        Array(1112286, 170, 1, 1),//足球聊天
        Array(1112288, 170, 1, 1),//旋律音符聊天
        Array(1112178, 170, 1, 1),//梦幻雪景名片
        Array(1112290, 170, 1, 1),//梦幻雪景聊天
        Array(1112179, 170, 1, 1),//雪花圣诞名片
        Array(1112291, 170, 1, 1),//雪花圣诞聊天
        Array(1112165, 170, 1, 1),//绿光森林名片
        Array(1112277, 170, 1, 1),//绿光森林聊天
        Array(1112262, 170, 1, 1),//天使降临聊天
        Array(1112150, 170, 1, 1),//天使降临名片戒指
        Array(1112176, 170, 1, 1),//旋律音符名片戒指
        Array(1112184, 170, 1, 1),//富豪泰格尔名片戒指
        Array(1112191, 170, 1, 1),//蜜蜂名片戒指
        Array(1112192, 170, 1, 1),//菠萝甜心名片戒指
        Array(1112197, 170, 1, 1),//晚安小怪兽名片戒指
        //Array(1112808,170,1,1),//钻石聊天戒指
        Array(1112210, 170, 1, 1),//黄金聊天戒指
        Array(1112218, 170, 1, 1),//小熊猫聊天戒指
        Array(1112103, 170, 1, 1),//嫩黄名片戒指

        Array(1004530, 170, 1, 1),//蓝色熊猫玩偶帽子
        Array(1004532, 170, 1, 1),//女皇关注
        Array(1004533, 170, 1, 1),//兰儿在游戏！
        Array(1004505, 170, 1, 1),//粉红樱花丝带
        Array(1004488, 170, 1, 1),//治愈之丝带
        Array(1004486, 170, 1, 1),//春之主人
        Array(1004467, 170, 1, 1),//特大爱心宽檐帽
        Array(1004468, 170, 1, 1),//小小训练师帽
        Array(1004454, 170, 1, 1),//狸猫帽子
        Array(1004414, 170, 1, 1),//热腾腾包子帽
        Array(1004328, 170, 1, 1),//粉色棒球帽
        Array(1004156, 170, 1, 1),//来这星星的你
        Array(1004108, 170, 1, 1),//幻夜蝶华礼帽

        //Array(4000487,30,1,1),//暗影币
        Array(5150038, 50, 1, 1),//超级明星5000016
        Array(5150040, 100, 1, 1),//皇家1032026

        Array(1702246, 150, 1, 1),//幽魂武器
        Array(1702248, 150, 1, 1),//圣诞鹿武器
        Array(1702278, 150, 1, 1),//枫之武器
        Array(1702305, 150, 1, 1),//胡萝卜武器
        Array(1702335, 150, 1, 1),//炼金师的武器
        Array(1702392, 150, 1, 1),//黑暗小恶魔武器
        Array(1702393, 150, 1, 1),//蛇年武器
        Array(1702372, 150, 1, 1),//圣杯武器
        Array(1702408, 150, 1, 1),//纪念日专用武器
        Array(1702401, 150, 1, 1),//兔子胡萝卜武器
        Array(1702459, 150, 1, 1),//棉花糖武器
        Array(1702460, 150, 1, 1),//星星武器
        Array(1702499, 150, 1, 1),//林之灵武器
        Array(1702550, 150, 1, 1),//桃太郎武器
        Array(1702538, 150, 1, 1),//露珠武器
        Array(1702508, 150, 1, 1),//草莓牛奶武器
        Array(1702588, 150, 1, 1),//黑猫玩具武器
        Array(1702598, 150, 1, 1),//枫叶武器
        Array(1702597, 150, 1, 1),//彩虹贝壳武器
        Array(1702579, 150, 1, 1),//水晶喵喵武器
        Array(1702576, 150, 1, 1),//啪嗒啪嗒打糕武器
        Array(1702660, 150, 1, 1),//调皮雪人武器
        Array(1702669, 150, 1, 1),//公主日记武器
        Array(1702617, 150, 1, 1),//幻想莲花武器
        Array(1702637, 150, 1, 1),//音乐律动武器箱
        Array(1702625, 150, 1, 1),//爱情蓝鸟武器
        //Array(1472063,100,1,1),//魔法手套
        //Array(1062073,300,1,1),//特别南瓜裤(米)点
        //Array(1062074,300,1,1),//特别南瓜裤(黑褐)点
//-----椅子-----
        Array(3010838, 30, 1, 1),//冰城堡
        Array(3010835, 100, 1, 1),//爱情水晶球记忆椅子
        Array(3010832, 10, 1, 1),//太阳
        Array(3010831, 50, 1, 1),//海王星
        Array(3010830, 60, 1, 1),//天王星
        Array(3010829, 30, 1, 1),//土星
        Array(3010828, 40, 1, 1),//木星
        Array(3010827, 70, 1, 1),//火星
        Array(3010826, 80, 1, 1),//地球
        Array(3010825, 90, 1, 1),//金星
        Array(3010824, 80, 1, 1),//水星
        Array(3010823, 100, 1, 1), //蘑菇智能手表
        Array(3010822, 100, 1, 1), //贪吃鳄鱼
        Array(3010821, 100, 1, 1), //童年玩具箱
        Array(3010109, 200, 1, 1), //暖炉椅
        Array(3010080, 200, 1, 1), //柿子树
        Array(3010112, 385, 1, 1),
        Array(3010125, 80, 1, 1), //尼贝龙战舰椅子
        Array(3010124, 80, 1, 1), //都纳斯喷气椅子
        Array(3010120, 100, 1, 1), //彩蛋篮子
        Array(3010093, 100, 1, 1), //鲜美的火鸡
        Array(3010075, 50, 1, 1), //我为音乐狂
        Array(3010212, 100, 1, 1), //藏獒椅子
        Array(3010462, 200, 1, 1), //天文台
        Array(3010412, 200, 1, 1), //双塔
        Array(3010149, 200, 1, 1), //风扇
        Array(3015428, 200, 1, 1), //和猴子一起放烟花椅子
        Array(3010795, 200, 1, 1), //森林中休息处
        Array(3010206, 300, 1, 1), //梦想画家椅子
        Array(3015225, 20, 1, 1), //和大象一起自拍椅子
        Array(3010976, 80, 1, 1), //为我加油！椅子
        Array(3010999, 80, 1, 1), //主人请用餐椅子
        Array(3010804, 200, 1, 1), //军人月妙拜年椅子
        Array(3010899, 200, 1, 1), //摆钟椅子
        Array(3015120, 100, 1, 1), //枕头大战
        Array(3010043, 100, 1, 1),//魔女的飞扫把
        Array(3015051, 10, 1, 1),//巨无霸国际巨星
        Array(3015183, 10, 1, 1),//绿水灵背景椅子
        Array(3015096, 10, 1, 1),//羊羊幻想牧场椅子
        Array(3010180, 385, 1, 1),//HP椅子
        Array(3010009, 10, 1, 1),//粉色爱心马桶
        Array(3010028, 100, 1, 1),//老海盗椅子
        Array(3012006, 50, 1, 1),//风吹稻香
        Array(3010013, 10, 1, 1),//悠长假期
        Array(3010034, 10, 1, 1),//悠长假期
        Array(3010035, 10, 1, 1),//悠长假期
        Array(3010029, 180, 1, 1), //蓝环凳
        Array(3010030, 180, 1, 1), //黑环凳
        Array(3010031, 180, 1, 1), //红环凳
        Array(3010032, 180, 1, 1), //黄环凳
        Array(3010033, 180, 1, 1), //绿环凳
        Array(3010037, 180, 1, 1), //猪猪凳
        Array(3010014, 380, 1, 1),//月亮弯
        Array(3010018, 380, 1, 1),//椰子树沙滩椅
        Array(3010025, 380, 1, 1),//枫叶纪念凳
        Array(3012001, 380, 1, 1),//篝火
        Array(3012002, 100, 1, 1),//浴桶---
        Array(3010073, 50, 1, 1),//PB克缤
        Array(3010049, 50, 1, 1),//雪房子
        Array(3010068, 50, 1, 1),//露水椅子
        Array(3010070, 10, 1, 1),//巨无霸品克缤
        Array(3010095, 100, 1, 1),//石头人座椅
//-----后期植入椅子-----
        Array(3010898, 100, 1, 1),//迷你神兽椅子
        Array(3015304, 10, 1, 1), //哗啦啦大水车
        Array(3010465, 100, 1, 1),//可爱音符椅子
        Array(3010460, 100, 1, 1),//爆竹椅子
        Array(3010450, 100, 1, 1),//艾莉珍椅子
        Array(3010455, 100, 1, 1),//扎昆的帝王椅子
        Array(3010456, 100, 1, 1),//杜鹃花椅子
        Array(3010458, 100, 1, 1),//翻滚兔子椅子
        Array(3010863, 50, 1, 1),//愤怒的美发师椅子
        Array(3010447, 100, 1, 1),//睡觉小鸟椅子
        Array(3010446, 100, 1, 1),//皮肤皇后椅子
        Array(3010448, 100, 1, 1),//泡泡浴椅子
        Array(3010434, 100, 1, 1),//热带夏日椅子
        Array(3010428, 100, 1, 1),//水晶椅子
        Array(3010409, 100, 1, 1),//粽子椅子
        Array(3010094, 100, 1, 1),//漂漂猪椅子-----------------------
        Array(3010411, 100, 1, 1),//鱼尾狮椅子
        Array(3010085, 50, 1, 1),//鬼娃娃椅子
        Array(3010077, 100, 1, 1),//猫头鹰椅子
        Array(3010053, 50, 1, 1),//兔子纪念版椅子
        Array(3010151, 200, 1, 1),//无人岛椅子
        Array(3015415, 50, 1, 1),//猴子椅子
        Array(3010142, 50, 1, 1),//水族馆椅子
        Array(3010144, 100, 1, 1),//七夕椅子
        Array(3015430, 100, 1, 1),//年兽椅子
        Array(3010117, 100, 1, 1),//魔法书椅子
        Array(3015424, 100, 1, 1),//超级饺子椅子
        Array(3015428, 100, 1, 1),//和猴子一起放烟花椅子
        Array(3015427, 100, 1, 1),//和猴子一起玩麻将椅子
        Array(3010804, 100, 1, 1),//军人月妙拜年椅子
        Array(3015045, 50, 1, 1),//羊绒咩咩椅子--------------
        Array(3010375, 50, 1, 1),//奥妙的超级药水椅子
        Array(3015057, 50, 1, 1),//烟花绽放椅子
        Array(3010373, 50, 1, 1),//云朵洗手间椅子
        Array(3010799, 100, 1, 1),//坟墓幽灵椅子
        Array(3010737, 50, 1, 1),//动物英雄团椅子
        Array(3010734, 100, 1, 1),//猫箱椅子
        Array(3010738, 50, 1, 1),//闪电三人组椅子
        Array(3010740, 100, 1, 1),//圣诞树椅子
        Array(3010365, 100, 1, 1),//休彼德蔓的古代石掌椅子
        Array(3010306, 100, 1, 1),//生如夏花椅子
        Array(3010301, 50, 1, 1),//高级HP药水椅子
        Array(3010188, 100, 1, 1),//班·雷昂椅子
        Array(3010186, 100, 1, 1),//兔子椅子
        Array(3010184, 50, 1, 1),//冰钓椅子
        Array(3010173, 50, 1, 1),//万圣节塔罗椅子
        Array(3010175, 50, 1, 1),//名画家椅子
        Array(3010195, 100, 1, 1),//无价之宝椅子
        Array(3010210, 100, 1, 1),//草莓冰淇淋月饼椅子--------------
        Array(3010224, 250, 1, 1),//年糕冰淇淋椅子
        Array(3010036, 50, 1, 1),//浪漫秋千
        Array(3010044, 50, 1, 1),//同一红伞下
        Array(3010111, 100, 1, 1),//虎虎生威
        Array(3010115, 100, 1, 1),//熊宝宝床
        Array(3010126, 50, 1, 1),//蝙蝠魔王座
        Array(3010313, 50, 1, 1),//粉红扎昆椅子
        Array(3010128, 50, 1, 1),//黑龙王座
        Array(3010133, 100, 1, 1),//帐篷椅
        Array(3010152, 200, 1, 1),//黄三角帐篷椅
        Array(3010291, 100, 1, 1),//早日康复床
        Array(3010172, 100, 1, 1),//星空椅子
        Array(3010168, 100, 1, 1),//友谊万岁椅子
        Array(3010185, 100, 1, 1),//小伙伴品克缤
        Array(3010622, 100, 1, 1),//我的好友丹珍之椅
        Array(3010453, 100, 1, 1),//兔子乘风椅
        Array(3010493, 100, 1, 1),//那就是我--------------------------------
        Array(3010527, 100, 1, 1),//深海章鱼
        Array(3010531, 100, 1, 1),//小企鹅合唱团
        Array(3010565, 100, 1, 1),//我的女皇椅子
        Array(3010587, 100, 1, 1),//时间胶囊
        Array(3010609, 100, 1, 1),//不是在做梦
        Array(3010608, 100, 1, 1),//完美的名画椅子
        Array(3010661, 100, 1, 1),//欢乐相框椅子
        Array(3010678, 100, 1, 1),//海加顿之安息
        Array(3010739, 100, 1, 1),//雪人香波椅子
        Array(3010744, 100, 1, 1),//冒险岛的砖头朋友们
        Array(3010752, 100, 1, 1),//玫瑰鸟笼
        Array(3010756, 100, 1, 1),//新年招财猫椅子
        Array(3010767, 100, 1, 1),//雪人椅子
        Array(3010760, 100, 1, 1),//古代浴池椅子
        Array(3010795, 100, 1, 1),//森林中休息处
        Array(3010806, 100, 1, 1),//桃樱芳菲椅
        Array(3010848, 100, 1, 1),//红地毯主人公椅子
        Array(3012024, 100, 1, 1),//沙滩排球椅子
        Array(1142073, 150, 1, 1), //-----勋章-----
        Array(1142075, 150, 1, 1), //
        Array(1142654, 150, 1, 1), //
        Array(1142650, 150, 1, 1), //
        Array(1142443, 150, 1, 1), //
        Array(1142360, 150, 1, 1), //
        Array(1142119, 150, 1, 1), //
        Array(1142101, 150, 1, 1), //
        Array(1142120, 150, 1, 1), //
        Array(1142081, 150, 1, 1), //
        Array(1142118, 150, 1, 1), //
        Array(1142114, 150, 1, 1), //
        Array(1142076, 150, 1, 1), //
        Array(1142116, 150, 1, 1), //
        Array(1142115, 150, 1, 1), //
        Array(1142082, 150, 1, 1), //
        Array(1142117, 150, 1, 1), //
        Array(1142113, 150, 1, 1), //
        Array(1142112, 150, 1, 1), //
        Array(1142006, 150, 1, 1), //
        Array(1142231, 150, 1, 1), //
        Array(1142233, 150, 1, 1), //
        Array(1142230, 150, 1, 1), //
        Array(1142232, 150, 1, 1) //
        /*Array(
         Array(1002418, 1000, 1, 1), //废报纸头盔
         Array(1002419, 1000, 1, 1), //枫叶帽
         Array(1002424, 1000, 1, 1), //红马术帽
         Array(1002425, 1000, 1, 1), //蓝马术帽
         Array(1002554, 1000, 1, 1), //武艺头绳
         Array(1002677, 1000, 1, 1), //玩具匠人帽
         Array(1002699, 1000, 1, 1), //南瓜帽子
         Array(1002441, 1000, 1, 1), //热血头带
         Array(1002508, 1000, 1, 1), //枫叶头盔
         Array(1002509, 1000, 1, 1), //枫叶头盔
         Array(1002510, 1000, 1, 1), //枫叶头盔
         Array(1002511, 1000, 1, 1), //枫叶头盔
         Array(1002391, 1000, 1, 1), //海盗头巾(绿)
         Array(1002392, 1000, 1, 1), //海盗头巾(红)
         Array(1002393, 1000, 1, 1), //海盗头巾(粉)
         Array(1002394, 1000, 1, 1), //海盗头巾(灰)
         Array(1002395, 1000, 1, 1), //海盗头巾(紫)
         Array(1002894, 1000, 1, 1), //粉色编织发带
         Array(1002895, 1000, 1, 1), //红色编织发带
         Array(1002896, 1000, 1, 1), //紫色编织发带
         Array(1002897, 1000, 1, 1), //橙色编织发带
         Array(1002898, 1000, 1, 1), //绿色编织发带
         Array(1002899, 1000, 1, 1), //黄色编织发带
         Array(1002900, 1000, 1, 1), //蓝色编织发带
         //------脸饰------
         Array(1012056, 1000, 1, 1), //狗狗鼻
         Array(1022047, 1000, 1, 1), //猫头鹰
         Array(1012058, 1000, 1, 1), //匹诺曹的鼻子
         Array(1012059, 1000, 1, 1), //匹诺曹的鼻子
         Array(1012060, 1000, 1, 1), //匹诺曹的鼻子
         Array(1012061, 1000, 1, 1), //匹诺曹的鼻子
         Array(1122001, 1000, 1, 1), //绿色蝶形领结
         Array(1122002, 1000, 1, 1), //红色蝶形领结
         Array(1122003, 1000, 1, 1), //黄色蝶形领结
         Array(1122004, 1000, 1, 1), //粉红蝶形领结
         Array(1122005, 1000, 1, 1), //黑色蝶形领结
         Array(1122006, 1000, 1, 1), //蓝色蝶形领结
         Array(1012477, 1, 1, 1), //甜瓜味雪糕
         Array(1012420, 1, 1, 1), //水果草莓味雪糕
         Array(1012419, 1000, 1, 1), //甜瓜味雪糕
         Array(1012417, 1, 1, 1), //巧克力雪糕
         Array(1012418, 1000, 1, 1), //西瓜味雪糕
         Array(1012416, 1, 1, 1), //草莓雪糕
         Array(1012073, 1000, 1, 1), //西瓜雪糕
         Array(1012071, 1000, 1, 1), //巧克力雪糕
         Array(1012072, 1000, 1, 1), //甜瓜雪糕
         Array(1012070, 1, 1, 1), //草莓雪糕
         //------吊坠------
         Array(1122015, 1000, 1, 1), //枫叶围巾
         Array(1122074, 1000, 1, 1), //枫叶吊坠
         //------盾牌------
         Array(1092022, 1000, 1, 1), //调色板盾牌
         Array(1092050, 1, 1, 1), //冷艳剑盾
         Array(1092049, 1, 1, 1), //热情剑盾
         //------椅子------
         Array(3015304, 1, 1, 1), //哗啦啦大水车
         Array(3015051, 1000, 1, 1), //巨无霸国际巨星
         Array(3010070, 1000, 1, 1), //巨无霸品克缤
         Array(3015172, 1, 1, 1), //幻想牧场椅子
         Array(3015173, 1, 1, 1), //夏日美梦椅子
         Array(3010999, 1, 1, 1), //主人请用餐椅子
         Array(3010976, 1, 1, 1), //为我加油！椅子
         Array(3015225, 1, 1, 1), //和大象一起自拍椅子
         Array(3010206, 1, 1, 1), //梦想画家椅子
         Array(3010151, 1, 1, 1), //无人岛椅子
         Array(3010848, 1, 1, 1), //红地毯主人公椅子
         Array(3010044, 1000, 1, 1), //同一红伞下
         Array(3010036, 1000, 1, 1), //浪漫秋千
         Array(3010879, 1000, 1, 1), //繁星椅子
         Array(3010199, 1000, 1, 1), //雪房子
         Array(3010795, 1000, 1, 1), //森林中休息处
         Array(3010494, 1000, 1, 1), //TV椅子
         Array(3010490, 1000, 1, 1), //红色大象
         Array(3010465, 1000, 1, 1), //可爱音符椅子
         Array(3010460, 1000, 1, 1), //红色爆竹
         Array(3010450, 1000, 1, 1), //艾莉珍椅子
         Array(3010447, 1000, 1, 1), //睡觉小鸟
         Array(3010448, 1000, 1, 1), //泡泡浴椅子
         Array(3010440, 1000, 1, 1), //寻找故乡的月妙椅子
         Array(3010431, 1000, 1, 1), //夏日喵喵椅子
         Array(3015041, 1000, 1, 1), //舒适大白熊椅子
         Array(3010374, 1000, 1, 1), //闪耀星星之夜椅子
         Array(3010373, 1000, 1, 1), //云朵洗手间椅子
         Array(3015096, 1000, 1, 1), //羊羊幻想牧场椅子
         Array(3010296, 1000, 1, 1), //甜蜜的圣诞椅子
         Array(3012025, 1000, 1, 1), //小鸡弹簧床椅子
         Array(3012024, 1000, 1, 1), //沙滩排球椅子
         Array(3010570, 1000, 1, 1), //迷你神兽椅子
         Array(3010525, 1000, 1, 1), //猫头鹰椅子
         Array(3010544, 1000, 1, 1), //热带夏日椅子
         Array(3010849, 1000, 1, 1), //最佳新人椅子
         Array(3010850, 1000, 1, 1), //潮流评论家椅子
         Array(3010168, 1000, 1, 1), //友谊万岁椅子
         Array(3010142, 1000, 1, 1), //水族馆椅子
         Array(3015428, 1000, 1, 1), //和猴子一起放烟花椅子
         //------披风------
         Array(1102053, 1000, 1, 1), //破披风
         Array(1102166, 1000, 1,1), //枫叶披风
         Array(1102167, 1000, 1, 1), //枫叶披风
         Array(1102168, 1000, 1, 1), //枫叶披风
         Array(1102084, 1000, 1, 1), //粉红盖亚披风
         Array(1092050, 1, 1, 1), //冷艳剑盾
         Array(1092049, 1, 1, 1), //热情剑盾
         Array(1102085, 1000, 1, 1), //黄色盖亚披风
         Array(1102086, 1000, 1, 1), //紫色盖亚披风
         Array(1102041, 1000, 1, 1), //浪人披风(粉)
         Array(1102040, 1000, 1, 1), //浪人披风(黄)
         Array(1102043, 1000, 1, 1), //浪人披风(褐)
         Array(1102042, 1000, 1, 1), //浪人披风(紫)
         Array(2070005, 1000, 1, 1), //金钱镖
         Array(2070006, 1000, 1, 1), //齿轮镖
         Array(2070007, 1000, 1, 1), //月牙镖
         Array(1102084, 1000, 1, 1), //粉红盖亚披风
         Array(1092050, 1, 1, 1), //冷艳剑盾
         Array(1092049, 1, 1, 1), //热情剑盾
         //-------武器------
         Array(1051017, 1000, 1, 1), //红色桑拿服
         Array(1050018, 1000, 1, 1), //蓝色桑拿服
         Array(1372017, 1000, 1, 1), //领路灯
         Array(1302049, 1000, 1, 1), //光线鞭子
         Array(1302021, 1000, 1, 1), //橡皮榔头
         Array(1302022, 1000, 1, 1), //竹刀
         Array(1302024, 1000, 1, 1), //废报纸卷
         Array(1302061, 1000, 1, 1), //蔓藤鞭子
         Array(1302067, 1000, 1, 1), //枫叶庆典旗
         Array(1302080, 1000, 1, 1), //七彩霓虹灯泡
         Array(1302084, 1000, 1, 1), //火柴
         Array(1302085, 1000, 1, 1), //叉子
         Array(1302087, 1000, 1, 1), //火炬
         Array(1312002, 1000, 1, 1), //镰刀
         Array(1312012, 1000, 1, 1), //乾坤圈
         Array(1312013, 1000, 1, 1), //判官笔
         Array(1312014, 1000, 1, 1), //阎王笔
         Array(1402014, 1000, 1, 1), //温度计
         Array(1402029, 1000, 1, 1), //鬼刺狼牙棒
         Array(1322009, 1000, 1, 1), //马桶吸
         Array(1322027, 1000, 1, 1), //米伽勒的平底锅
         Array(1322051, 1000, 1, 1), //七夕
         Array(1322071, 1000, 1, 1), //采矿铁锹
         //Array(1322053, 1, 1, 1), //棒槌
         Array(1332053, 10, 1, 1), //野外烧烤串
         Array(1332054, 22, 1, 1), //闪电飞刀
         Array(1382015, 1000, 1, 1), //毒蘑菇
         Array(1382016, 1, 1, 1), //香菇 ——--高级货
         Array(1402044, 1000, 1, 1), //南瓜灯笼
         Array(1422036, 1000, 1, 1), //玩具匠人的锤子
         Array(1432039, 1000, 1, 1), //钓鱼竿
         Array(1432046, 1000, 1, 1), //圣诞树手杖
         Array(1432048, 10, 1, 1), //铲子
         Array(1442018, 1000, 1, 1), //冻冻鱼
         Array(1442021, 1000, 1, 1), //黄拖把
         Array(1442022, 1000, 1, 1), //白拖把
         Array(1442023, 1000, 1, 1), //黑拖把
         Array(1442004, 1000, 1, 1), //拖把
         Array(1432009, 1000, 1, 1), //木精灵枪
         Array(1432132, 1000, 1, 1), //木精灵枪
         Array(1372031, 1000, 1, 1), //圣贤短杖
         Array(1372033, 1000, 1, 1), //圣贤短杖
         Array(1442121, 1000, 1, 1), //敏捷战士的玫瑰
         Array(1442122, 1000, 1, 1), //恐怖战士的玫瑰
         Array(1442123, 1000, 1, 1), //愤怒战士的玫瑰
         Array(1302017, 1000, 1, 1), //蓝色雨伞
         Array(1302016, 1000, 1, 1), //黄色雨伞
         Array(1302025, 1, 1, 1), //红雨伞
         Array(1302026, 1, 1, 1), //黑雨伞
         Array(1302027, 1000, 1, 1), //绿雨伞
         Array(1302028, 1000, 1, 1), //紫雨伞
         Array(1302029, 1000, 1, 1), //褐雨伞
         Array(1302035, 50, 1, 1), //枫叶旗
         Array(1302036, 50, 1, 1), //枫叶旗
         Array(1302058, 1000, 1, 1), //冒险岛伞
         Array(1302252, 1000, 1, 1), //冒险岛雨伞
         Array(1312033, 50, 1, 1), //枫叶3年旗
         Array(1412028, 50, 1, 1), //枫叶3年旗
         Array(1302066, 50, 1, 1), //枫叶3年旗
         Array(1332057, 50, 1, 1), //枫叶3年旗
         Array(1422032, 50, 1, 1), //枫叶3年旗
         Array(1432041, 50, 1, 1), //枫叶3年旗
         Array(1442052, 50, 1, 1), //枫叶3年旗
         Array(1462041, 50, 1, 1), //枫叶3年旗
         Array(1472056, 50, 1, 1), //枫叶3年旗
         Array(1492034, 50, 1, 1), //枫叶3年旗
         Array(1312034, 1000, 1, 1), //粉色花边游泳圈
         Array(1422033, 1, 1, 1), //粉色花边游泳圈
         Array(1432042, 1, 1, 1), //粉色花边游泳圈
         Array(1332059, 1, 1, 1), //粉色花边游泳圈
         Array(1492026, 1, 1, 1), //粉色花边游泳圈
         Array(1452048, 1, 1, 1), //粉色花边游泳圈
         Array(1302230, 1, 1, 1), //粉色花边游泳圈
         Array(1302075, 22, 1, 1), //新加坡国旗（单手剑）
         Array(1302076, 22, 1, 1), //马来西亚国旗（单手剑）
         Array(1312035, 22, 1, 1), //新加坡国旗（单手斧）
         Array(1312036, 22, 1, 1), //马来西亚国旗（单手斧）
         Array(1322057, 22, 1, 1), //新加坡国旗（单手杖）
         Array(1322058, 22, 1, 1), //马来西亚国旗（单手杖）
         Array(1332060, 22, 1, 1), //新加坡国旗（短剑）
         Array(1332061, 22, 1, 1), //马来西亚国旗（短剑）
         Array(1382043, 22, 1, 1), //新加坡国旗（长杖）
         Array(1382044, 22, 1, 1), //马来西亚国旗（长杖）
         Array(1402042, 22, 1, 1), //新加坡国旗（双手剑）
         Array(1412030, 22, 1, 1), //新加坡国旗（双手斧）
         Array(1412031, 22, 1, 1), //马来西亚国旗（双手斧）
         Array(1422034, 22, 1, 1), //新加坡国旗（双手杖）
         Array(1432043, 22, 1, 1), //新加坡国旗（枪）
         Array(1432044, 22, 1, 1), //马来西亚国旗（枪）
         Array(1442058, 22, 1, 1), //新加坡国旗（矛）
         Array(1452049, 22, 1, 1), //新加坡国旗（弓）
         Array(1452050, 22, 1, 1), //马来西亚国旗（弓）
         Array(1442026, 1, 1, 1), //红色冲浪板
         Array(1442027, 1, 1, 1), //绿色冲浪板
         Array(1442028, 1, 1, 1), //蓝色冲浪板
         Array(1442029, 1000, 1, 1), //紫色冲浪板
         Array(1442065, 1000, 1, 1), //蓝色冲浪板
         Array(1442066, 1, 1, 1), //红色冲浪板
         Array(1442069, 1, 1, 1), //红色冲浪板
         Array(1442070, 1, 1, 1), //绿色冲浪板
         Array(1442054, 1000, 1, 1), //红色滑水板
         Array(1442055, 1000, 1, 1), //绿色滑水板
         Array(1442056, 1000, 1, 1), //蓝色滑水板
         Array(1442057, 1, 1, 1), //紫色滑水板
         Array(1432017, 1000, 1, 1), //绿色滑雪板
         Array(1432018, 1000, 1, 1), //蓝色滑雪板
         Array(1432015, 1000, 1, 1), //红色滑雪板
         Array(1432016, 22, 1, 1), //橙色滑雪板
         Array(1442011, 1000, 1, 1), //冲浪板
         Array(1402063, 1000, 1, 1), //樱花伞
         Array(1402037, 1, 1, 1), //龙背
         Array(1402013, 1000, 1, 1), //白日剑
         Array(1442030, 1, 1, 1), //枫之雪板
         Array(1442046, 1, 1, 1), //超级滑雪板
         Array(1442017, 1000, 1, 1), //赤血雪板
         Array(1442039, 1000, 1, 1), //冻冻鱼
         Array(1432182, 1000, 1, 1), //红色之矛(枪)
         Array(1492194, 1000, 1, 1), //红色短枪
         Array(1482183, 1000, 1, 1), //红色拳甲(海盗)
         Array(1382226, 1000, 1, 1), //红色长杖
         Array(1402214, 1000, 1, 1), //红色双手剑
         Array(1452220, 1000, 1, 1), //红色弓
         Array(1462208, 1000, 1, 1), //红色之弩
         Array(1472230, 1000, 1, 1), //红色拳甲(标)
         Array(1332242, 1000, 1, 1), //红色切割者
         Array(1422156, 1000, 1, 1), //红色巨锤
         Array(1353102, 1000, 1, 1), //红色狐狸珠(海盗盾牌)
         //------手套------
         Array(1082145, 1000, 1, 1), //工地手套(黄)
         Array(1082146, 1000, 1, 1), //工地手套(红)
         Array(1082147, 1000, 1, 1), //工地手套(蓝)
         Array(1082148, 1000, 1, 1), //工地手套(紫)
         Array(1082149, 1000, 1, 1), //工地手套(褐)
         Array(1082150, 1000, 1, 1), //工地手套(灰)
         Array(1082002, 1000, 1, 1), //工地手套(白)
         Array(1082175, 1000, 1, 1), //马绍尔手套(赤)
         Array(1082176, 1000, 1, 1), //马绍尔手套(青)
         Array(1082177, 1000, 1, 1), //马绍尔手套(紫
         Array(1082178, 1000, 1, 1), //马绍尔手套(桃)
         Array(1082179, 10, 1, 1), //马绍尔手套(黄)
         //-----耳环-----
         Array(1032032, 1000, 1, 1), //秋叶耳环
         Array(1032035, 1000, 1, 1), //枫叶耳环
         Array(1032040, 1000, 1, 1), //枫叶型耳环
         Array(1032041, 1000, 1, 1), //枫叶型耳环
         Array(1032042, 1000, 1, 1), //枫叶型耳环
         Array(1032030, 1000, 1, 1), //勇气耳环
         //-----卷轴-----
         Array(2040001, 1000, 1, 1), //头盔防御卷轴60%
         Array(2040002, 1000, 1, 1), //头盔防御卷轴10%
         Array(2040004, 1000, 1, 1), //头盔体力卷轴60%
         Array(2040005, 1000, 1, 1), //头盔体力卷轴10%
         Array(2040016, 1000, 1, 1), //头盔命中率卷轴10%
         Array(2040017, 1000, 1, 1), //头盔命中率卷轴60%
         Array(2040025, 1000, 1, 1), //头盔智力卷轴60%
         Array(2040026, 1000, 1, 1), //头盔智力卷轴10%
         Array(2040029, 1000, 1, 1), //头盔敏捷卷轴60%
         Array(2040031, 1000, 1, 1), //头盔敏捷卷轴10%
         Array(2040100, 1000, 1, 1), //脸部装饰生命卷轴10%
         Array(2040101, 1000, 1, 1), //脸部装饰生命卷轴60%
         Array(2040105, 1000, 1, 1), //脸部装饰回避率卷轴10%
         Array(2040106, 1000, 1, 1), //脸部装饰回避率卷轴60%
         Array(2040200, 1000, 1, 1), //眼部装饰命中率卷轴10%
         Array(2040201, 1000, 1, 1), //眼部装饰命中率卷轴60%
         Array(2040205, 1000, 1, 1), //眼部装饰智力卷轴10%
         Array(2040206, 1000, 1, 1), //眼部装饰智力卷轴60%
         Array(2040301, 1000, 1, 1), //耳环智力卷轴60%
         Array(2040302, 1000, 1, 1), //耳环智力卷轴10%
         Array(2040310, 1000, 1, 1), //耳环防御力卷轴10%
         Array(2040317, 1000, 1, 1), //耳环敏捷卷轴60%
         Array(2040318, 1000, 1, 1), //耳环敏捷卷轴10%
         Array(2040321, 1000, 1, 1), //耳环装饰运气卷轴60%
         Array(2040323, 1000, 1, 1), //耳环运气卷轴10%
         Array(2040326, 1000, 1, 1), //耳环装饰体力卷轴60%
         Array(2040328, 1000, 1, 1), //耳环装饰体力卷轴10%
         Array(2040401, 1000, 1, 1), //上衣防御卷轴60%
         Array(2040402, 1000, 1, 1), //上衣防御卷轴10%
         Array(2040412, 1000, 1, 1), //上衣运气卷轴10%
         Array(2040413, 1000, 1, 1), //上衣运气卷轴60%
         Array(2040418, 1000, 1, 1), //上衣力量卷轴60%
         Array(2040419, 1000, 1, 1), //上衣力量卷轴10%
         Array(2040421, 1000, 1, 1), //上衣体力卷轴60%
         Array(2040422, 1000, 1, 1), //上衣体力卷轴10%
         Array(2040425, 1000, 1, 1), //上衣运气卷轴60%
         Array(2040427, 1000, 1, 1), //上衣运气卷轴10%
         Array(2040501, 1000, 1, 1), //全身铠甲敏捷卷轴60%
         Array(2040502, 1000, 1, 1), //全身铠甲敏捷卷轴10%
         Array(2040504, 1000, 1, 1), //全身铠甲防御卷轴60%
         Array(2040505, 1000, 1, 1), //全身铠甲防御卷轴10%
         Array(2040513, 1000, 1, 1), //全身铠甲智力卷轴60%
         Array(2040514, 1000, 1, 1), //全身铠甲智力卷轴10%
         Array(2040516, 1000, 1, 1), //全身铠甲运气卷轴60%
         Array(2040517, 1000, 1, 1), //全身铠甲运气卷轴10%
         Array(2040532, 1000, 1, 1), //全身盔甲力量卷轴60%
         Array(2040534, 1000, 1, 1), //全身盔甲力量卷轴10%
         Array(2040601, 1000, 1, 1), //裤/裙防御卷轴60%
         Array(2040602, 1000, 1, 1), //裤/裙防御卷轴10%
         Array(2040612, 1000, 1, 1), //裤裙敏捷卷轴10%
         Array(2040613, 1000, 1, 1), //裤裙敏捷卷轴60%
         Array(2040618, 1000, 1, 1), //裤裙跳跃卷轴60%
         Array(2040619, 1000, 1, 1), //裤裙跳跃卷轴10%
         Array(2040621, 1000, 1, 1), //裤裙体力卷轴60%
         Array(2040622, 1000, 1, 1), //裤裙体力卷轴10%
         Array(2040625, 1000, 1, 1), //裤裙敏捷卷轴60%
         Array(2040627, 1000, 1, 1), //裤裙敏捷卷轴10%
         Array(2040701, 1000, 1, 1), //鞋子敏捷度卷轴60%
         Array(2040702, 1000, 1, 1), //鞋子敏捷度卷轴10%
         Array(2040704, 1000, 1, 1), //鞋子跳跃卷轴60%
         Array(2040705, 1000, 1, 1), //鞋子跳跃卷轴10%
         Array(2040707, 1000, 1, 1), //鞋子速度卷轴60%
         Array(2040708, 1000, 1, 1), //鞋子速度卷轴10%
         Array(2040727, 1000, 1, 1), //鞋子防滑卷轴10%
         Array(2040801, 1000, 1, 1), //手套敏捷卷轴60%
         Array(2040802, 1000, 1, 1), //手套敏捷卷轴10%
         Array(2040804, 1000, 1, 1), //手套攻击卷轴60%
         Array(2040805, 1000, 1, 1), //手套攻击卷轴10%
         Array(2040816, 1000, 1, 1), //手套魔力卷轴10%
         Array(2040817, 1000, 1, 1), //手套魔力卷轴60%
         Array(2040824, 1000, 1, 1), //手套体力卷轴60%
         Array(2040825, 1000, 1, 1), //手套体力卷轴10%
         Array(2040901, 1000, 1, 1), //盾牌防御卷轴60%
         Array(2040902, 1000, 1, 1), //盾牌防御卷轴10%
         Array(2040914, 1000, 1, 1), //盾牌攻击卷轴60%
         Array(2040915, 1000, 1, 1), //盾牌攻击卷轴10%
         Array(2040919, 1000, 1, 1), //盾牌魔力卷轴60%
         Array(2040920, 1000, 1, 1), //盾牌魔力卷轴10%
         Array(2040924, 1000, 1, 1), //盾牌运气卷轴60%
         Array(2040925, 1000, 1, 1), //盾牌运气卷轴10%
         Array(2040927, 1000, 1, 1), //盾牌体力卷轴60%
         Array(2040928, 1000, 1, 1), //盾牌体力卷轴10%
         Array(2040931, 1000, 1, 1), //盾牌力量卷轴60%
         Array(2040933, 1000, 1, 1), //盾牌力量卷轴10%
         Array(2041001, 1000, 1, 1), //披风魔防卷轴60%
         Array(2041002, 1000, 1, 1), //披风魔防卷轴10%
         Array(2041004, 1000, 1, 1), //披风防御卷轴60%
         Array(2041005, 1000, 1, 1), //披风防御卷轴10%
         Array(2041007, 1000, 1, 1), //披风体力卷轴60%
         Array(2041008, 1000, 1, 1), //披风体力卷轴10%
         Array(2041010, 1000, 1, 1), //披风魔力卷轴60%
         Array(2041011, 1000, 1, 1), //披风魔力卷轴10%
         Array(2041013, 1000, 1, 1), //披风力量卷轴60%
         Array(2041014, 1000, 1, 1), //披风力量卷轴10%
         Array(2041016, 1000, 1, 1), //披风智力卷轴60%
         Array(2041017, 1000, 1, 1), //披风智力卷轴10%
         Array(2041019, 1000, 1, 1), //披风敏捷卷轴60%
         Array(2041020, 1000, 1, 1), //披风敏捷卷轴10%
         Array(2041022, 1000, 1, 1), //披风运气卷轴60%
         Array(2041023, 1000, 1, 1), //披风运气卷轴10%
         Array(2041058, 1000, 1, 1), //披风防寒卷轴10%
         Array(2041201, 1000, 1, 1), //项链运气卷轴10%
         Array(2041202, 1000, 1, 1), //项链运气卷轴60%
         Array(2041206, 1000, 1, 1), //项链力量卷轴10%
         Array(2041207, 1000, 1, 1), //项链力量卷轴60%
         /*
         Array(2041301, 1000, 1, 1), //腰带力量卷轴60%
         Array(2041304, 1000, 1, 1), //腰带智力卷轴60%
         Array(2041307, 1000, 1, 1), //腰带敏捷卷轴60%
         Array(2041310, 1000, 1, 1), //腰带运气卷轴60%
         */
        /*Array(2043001, 1000, 1, 1), //单手剑攻击卷轴60%
         Array(2043002, 1000, 1, 1), //单手剑攻击卷轴10%
         Array(2043008, 1000, 1, 1), //单手剑魔力卷轴10%
         Array(2043009, 1000, 1, 1), //单手剑魔力卷轴60%
         Array(2043017, 1000, 1, 1), //单手剑命中率卷轴60%
         Array(2043019, 1000, 1, 1), //单手剑命中率卷轴10%
         Array(2043101, 1000, 1, 1), //单手斧攻击卷轴60%
         Array(2043102, 1000, 1, 1), //单手斧攻击卷轴10%
         Array(2043112, 1000, 1, 1), //单手斧命中率卷轴60%
         Array(2043114, 1000, 1, 1), //单手斧命中率卷轴10%
         Array(2043201, 1000, 1, 1), //单手钝器攻击卷轴60%
         Array(2043202, 1000, 1, 1), //单手钝器攻击卷轴10%
         Array(2043212, 1000, 1, 1), //单手钝器命中率卷轴60%
         Array(2043214, 1000, 1, 1), //单手钝器命中率卷轴10%
         Array(2043301, 1000, 1, 1), //短剑攻击卷轴60%
         Array(2043302, 1000, 1, 1), //短剑攻击卷轴10%
         Array(2043701, 1000, 1, 1), //短杖魔力卷轴60%
         Array(2043702, 1000, 1, 1), //短杖魔力卷轴10%
         Array(2043801, 1000, 1, 1), //长杖魔力卷轴60%
         Array(2043802, 1000, 1, 1), //长杖魔力卷轴10%
         Array(2044001, 1000, 1, 1), //双手剑攻击卷轴60%
         Array(2044002, 1000, 1, 1), //双手剑攻击卷轴10%
         Array(2044012, 1000, 1, 1), //双手剑命中率卷轴60%
         Array(2044014, 1000, 1, 1), //双手剑命中率卷轴10%
         Array(2044101, 1000, 1, 1), //双手斧攻击卷轴60%
         Array(2044102, 1000, 1, 1), //双手斧攻击卷轴10%
         Array(2044112, 1000, 1, 1), //双手斧命中率卷轴60%
         Array(2044114, 1000, 1, 1), //双手斧命中率卷轴10%
         Array(2044201, 1000, 1, 1), //双手钝器攻击卷轴60%
         Array(2044202, 1000, 1, 1), //双手钝器攻击卷轴10%
         Array(2044212, 1000, 1, 1), //双手钝器命中率卷轴60%
         Array(2044214, 1000, 1, 1), //双手钝器命中率卷轴10%
         Array(2044301, 1000, 1, 1), //枪攻击卷轴60%
         Array(2044302, 1000, 1, 1), //枪攻击卷轴10%
         Array(2044312, 1000, 1, 1), //枪命中率卷轴60%
         Array(2044314, 1000, 1, 1), //枪命中率卷轴10%
         Array(2044401, 1000, 1, 1), //矛攻击卷轴60%
         Array(2044402, 1000, 1, 1), //矛攻击卷轴10%
         Array(2044412, 1000, 1, 1), //矛命中率卷轴60%
         Array(2044414, 1000, 1, 1), //矛命中率卷轴10%
         Array(2044501, 1000, 1, 1), //弓攻击卷轴60%
         Array(2044502, 1000, 1, 1), //弓攻击卷轴10%
         Array(2044601, 1000, 1, 1), //弩攻击卷轴60%
         Array(2044602, 1000, 1, 1), //弩攻击卷轴10%
         Array(2044701, 1000, 1, 1), //拳套攻击卷轴60%
         Array(2044702, 1000, 1, 1), //拳套攻击卷轴10%
         Array(2044801, 1000, 1, 1), //拳甲攻击卷轴60%
         Array(2044802, 1000, 1, 1), //拳甲攻击卷轴10%
         Array(2044807, 1000, 1, 1), //拳甲命中率卷轴60%
         Array(2044809, 1000, 1, 1), //拳甲命中率卷轴10%
         Array(2044901, 1000, 1, 1), //短枪攻击卷轴60%
         Array(2044902, 1000, 1, 1), //短枪攻击卷轴10%
         //诅咒卷
         Array(2044004, 1000, 1, 1), //双手剑攻击诅咒卷轴
         Array(2044005, 1000, 1, 1), //双手剑攻击诅咒卷轴
         Array(2044105, 1000, 1, 1), //双手斧攻击诅咒卷轴
         Array(2044104, 1000, 1, 1), //双手斧攻击诅咒卷轴
         Array(2044305, 1000, 1, 1), //枪攻击诅咒卷轴
         Array(2044304, 1000, 1, 1), //枪攻击诅咒卷轴
         Array(2043004, 1000, 1, 1), //单手剑攻击诅咒卷轴
         Array(2043005, 1000, 1, 1), //单手剑攻击诅咒卷轴
         Array(2043006, 1000, 1, 1), //单手剑魔力诅咒卷轴70%
         Array(2043007, 1000, 1, 1), //单手剑魔力诅咒卷轴30%
         Array(2040921, 1000, 1, 1), //盾牌魔力诅咒卷轴70%。
         Array(2040922, 1000, 1, 1), //盾牌魔力诅咒卷轴30%
         Array(2040917, 1000, 1, 1), //盾牌攻击诅咒卷轴30%
         Array(2040916, 1000, 1, 1), //盾牌攻击诅咒卷轴70%
         Array(2040904, 1000, 1, 1), //盾牌防御诅咒卷轴
         Array(2040905, 1000, 1, 1), //盾牌防御诅咒卷轴
         Array(2040814, 1000, 1, 1), //手套魔力诅咒卷轴
         Array(2040815, 1000, 1, 1), //手套魔力诅咒卷轴
         Array(2040811, 1000, 1, 1), //手套攻击诅咒卷轴
         Array(2040810, 1000, 1, 1), //手套攻击诅咒卷轴
         Array(2040808, 1000, 1, 1), //手套敏捷诅咒卷轴
         Array(2040508, 1000, 1, 1), //全身铠甲敏捷诅咒卷轴
         Array(2040509, 1000, 1, 1), //全身铠甲敏捷诅咒卷轴
         Array(2040511, 1000, 1, 1), //全身铠甲防御诅咒卷轴
         Array(2040510, 1000, 1, 1), //全身铠甲防御诅咒卷轴
         Array(2040411, 1000, 1, 1), //上衣运气诅咒卷轴30%
         Array(2040410, 1000, 1, 1), //上衣运气诅咒卷轴70%
         Array(2040405, 1000, 1, 1), //上衣防御诅咒卷轴
         Array(2040404, 1000, 1, 1), //上衣防御诅咒卷轴
         Array(2043304, 1000, 1, 1), //短剑攻击诅咒卷轴
         Array(2043305, 1000, 1, 1), //短剑攻击诅咒卷轴
         Array(2040712, 1000, 1, 1), //鞋子敏捷诅咒卷轴
         Array(2040713, 1000, 1, 1), //鞋子敏捷诅咒卷轴
         Array(2040715, 1000, 1, 1), //鞋子跳跃诅咒卷轴
         Array(2040714, 1000, 1, 1), //鞋子跳跃诅咒卷轴
         Array(2040717, 1000, 1, 1), //鞋子速度诅咒卷轴
         Array(2040716, 1000, 1, 1), //鞋子速度诅咒卷轴
         Array(2043205, 1000, 1, 1), //单手钝器攻击诅咒卷轴
         Array(2043204, 1000, 1, 1), //单手钝器攻击诅咒卷轴
         Array(2040611, 1000, 1, 1), //裤裙敏捷诅咒卷轴30%
         Array(2040610, 1000, 1, 1), //裤裙敏捷诅咒卷轴70%
         Array(2040609, 1000, 1, 1), //裤裙体力诅咒卷轴
         Array(2040608, 1000, 1, 1), //裤裙体力诅咒卷轴
         Array(2040607, 1000, 1, 1), //裤裙跳跃诅咒卷轴
         Array(2040606, 1000, 1, 1), //裤裙跳跃诅咒卷轴
         Array(2040605, 1000, 1, 1), //裤/裙防御诅咒卷轴
         Array(2040604, 1000, 1, 1), //裤/裙防御诅咒卷轴
         Array(2043105, 1000, 1, 1), //单手斧攻击诅咒卷轴
         Array(2043104, 1000, 1, 1), //单手斧攻击诅咒卷轴
         Array(2043805, 1000, 1, 1), //长杖魔力诅咒卷轴
         Array(2043804, 1000, 1, 1), //长杖魔力诅咒卷轴
         Array(2044504, 1000, 1, 1), //弓攻击诅咒卷轴
         Array(2044505, 1000, 1, 1), //弓攻击诅咒卷轴
         Array(2040109, 1000, 1, 1), //脸部装饰回避诅咒卷轴70%
         Array(2040104, 1000, 1, 1), //脸部装饰生命诅咒卷轴70%
         Array(2040103, 1000, 1, 1), //脸部装饰生命诅咒卷轴30%
         Array(2040108, 1000, 1, 1), //脸部装饰回避诅咒卷轴30%
         Array(2044405, 1000, 1, 1), //矛攻击诅咒卷轴
         Array(2044404, 1000, 1, 1), //矛攻击诅咒卷轴
         Array(2040014, 1000, 1, 1), //头盔命中诅咒卷轴70%
         Array(2040015, 1000, 1, 1), //头盔命中诅咒卷轴30%
         Array(2040010, 1000, 1, 1), //头盔体力诅咒卷轴
         Array(2040011, 1000, 1, 1), //头盔体力诅咒卷轴
         Array(2040008, 1000, 1, 1), //头盔防御诅咒卷轴
         Array(2040009, 1000, 1, 1), //头盔防御诅咒卷轴
         Array(2043705, 1000, 1, 1), //短杖魔力诅咒卷轴
         Array(2043704, 1000, 1, 1), //短杖魔力诅咒卷轴
         Array(2040304, 1000, 1, 1), //耳环智力诅咒卷轴
         Array(2040305, 1000, 1, 1), //耳环智力诅咒卷轴
         Array(2044705, 1000, 1, 1), //拳套攻击诅咒卷轴
         Array(2044704, 1000, 1, 1), //拳套攻击诅咒卷轴
         Array(2040308, 1000, 1, 1), //耳环防御力诅咒卷轴70%
         Array(2040309, 1000, 1, 1), //耳环防御力诅咒卷轴30%
         Array(2044604, 1000, 1, 1), //弩攻击诅咒卷轴
         Array(2044605, 1000, 1, 1), //弩攻击诅咒卷轴
         Array(2040208, 1000, 1, 1), //眼部装饰智力诅咒卷轴30%
         Array(2040209, 1000, 1, 1), //眼部装饰智力诅咒卷轴70%
         Array(2040204, 1000, 1, 1), //眼部装饰命中诅咒卷轴70%
         Array(2040203, 1000, 1, 1), //眼部装饰命中诅咒卷轴30%
         Array(2041038, 1000, 1, 1), //披风敏捷诅咒卷轴
         Array(2041039, 1000, 1, 1), //披风敏捷诅咒卷轴
         Array(2041036, 1000, 1, 1), //披风智力诅咒卷轴
         Array(2041037, 1000, 1, 1), //披风智力诅咒卷轴
         Array(2041034, 1000, 1, 1), //披风力量诅咒卷轴
         Array(2041035, 1000, 1, 1), //披风力量诅咒卷轴
         Array(2041032, 1000, 1, 1), //披风魔力诅咒卷轴
         Array(2041033, 1000, 1, 1), //披风魔力诅咒卷轴
         Array(2041030, 1000, 1, 1), //披风体力诅咒卷轴
         Array(2041031, 1000, 1, 1), //披风体力诅咒卷轴
         Array(2041029, 1000, 1, 1), //披风防御诅咒卷轴
         Array(2041026, 1000, 1, 1), //披风魔防诅咒卷轴
         Array(2041027, 1000, 1, 1), //披风魔防诅咒卷轴
         Array(2041028, 1000, 1, 1), //披风防御诅咒卷轴
         Array(2041040, 1000, 1, 1), //披风运气诅咒卷轴
         Array(2041041, 1000, 1, 1), //披风运气诅咒卷轴
         Array(2041209, 1000, 1, 1), //项链力量诅咒卷轴30%
         Array(2041210, 1000, 1, 1), //项链力量诅咒卷轴70%
         Array(2041204, 1000, 1, 1), //项链运气诅咒卷轴30%
         Array(2041205, 1000, 1, 1) //项链运气诅咒卷轴70%*/
    );

function start() {
    status = -1;
    action(1, 0, 0);
}

function action(mode, type, selection) {
    if (mode == 1) {
        status++;
    } else {
        if (status == 0) {
            selStr = "#e#r你给我带来了500抵用吗？可以获得心跳般的惊喜哦?\r\n当前抵用:" + cm.getPlayer().getCSPoints(2) + "\r\n#n#k\r\n";
            for (i = 0; i < showList.length; i++) {
                selStr += "#d#v" + showList[i][0] + "#";
            }

            cm.sendOk(selStr);
            cm.dispose();
        }
        status--;
    }
    if (status == 0) {
        selStr = "\r\n";
        for (i = 0; i < itemList.length; i++) {
            selStr += "#d#v" + itemList[i][0] + "#";
        }
        if (cm.getInventory(1).isFull(0)) {//判断第一个也就是装备栏的装备栏是否有一个空格
            cm.sendOk("#b请保证装备栏位至少有1个空格,否则无法抽奖.");
            cm.dispose();
        } else if (cm.getInventory(2).isFull(0)) {//判断第二个也就是消耗栏的装备栏是否有一个空格
            cm.sendOk("#b请保证消耗栏位至少有1个空格,否则无法抽奖.");
            cm.dispose();
        } else if (cm.getInventory(3).isFull(0)) {//判断第三个也就是设置栏的装备栏是否有一个空格
            cm.sendOk("#b请保证设置栏位至少有1个空格,否则无法抽奖.");
            cm.dispose();
        } else if (cm.getInventory(4).isFull(0)) {//判断第四个也就是其它栏的装备栏是否有一个空格
            cm.sendOk("#b请保证其它栏位至少有1个空格,否则无法抽奖.");
            cm.dispose();
        } else if (cm.getInventory(5).isFull(0)) {//判断第五个也就是现金栏的装备栏是否有一个空格
            cm.sendOk("#b请保证现金栏位至少有1个空格,否则无法抽奖.");
            cm.dispose();
        }if (cm.getPlayer().getLevel() < 30) {
            cm.sendOk("你的等级必须达到30级以上.");
            cm.dispose();
        }else if (cm.getPlayer().getCSPoints(2) < 300) {//判断抵用
            cm.sendOk("你确定你有300抵用吗？");
            cm.dispose();
        } else {
            cm.sendYesNo("#r如果你有300点抵用交给我，可以随即抽取各种好礼,惊喜多多,不容错过!\r\n当前已经抽奖了：" + cm.getPlayer().getOneTimeLog("choujiang") + "次！每满200次必定抽出好东西\r\n#g确认抽取？" + selStr);
        }
    } else if (status == 1) {
        if (cm.getPlayer().getOneTimeLog("choujiang") == 200 || cm.getPlayer().getOneTimeLog("choujiang") == 400 || cm.getPlayer().getOneTimeLog("choujiang") == 600 || cm.getPlayer().getOneTimeLog("choujiang") == 800 || cm.getPlayer().getOneTimeLog("choujiang") == 1000 || cm.getPlayer().getOneTimeLog("choujiang") == 1200 || cm.getPlayer().getOneTimeLog("choujiang") == 1400 || cm.getPlayer().getOneTimeLog("choujiang") == 1600 || cm.getPlayer().getOneTimeLog("choujiang") == 1800 || cm.getPlayer().getOneTimeLog("choujiang") == 2000 || cm.getPlayer().getOneTimeLog("choujiang") == 2200) {
            itemList = Array();//清空现在数组东西
            itemList = 高级数组;//数组加入新东西
        }
        var ii = MapleItemInformationProvider.getInstance();
        var chance = Math.floor(Math.random() * 500);
        var finalitem = Array();
        for (var i = 0; i < itemList.length; i++) {
            if (itemList[i][1] >= chance) {
                finalitem.push(itemList[i]);
            }
        }
        if (finalitem.length != 0) {

            var random = new java.util.Random();
            var finalchance = random.nextInt(finalitem.length);
            var itemId = finalitem[finalchance][0];
            var quantity = finalitem[finalchance][2];
            //var notice = finalitem[finalchance][3];
            // item = cm.gainGachaponItem(itemId, quantity,);//, notice
            var Laba = finalitem[finalchance][3];


            if (ii.getInventoryType(itemId).getType() == 1) {
                var toDrop = ii.randomizeStats(ii.getEquipById(itemId)).copy();
                MapleInventoryManipulator.addFromDrop(cm.getC(), toDrop, false);
            } else {
                var toDrop = new Equip(itemId, 0).copy();
                cm.gainItem(itemId, quantity);
            }

            if (Laba == 1) {
                cm.itemlaba("恭喜喇叭", toDrop)
                cm.gainD(-300);//给抵用第二种函数
                cm.getPlayer().setOneTimeLog("choujiang");//给永久记录
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
            } else {//不喇叭
                cm.itemlaba("恭喜喇叭", toDrop)
                cm.getPlayer().setOneTimeLog("choujiang");//给永久记录
                cm.sendOk("你获得了 #b#t" + itemId + "##k " + quantity + "个。");
                cm.gainD(-300);//给抵用第二种函数
            }
            cm.dispose();
        }
        cm.dispose();
    }
}